[
    {
        "song": "Remember",
        "artist": "Jodi",
        "spotify_id": "5oDRMJMrMhEuFq37stGFkW",
        "post_page": "2020-12-07",
        "description_lines": [
            "Sometimes we impress even ourselves.",
            "When we first came across \"Remember,\" it stood out to us as something we'd heard before. (Not the song itself, of course--we knew that was new. But like a feeling of deja vu you feel in a place you're sure you've never been, it felt <i>familiar</i>.) There was something about the nonchalant vocals, the endearingly overwritten lyrics (such as \"metacarpal karaoke\"), the old attic creakiness of the acoustic guitars and drum sets, the way that the same melody evolves and changes over bars and bars (like those syncopated 16th notes we get on the guitar) but never gets very far from where it began, that felt like something we'd been listening to for a long time.",
            "Was it DeYarmond Edison? That was part of it, but not quite. This was a little too raw, alive, and youthful for that. And then it hit us: Pinegrove. It never explodes the way certain Pinegrove tracks--c.f. \"Aphasia\"--do, but all of the pieces were there. And a quick Google search revealed that, indeed, \"Remember\" is an entry from a 2017 stand alone solo EP by former Pinegrove founding member Nick Levine. (Nick is the brother of Pinegrove drummer Zack Levine, who is responsible for, among other things, the incredibly on-point and tasteful drumming in <a href=\"https://www.youtube.com/watch?v=YnsiyiC0Nc0\">\"this live studio version of \"Aphasia\"\"</a>--check out 2:30 and 4:15-4:25 (that fucking cymbal choke, though...))",
            "So, yeah. Sometimes we can hear when music sounds like each other."
        ]
    }, {
        "song": "Bara du och jag",
        "artist": "Tove Styrke",
        "spotify_id": "0xfpnnU2xGRDfaAXLqe6Je",
        "post_page": "2020-12-07",
        "description_lines": [
            "As soccer fans the US over know, the road to alternative relevance runs through the leisures and pastimes of Europe. We're not much for soccer ourselves--lotta unnecessary plays--but we get our kicks too.",
            "One such kick in recent years has been Tove Styrke. Styrke, who got her break in 2009 when she finished as the third place contestant on Swedish Idol (this is real), went on to establish a solo career that eventually lead to 2018's absolutely fire <i>Sway</i>. Seriously, we know every beat and moment of this record. It may have been the only thing we listened to over the course of that entire year. This is another one to just do the whole way through, but if you must streamline, start with opener \"Sway\" and then move on to \"Mistakes,\" which is probably the best song ever written. (Then, check out <a href=\"https://www.youtube.com/watch?v=8AAD9CX0e-E\">\"another live studio version\"</a>, this time with Karl Almost Knausgaard on drums.)",
            "At any rate, we've been on the lookout for some new Tove Styrke for awhile now, but all we ever get is Tove Lo. Well, no longer. Because now we've got \"Bara du och jag\" (which, Reddit tells us, translates to \"Just You and Me.\" And even though the majority of the lyrics--aside from \"come dance with me darling\"--are in Swedish, it's definitely got that vibe.) This isn't as bare and cool as Sway. It's louder, broader, more of a mouthful, more earnest. The opening notes almost remind us of Love You Later's \"How Many Nights Do You Dance with Tears in Your Eyes?\" Pretty quickly, though, that plucky, ebby bass in the background is accompanied by a four-on-the-floor bass drum pattern that tells us things are going to get a little more upbeat than that. And indeed they do. Next comes a first pass at a chorus, and then a second, with more and more instrumental voices layering on. Pretty soon, the whole thing is plugging along behind a series synthy backbeat.",
            "Like we said, it's less cool and guarded than <i>Sway</i>. There's actually--dare we say it?--a hint of ABBA to the whole thing. And all of your friends down on the pitch will think it's bloody brilliant that you're listening to music in another language"
        ]
    }, {
        "song": "Good Girls (Don't Get Used)",
        "artist": ["Beach Bunny", "Phoebe Bridgers"],
        "spotify_id": "2yKNCN7jsi5XtwJL5jBG1z",
        "post_page": "2020-12-07",
        "description_lines": [
            "Longtime readers of the WMT just soiled themselves.",
            "That's right--we've got ourselves a new Coastal Rabbits track. The Oceanside Hares require no introduction here, especially after 2020's Honeymoon--which we fully expect to grace a lot of the aforementioned Top 10 lists around here. If you're somehow still unfamiliar, can we recommend \"Ms. California\" off of that record, as well as earlier tracks like \"Prom Queen\" and \"Sports\"?",
            "At any rate, for those who've been around the block, let's talk about \"Good Girls (Don't Get Used).\" There's a lot of classic Beach Bunny here: youthful female vocals, shimmering arpeggiated chick pop guitar parts, punchy driving drums with a tom-tom-forward interlude, and lyrics lifted straight from a high school diary. Here's where we actually find the biggest change. Because unlike the earlier tracks we mentioned above, lead singer Lili Trifilio is no longer singing about her shortcomings or the girls that got the guy she wanted--now she's taking aim at Chad himself.",
            "By the way, not this is at all relevant to anyone we know, but Beach Bunny are scheduled to perform in Paris, France on April 19th, 2021. Just sayin'."
        ]
    },{
        "song": "What Are Friends For?",
        "artist": "The Sonder Bombs",
        "spotify_id": "64F2l136oePmUwOG9zB1vU",
        "post_page": "2020-11-30",
        "description_lines": [
            "Speaking of pop punk, check out this track by The Sonder Bombs. (Fun fact from the band's website: \"sonder\" itself is a noun which apparently stands for the feeling that comes with the realization that all of the strangers around you are living lives as rich and meaningful--not necessarily in a good way--as yours.) This is fun, energetic, sad chick pop punk that sounds like a threesome between Beach Bunny (aka Coastal Rabbits), Sincere Engineer (aka Heartfelt Architect), and Snarls (good luck on that one), all of whom have graced places atop the WMT in weeks past.",
            "Our one minor complaint with this one is that we think it might've been better served by a more lo-fi approach. It feels a little produced at times, but is nevertheless highly listenable and seems to possess a strange power over the \"repeat\" button."
        ]
    }, {
        "song": "What Year Are We In",
        "artist": "Kitten",
        "spotify_id": "1jkCLNfGQJgymKExs4MGZs",
        "post_page": "2020-11-30",
        "description_lines": [
            "Kitten are stars of the WMT. \"Memphis\" (not to mention its acoustic follow-up) remains one of the best and most infectious songs we've ever had the privilege to cover, and the group took a turn towards <i>la resistance</i> with the COVID-era herd immunity anthem \"My House.\" (The cover art to that single depicted a nude demented looking version of the group's lead singer stuffed into a miniature-sized house and the lyrics explained  that \"I'm watchin the world freakin out from my couch/Don't know what they're talkin about in my house/I wanna have fun again, I wanna go out/But they told me to stay in my house.\") Now, Kitten continue their turn toward far-right extremism with another banger entitled \"What Year Are We In,\" which talks about the hopeless nature of protests, Zoom parties, and getting pissed off over conspiracy theories.",
            "As far as the sound, it's got a bounce to it. There are some synthy keys and horns, not to mention a drum machine, that make the whole thing sound like an updated '80s throwback, which fits in well with the name and theme. There are other parts of the track that remind one of Madness (and, of course, \"[Their] House\"). In the end, one of the things that really interests us about Kitten is that, of the four tracks of theirs which have made it onto the WMT, they're all bangers, but they all sound totally different"
        ]
    }, {
        "song": "Hurt Me Now",
        "artist": "ASL",
        "spotify_id": "6tDrZQQhEWrHsYafpziiwg",
        "post_page": "2020-11-30",
        "description_lines": [
            "a/s/l? (only kids from the '90s will get it!!!)",
            "Anyway, we stumbled across this track, from a group that seems only to have been making music since about 2018, over the course of this past week. It should be kind of a mess of a track, with lots of heavy synth, drum machines, tons of reverb, misplaced horns, and a borderline hip hop/spoken word chorus, but all of it comes together in a surprisingly pleasant way. This isn't a banger--it's not one that's going to carry you away immediately. It's got the vibes of Robbi Robb's \"In Time\" but without the power and meaningfulness. But if Blood Orange's \"Time Will Tell\" is the perfect track for a postgame a deux, then \"Hurt Me Now\" might work best for its melancholy solo equivalent."
        ]
    }, {
        "song": "Empty (Dirt Road)",
        "artist": "Metric",
        "spotify_id": "7z7PeijP5wMkEWHvTrWKer",
        "post_page": "2020-11-23",
        "description_lines": [
            "Metric are, as an act, nearly as old as us, and yet they are also relatively unfamiliar to us. We've heard of them, of course, and they seem to be favorites of a lot of our fellow travelers, but we've never really listened to them at all.",
            "Well, in 2005, they released in album called <i>Live it Out</i>, which opened with a track called \"Empty,\" which we've never heard before. We bring this up because, recently, they released an acoustic version of this song which came across our desk. \"Empty (Dirt Road),\" as this version is called, is pretty nice. It opens with a creaky, antique-y finger-picked acoustic guitar, a pretty resonant-sounding piano, and a whole lot of reverb. The track stretches and pops its' knuckles in ways that remind us of Marlon Williams' \"Strange Things\"--which you may recognize from the soundtrack of <i>Wild, Wild Country</i>--but without any of the creeping, old-timey eerieness of that track. Instead, what we've got here is melancholy, almost like Williams meets Jewel meets, at times, The Weakerthans.",
            "One of the things we like about this song is how long it lasts. It feels almost oppressive--it just goes on and on, and eventually resigns itself to its final, unbelieving refrain: \"I'm so glad I'm an island now\" [via Paul Simon and Garth Brooks]."
        ]
    }, {
        "song": "Walking on a String (Alt. Version)",
        "artist": ["Matt Berninger", "Phoebe Bridgers"],
        "spotify_id": "4k4VlcZtwPBDj6wx5ewzog",
        "post_page": "2020-11-23",
        "description_lines": [
            "Because Phoebe Bridgers is one of our favorite young artists, anything to which her name is attached is of immediate interest to us. In 2019, Bridgers collab'd with The National's Matt Berninger to record a track called \"Walking on a String.\" They released two versions of the track--the original and the \"alt version.\" The first one is a little more Berninger-forward, while the alt version is more Bridgers-forward, and, since we like Phoebe Bridgers more than we like The National, the alt version is our version of choice. It really sounds like it could have been a hidden track on 2018's <i>Stranger in the Alps</i>. (If, by some unfortunate turn of events you haven't yet experienced <i>SITA</i>, you've got something great coming. It's a solid listen-through, but \"Motion Sickness\" and \"Scott Street\" are early Stan Doubts.)"
        ]
    }, {
        "song": "Special Berry",
        "artist": "standards",
        "spotify_id": "6wQxjMRiJ9uqCiJSV5yAU7",
        "post_page": "2020-11-23",
        "description_lines": [
            "Call it what you will: math rock, post-rock, whatever you want, standards is apparently an Ezra Koenig-lookin' motherfucker with a guitar, but he does a lot with it. This track reminds us a lot of Fang Island, or the happy-go-lucky younger brother to Joan of Arc, or even, at times, STS9. It's basically a single guitar riff extended to about 3 or 4 minutes and length and constantly recycled and reinterpreted according to different genres, techniques, and tempos. Think of it as an organic \"Grape Soda.\"",
            "This dude also has a vibe. If you check out the music video for standards, you'll note his, again, Ezra Koenig face, his cutesay fingerboard inlays, and his array of stuffed animals. It extends to the cover art for his (their?) recent record, <i>Fruit Island</i>, as well."
        ]
    }, {
        "song": "Prior Things",
        "artist": "Hop Along",
        "spotify_id": "3X2899UzmQjl7gz0JsH42k",
        "post_page": "2020-11-16",
        "description_lines": [
            "This one came to us via shuffle, and although we'd never heard of Hop Along before--and had, admittedly, to clarify which phrase was the band name and which was the song title--it felt really familiar. It has a nice, comfortable, strumming-on-an-acoustic-guitar momentum to it (though with a little buried bit of the sort of string-forward frenzy that's showcased on tracks like, say, \"Burn the Witch\" by Radiodome), and the unusual particulars of the lead female vocals reminded us of Francis Quinlan, who appeared on the WMT earlier this year with \"Piltdown Man.\"",
            "Indeed, a quick Google search reveals that \"Piltdown Man\" is one of Quinlan's solo efforts, and that, as a day job, she fronts Hop Along. So, look at us. This track doesn't grab us as much as \"Piltdown Man\" did--that one felt like it was written after spending some time with Joanna Newsom's Divers (which, speaking of spending time with, is worth about 8 months of your time)--but it's not nothing, neither. "
        ]
    }, {
        "song": "Runaway Dog",
        "artist": "Retirement Party",
        "spotify_id": "75ZI6agJsfrauG2Az6myJK",
        "post_page": "2020-11-16",
        "description_lines": [
            "We'll start by saying that you've got to give this one a minute. When it first opens, it does so over about a minute of a coughy, polluted guitar and bass riff, but this is like one of those indie tracks from the early-to-mid aughties that builds and builds and builds. In that respect, it almost feels like Funeral-era Arcade Fire, but like, if they had just discovered distortion and were, like, mildly about it. All in all the best part of this track is the outro, when the same forward momentum that's been building throughout the entire track barrels down on you underneath a desperate, arpeggiated...is it synth? is it guitar?...riff.",
            "Once that first minute is over and the song starts to bloom, you'll get the idea pretty quickly. From there, you can make up your mind for yourself or not as to whether to keep things going."
        ]
    }, {
        "song": "Over You",
        "artist": "HOLYCHILD",
        "spotify_id": "0O9AJJwRYvtiVGMceCC7lF",
        "post_page": "2020-11-16",
        "description_lines": [
            "We deliberated over this one for a while. But, in the end, what's to deliberate over? It's a big, synthy, bombastic, chick-driven pop song, and isn't that what we're mostly about here at the WMT? The verses here plod along atop a four-on-the-floor drum beat. That pattern continues into the choruses, of course, but it's joined by an explosion of shimmery synth parts that really take everything over the top. Just over halfway through, we also get a nice interlude that tamps things down in a way that feels middle school meaningful.",
            "Who do they sound like? There's so much going on here that it's a little hard for us to tease it out. It's like a big sloppy mess of bubblegum Robyn and indie Ting Tings and Spiceworld-era Spice Girls. (The Weekly Music Thread--it's like wine tasting, but for random songs from Spotify.)",
            "And, for what it's worth, Wikipedia tells us that, back when they were together, HOLYCHILD were \"known for their use of pubic hair in music videos.\" But, then again, who isn't?"
        ]
    }, {
        "song": "two reverse",
        "artist": "Adrianne Lenker",
        "spotify_id": "630Ts93UYV4ULSjsBDQdvn",
        "post_page": "2020-11-09",
        "description_lines": [
            "Adrianne Lenker, best known for fronting Big Thief, has recently started releasing solo music, and this track (the opener to 2020's songs) is one which really grabbed us. A ballad driven by intricate, vaguely dissonant, and at-times-finger-picked strings, it feels like Big Thief (duh) meets Joanna Newsom meets recent Tallest Man on Earth. It's beautiful but melancholic, peaceful but with a touch of quiet frenzy to it, too. You best believe that this track is going to kick off on our part an exploration of more of Lenker's solo work."
        ]
    }, {
        "song": "faith healer",
        "artist": "Julien Baker",
        "spotify_id": "2hNXb6IDn3CvvHjjwauEM3",
        "post_page": "2020-11-09",
        "description_lines": [
            "We've been big fans of Julien Baker ever since she burst onto the scene with 2015's <i>Sprained Ankle</i>. (If you haven't already, listen to that whole record straight through, but if you must pick favorites, we recommend the eponymous \"Sprained Ankle,\" \"Everybody Does,\" \"Something,\" and the elegiac \"Go Home.\" Like Justin Vernon and Kristian Matsson, Baker's got a thing for ending guitar records with piano tracks.)",
            "Like Phoebe Bridgers (with whom she collabs in the form of Boygenius), Baker is following up soft-spoken success with louder, more electric efforts. And although \"faith healer\" definitely retains a lot of the beauty of Baker's earlier work, \"louder\" is definitely the right word--the track is, at times, downright cacophonous (relative, of course, to Baker's other work). This song feels more confident than anything else she's released before. We look forward to seeing where that goes."
        ]
    }, {
        "song": "Killing Floor",
        "artist": "Emma Ruth Rundle, Thou",
        "spotify_id": "7CdVWqLUcMrFQH2fakdhRi",
        "post_page": "2020-11-09",
        "description_lines": [
            "The first track on this week's list to receive proper capitalization, \"Killing Floor\" is a little different from the usual fare on the WMT. It opens with nearly a minute of spectral, synthy tones which sort of evoke Disintegration-era The Cure or William Basinki's Disintegration Loops. At nearly the one minute mark, however, we break into a synthy, sludgy, metallic lurching sort of drone which creeps its way along for the next five or so minutes. We're not sure if this one will stick or not, but it's a really cool track (and the cover art for the record is really cool)."
        ]
    }, {
        "song": "Television Romance",
        "artist": "Pale Waves",
        "spotify_id": "2diAlJqrMMX7Sv9FlzcUMc",
        "post_page": "2020-11-09",
        "description_lines": [
            "The title and band name alone were almost enough to land this track on the WMT. Come on, look at 'em--you just knew this was going to be up our alley.",
            "\"Television Romance\" is an instant banger. Even before you've heard the chorus, you know it's going to be an infectious synth pop dance anthem. It's got that organic, unsophisticated synth sexiness of, for example, a \"Kim and Jessie\" or a \"Graveyard Girl\" or a \"Hearts Like Ours.\" In all of these cases, what makes the refrain captivating is less its lyrical content and much more some sort of guitar and/or keys hook, and the same is true here. (That being said, repeating the phrase \"television romance\" over and over again has its own intoxicating adolescent import.)",
            "This song is like the soundtrack to some imagined, less affecting prequel to <i>Bright Lights, Big City</i>"
        ]
    }, {
        "song": "Wheels Roll Home",
        "artist": "The Antlers",
        "spotify_id": "1KtWevswskSNR37e8hi9iC",
        "post_page": "2020-11-09",
        "description_lines": [
            "What? Yes. New music from The Antlers--this is exciting stuff.",
            "As you may or may not recall, The Antlers released the single greatest album of all time in 2009's <i>Hospice</i>. Seriously. If this hasn't affected you, take the next 18-24 months and listen to it almost exclusively, just like we did. Not impressed on first listen? Okay. Join the club. Listen to it a second time. \"Oh, yeah, I guess 'Bear' and 'Two' are pretty good.\" Oh, do you? Listen to it a third time. \"Oh Sylvia is kind of cool, too, I guess.\" That so? Do it again and again and again until you begin to realize that every single moment of that record is more important than the most important moment of your life. But that's okay, because by that time, every single moment of that record will be a moment of your life, too.",
            "At any rate, after Hospice, The Antlers went on to release <i>Burst Apart</i> (2011), <i>Undersea</i> (2012), and <i>Familiars</i> (2014). Then, tragically, they stopped making music. In March of last year, however, rumors surfaced that they were recording again, and last week frontman Pete Silberbro and drummer Michael Lerner released the single \"Wheels Roll Home.\" Per Silberdude, \"'Wheels Roll Home' is a simple song about the hopeful promise of reunion after a long time gone. It's that feeling of finding home in someone, eager and impatient to build a life together. It's the experience of waiting out tumultuous times, longing for stability someday.\" As Timothee Chalamet might say, \"ca fait longtemps.\"",
            "As far as the track itself goes, it's very <i>Undersea/Familiars</i>-wave, but we're not complaining. We're looking forward to the full-length. In the meantime, as the temperature continues to go down, we plan on spending yet another winter--our twelfth straight--with <i>Hospice</i>."
        ]
    }, {
        "song": "Trust Me",
        "artist": "Sincere Engineer",
        "spotify_id": "72rJBBioVhxm4A3XajM3Yn",
        "post_page": "2020-11-09",
        "description_lines": [
            "For more on Sincere Engineer, check out this week's <i>Up the Punx</i> installment below.",
            "As for this track in particular, \"Trust Me\" is a 2020 single which we hope heralds the appearance of a full-length (or at least a few more singles) on the horizon. This is a little darker and more emo-informed than Sincere Engineer's earlier works, and the production is certainly more polished as well. To be frank, we'd actually recommend starting with 2017's <i>Rhombithian</i> (just see below already!) and then coming back to this emo banger. But you really can't go wrong--these guys make very solid garage punk music."           
        ]
    }, {
        "song": "SGL",
        "artist": "Now, Now",
        "spotify_id": "3speBfGPCck1oe47EBPnhh",
        "post_page": "2020-11-02",
        "description_lines": [
            "Although we're not familiar with this group, they seem to have something of a discography (along with something of a following). At any rate, this track, \"SGL\"--which presumably, based on the lyrics, stands for \"shotgun lover\"--is worth at least a few listens. There's a warmth to the recording effects on the eighth note acoustic guitar strumming that backs the whole thing, and it feels almost like the War on Drugs meets Phoebe Bridgers meets Washed Out? But that doesn't quite put a finger on it, does it?",
            "Also, the music video, which is almost nothing, is also somehow strangely affecting..."
        ]
    }, {
        "song": "Nobody Loves You",
        "artist": "Similar Kind",
        "spotify_id": "4hlQeZJV29wKrTPLmqXkab",
        "post_page": "2020-11-02",
        "description_lines": [
            "In contrast to this week's other offering, Similar Kind are a group with a small discography and a small following (less than one-tenth of the monthly listeners of Now, Now). That being said, this track is an infectious one. It carries forward with what feels like a hi-fi version of Flake Music energy, and there's a touch of The Cure in some of the guitar runs you'll hear in the background. Interestingly, the drums are a little bit busier than you typically get on this sort of track, and the mix is surprisingly bass-forward, but all of those contribute to a frenetic energy which kind of meshes with the lyrical content."
        ]
    }, {
        "song": "Easier to Love",
        "artist": "Kississippi",
        "spotify_id": "3GqVIRlygsC48rklRcAHTb",
        "post_page": "2020-10-26",
        "description_lines": [
            "We're newcomers to Kississippi. We've seen the name around but have never really gotten into them. We decided to give them a spin this week, and came across these two tracks.",
            "\"Easier to Love\" has a little bit of a Beach House vibe to it, what with the washed-out tremulousness, crisp and clean hi hat notes, and glassy, staircase-climbing guitar parts. But there's something else to it, too, almost like early Pure Bathing Culture.",
            "\"Around Your Room\" is a harder track. Right off the bat, it's got a fat, serious bass line, and it pairs it with big ass percussion. About the bass line--it's like something off of the Drive soundtrack. That being said, nothing else here really is. If \"Easier to Love\" was like Beach House + Pure Bathing Culture, \"Around Your Room\" is like Heartthrob-era Tegan and Sara + Lover-era Taylor Swift. (In fact, listening to \"Around Your Room\" and \"Cruel Summer\" back-to-back, there's a definite harmony there.) So, you do the math."
        ]
    }, {
        "song": "Around Your Room",
        "artist": "Kississippi",
        "spotify_id": "37C77C5KP3MZINt2P3HZUv",
        "post_page": "2020-10-26",
        "description_lines": [
            "We're newcomers to Kississippi. We've seen the name around but have never really gotten into them. We decided to give them a spin this week, and came across these two tracks.",
            "\"Easier to Love\" has a little bit of a Beach House vibe to it, what with the washed-out tremulousness, crisp and clean hi hat notes, and glassy, staircase-climbing guitar parts. But there's something else to it, too, almost like early Pure Bathing Culture.",
            "\"Around Your Room\" is a harder track. Right off the bat, it's got a fat, serious bass line, and it pairs it with big ass percussion. About the bass line--it's like something off of the Drive soundtrack. That being said, nothing else here really is. If \"Easier to Love\" was like Beach House + Pure Bathing Culture, \"Around Your Room\" is like Heartthrob-era Tegan and Sara + Lover-era Taylor Swift. (In fact, listening to \"Around Your Room\" and \"Cruel Summer\" back-to-back, there's a definite harmony there.) So, you do the math."
        
        ]
    }, {
        "song": "Die Waiting",
        "artist": "Beck",
        "spotify_id": "4qAGr8V6mMg9itQpzcIB38",
        "post_page": "2020-10-26",
        "description_lines": [
            "Beck is one of those artists we've always wanted to explore more. We spent a lot of time with Midnite Vultures (1999) for about two weeks in Boston, but past that, we've never really given the man his career's due. Perhaps one day.",
            "At any rate, we stumbled across this track, from 2019's <i>Hyperspace</i>, and quite liked it. (By the way, check out that album artwork.) It's a pretty mellow track and you get the hang of it quite quickly, but it's nice for driving around with the windows down when it's about 65 degrees outside and you vibin'."
        ]
    }, {
        "song": "The Whole of the Moon",
        "artist": "Kirin J Callinan",
        "spotify_id": "1601brj4nGFEWeOxe7KJuk",
        "post_page": "2020-10-26",
        "description_lines": [
            "This track comes to you courtesy of the dialysis queen of Durham. A musician who says that his primary motivation is to \"excite and confuse,\" Callinan makes these big, bombastic '80s informed anthems. This is a track which bounces along on its spritely synth and arena drums, but what we really like about it is the way Callinan strains when he reaches for certain notes. That, along with the soaring feeling of some of the guitar parts, really reminds us of John Parr's \"St. Elmo's Fire.\" (Interestingly, \"St. Elmo's Fire,\" which is the best song ever made, was written for the original soundtrack to <i>St. Elmo's Fire</i>, which is the worst movie ever made.) There's also a little bit of Robbie Robb's \"In Time\" here. (Interestingly, \"In Time,\" which is also the best song ever made, is part of the original soundtrack for <i>Bill and Ted's Excellent Adventure</i>, which is a pretty good movie.)"
        ]
    }, {
        "song": "Hate Mail (feat. J Mascis)",
        "artist": "Weakened Friends",
        "spotify_id": "6h5BX0HE5FoqrCP3xW8Txl",
        "post_page": "2020-10-26",
        "description_lines": [
            "We've had this track on repeat all week. It's a grungy, chick-fronted alternative track that features former Dinosaur, Jr. J. Mascis on a pretty squealy/shreddy guitar part. The verses have this sort of round, redundant, trundling feel to them, but transition into these sublime sing-along choruses heralded by some buried but reliable guitar scratches.",
            "Elements of this remind us of a much more laid-back and approachable White Lung. More on that below."
        ]
    }, {
        "song": "Wingspan",
        "artist": "Prinze George",
        "spotify_id": "5OftW7uxP2Z2rtbfkAbVjq",
        "post_page": "2020-10-19",
        "description_lines": [
            "This is a group we hadn't heard of before, with a few singles and a 2016 full-length by the excellent name of <i>Illiterate Synth Pop</i>. We'll investigate that one more fully in the week to come. As for this track, it's a pretty mellow, bassy ballad. It reminds us a little bit of Miel with a touch of that M83-style synth in the interlude. The track kicks up a little bit in the latter third with an octave jump in the vocals. There's nothing super stand-out here but it'd be fitting on a vibe playlist."
        ]
    }, {
        "song": "Only Acting",
        "artist": "Kero Kero Bonito",
        "spotify_id": "4aIoxZWHySrA3BpnmeREXJ",
        "post_page": "2020-10-19",
        "description_lines": [
            "Sometimes it seems like we've always been floating in the same orbit as Kero Kero Bonito. That being said, we've never really listened to them--until now.",
            "\"Only Acting\" is a track off of their 2018 <i>Time 'n' Place</i>. It opens up with a sing-song vocal melody over a drum machine and follows up by layering a bass line on top of that. This repeats for a while in a way that doesn't particularly grab you as a listener--until the entire track switches to a lofi take on organic instrumentation. At this point, the exact same arrangement feels utterly irresistible ,and we imagine it's hard to listen to on anything other than high volume (we haven't tried).",
            "It takes balls to break away from something so catchy, and KKB do exactly that. The song oscillates back and forth between this sort of pissed off daughter of Weezer vibe and a progressively cacophonous and electronic disintegration. Yes, there's a key change, but KKB undermine it almost immediately with aggressive glitching which heralds the end of the track. Although it's annoying to be taken away from the super infectious, driving side of this song, the whole thing kind of works, and we've listened to it in its entirety more than a few times at this point."
        ]
    }, {
        "song": "Hit Me Where It Hurts",
        "artist": "Caroline Polachek",
        "spotify_id": "2wcrQZ7ZJolYEfIaPP9yL4",
        "post_page": "2020-10-19",
        "description_lines": [
            "Back in 2019, Caroline Polachek's <i>Pang</i> appeared on a list of \"Best of\" lists, but we were never really able to access it. We're not sure whether or not that's still the case, but we came across <i>Pang's</i> \"Hit Me Where It Hurts\" last week and really liked it. It's got a dreamy, synthy, barred out borderline spoken word chorus melody that's vaguely reminiscent of Das Racist's \"Fashion Party,\" but this song isn't as light and tongue-in-cheek as that one is. The pre-chorus and chorus make that clear.",
            "This is a track that's at home on the same playlist as \"Wingspan,\" above."
        ]
    }, {
        "song": null,
        "artist": "Chumped",
        "album": "Chumped",
        "spotify_id": "7pVKWe8jRWOYxsnfhRoCci",
        "post_page": "2020-10-19",
        "description_lines": [
            "Chumped is a 2013 EP from the defunct, Brooklyn-based pop punk outfit of the same name. We encountered it this week for the first time and it really grabbed us. It's evocative of early Alkaline Trio meets The Ergs! meets maybe a little bit of Charly Bliss?--or at least that's the best we can do here. It's got a charming level of underproduction to it, and there's real energy and feeling behind these tracks."
        ]
    }, {
        "song": "Cancer in the Water",
        "artist": "Clarence Clarity",
        "spotify_id": "2aHWWqD3ceKgFff07klSUg",
        "post_page": "2020-10-12",
        "description_lines": [
            "If you have trouble finding this track, it's because the \"TM\" in the title is actually superscripted, not parenthetical. We just couldn't figure out how to do that in Gmail.",
            "At any rate, we stumbled across this track this week, and it exists somewhere at the intersection of crunchy and fun. The whole thing is basically one big loop, right down to the vocals: \"Before I get out/I'll put cancer in the water/before you got out/you left cancer in me.\" Whatever that means precisely is beyond us, but it's clear that it means <i>something</i>. (There are those on the internet who think the song is about the fluoridation of the water supply [via How I Learned to Stop Worrying and Love the Cancer in My Water].)",
            "As that Radioguts-wave lyrical loop burrows its way into your thoughts, the rest of the track expands to occupy your earballs. It's carried along by a jaunty little melody that whirrs and clicks, beeps, shudders, and groans, but never strays too far away from its catchy base. It feels a little bit like Baths meets Katie Dey (but we repeat ourselves) meets Passion Pit. (And if you don't know Katie Dey, who appeared on this thread a month or two back, may we please recommend \"Darkness\"?)",
            "Guys, this one is an obvious choice. It's not going to change lives but it'll certainly enhance any carefree day."
        ]
    }, {
        "song": "Finally Found",
        "artist": "Graveyard Club",
        "spotify_id": "2UyQA6lJdRSJXprPtvJrds",
        "post_page": "2020-10-05",
        "description_lines": [
            "A familiar favorite, Graveyard Club have appeared on the WMT before for the excellent \"Witchcraft,\" \"Cellar Door,\" and \"Valens.\" Well, we were revisiting them this week, and we stumbled upon another keeper: \"Finally Found.\" This track, from 2019, eschews the M83 synth fuzz of some of those others in favor of a serious, almost '50s doo wop sensibility, replete with those \"2and...4\" snare notes. It'd be at home in a David Lynch re-make of <i>Grease</i>."
        ]
    }, {
        "song": null,
        "album": "Live Forever",
        "artist": "Bartees Strange",
        "spotify_id": "4Lu520UvMf7lJccCnKw3hJ",
        "post_page": "2020-10-05",
        "description_lines": [
            "This isn't the first time Strange has appeared on the WMT. A budding solo artist, Strange has been releasing singles over the past month or so--most notably, \"Mustang\" and \"Boomer\"--in anticipation of his first full-length original solo album, Live Forever. (We've been really, really hot on those two tracks, by the way.) Well, <i>Live Forever</i> has dropped in the past week, and we've had time to give it a listen or two since it did.",
            "This is an interesting, if loose, record. It sounds almost like one you discover after getting into an artist's later work, then going back and revisiting their early stuff and telling your friends, \"Yeah, but have you listened to his early stuff? Some of that's pretty cool, too.\" The record kicks off with a creaky and ethereal track, \"Jealousy,\" which as a stand-alone doesn't seem to stand for all that much (which, according to our co-workers who are really into mainstream politics, means it will fall for anything.) Where \"Jealousy\" mostly makes its money is as a lead-in to second and third tracks \"Mustang\" and \"Boomer,\" which retain some of the creakiness but up both the amplitude and the tempo. These were the two singles we were most excited about in past weeks, and they're the by far the standouts on our early listens. They've both got that National desperation that marks the best of Strange's solo tracks. After that, the record travels into Strange's third single, \"Kelly Rowland,\" which, aside from its interesting sample, never captured us as much as the other two did.",
            "The next two tracks, \"In a Cab\" and \"Stone Meadows,\" mostly sound like less fully realized versions of Strange's other signals. Things take a turn, however, with \"Flagey God,\" which, atop a vaguely subterranean house music backbeat, manages to sound something like a cross between a haunting and an R&B single. From there, the rest of the back half of the record is much, much looser than everything that came before it. Several of the tracks are essentially just strings and vocals with synth landscapes slothing around behind them.",
            "On the whole, we don't exactly know what to do with this as a record. There's a lot we really like here--the whole thing has a roomy sort of unsettling noisiness to it, like a beautiful jalopy bumping and trundling through an eerie and unfamiliar fog. You can't quite make out where different sounds are coming from, whether they'll repeat or not, whether they have anything to do with the melody at all or whether they're just window dressing. But this is as much a strength as it is a weakness, and we if Strange will find a more effective way to consistently harness it moving forward."
        ]
    }, {
        "song": "My Trust is Low",
        "artist": "M4ts00n",
        "spotify_id": "6ZPzJi1KcV2M1KY3EkNa2K",
        "post_page": "2020-09-28",
        "description_lines": [
            "This is a really neat track. It's a creative, repetitive, stripped down loop that evokes The Books and, with its mixture of twangy strings and synth chords, almost an Uncle Kracker pop country vibe, if you will. Like a Kerouac novel, you'll get the idea about 30 seconds in, and decide that you either love it or hate it. (Unlike a Kerouac novel, on the other hand, we like this.)"
        ]
    }, {
        "song": "S.W.I.M.",
        "artist": "Midwife",
        "spotify_id": "41qO4ILS1Gm4A1Szf25pz3",
        "post_page": "2020-09-28",
        "description_lines": [
            "The first thing we noticed about this track is the title. \"S.W.I.M.,\" for those not in the know, is an extremely clever acronym--Someone who isn't me--that people use on Reddit when they want to inquire about drugs. Law enforcement haven't figured it out yet, and defunding of the police is likely to put that understanding even further out of reach, but stay tuned. They may surprise us yet.",
            "At any rate, the second thing we noticed about this track is this track. The whole thing is heavy, a big fuzzy blanket of synth, but like under that blanket you're on an Ambien as well. The track feels like warm water washing over you, the rhythmic eighth notes ebbing and pooling around your outline as you lay on your back in the lazy surf. This one is for feeling meaningful. It's fitting that the vocals are so obscured that you can barely understand them-- you don't need to. You can't make out the words from where you are, underwater, but it doesn't matter--you already know what they mean. And we have this feeling like the water motif here is about rebirth. Like an addict who has freed himself from the cycle, one you read about once, in a long novel that you really liked, laying in the water on the beach as the tide rolls in and out, in and out, in and then out again. And he just lays there.",
            "(If you can't tell, we're listening to it as we write this.)"
        ]
    }, {
        "song": "Keep It Up",
        "artist": "Niko Noki",
        "spotify_id": "0hluOHimkaXBe4s8yO990Z",
        "post_page": "2020-09-22",
        "description_lines": [
            "The only really lasting thing to come out of Cuties. Early on in the film, the protagonist discovers a group of 11-year-old dancers, and films them as they offer signature dances to this track. It's fun and benign--we actually remarked out loud \"this film seems totally benign!\" (Like Lars von Trier's <i>Antichrist</i>, though, things eventually take a very dark turn--the controversy, if a little over blown, is still somewhat warranted.) At any rate, this track is an original which was made for the film.",
            "It's a fun, bouncy, dance pop track. It sounds sort of like if the Spice Girls were around today as a Tik Tok group, and their music was a captcha. The strong back beats and crowded rhythms offer a lot of texture to dance against, which is probably why it was selected for the scene it was used in. That being said, it's not clear to us whether the track can stand on its own apart from the film. It feels a little dinky on its own, a little flimsy--sort of like Less than Jake's \"We're All Dudes.\" Infectious when you hear it along with the movie's characters, but lacking when you don't."
        ]
    }, {
        "song": "Bye Bye Bye",
        "artist": "Brian Robert Jones",
        "spotify_id": "6qZyIToSdYKFhf58IFK9GW",
        "post_page": "2020-09-22",
        "description_lines": [
            "Brian Robert Jones (of Vampire Weekend fame) is celebrating the 20th anniversary of NSYNC's <i>No Strings Attached</i> with a synth- and vocoder-heavy re-release of <i>the entire album</i>. The entire thing just dropped, but we haven't had time to make our way through all of it. (And, frankly, we're not as familiar with some of the non-hits on it.) \"Bye Bye Bye,\" however, works surprisingly well in this format. It's actually a lot more interesting than the original arrangement.",
            "This is better than as good as covers get. Most covers are just carbon copies of the original track you loved, but because they're not exactly the same as the song you loved in the first place, they feel degraded. Then there are covers that aren't particularly <i>good</i> but at least deserve credit for doing something wildly different. This is the rare cover that, as recognizable as the original is, doesn't feel like a cover. It feels like its own track. It's honestly hard to believe it isn't. It just works so damn well."
        ]
    }, {
        "song": null,
        "album": "Love in the Time of Email",
        "artist": "Antarctigo Vespucci",
        "spotify_id": "0fB20lk7IujnEMO26kFGHa",
        "post_page": "2020-09-22",
        "description_lines": [
            "Sometimes, you uncover a hidden gem. This is one of those times.",
            "First of all and right off of the bat--here's another inductee into our Names Hall of Fames. Could've gotten in on the band name alone, but that record name is just...exquisite.",
            "Now for the music. This is a fun, laid-back, non-threatening indie pop collection that captures elements of Matt and Kim, and Brandon Flowers' solo work. Maybe a touch of the whimsy of Weezer as well? At any rate, it's great. It shines. It glistens. It tastes a little like bubble gum in our mouth. Big league chew.",
            "The opener, \"Voicemail,\" is a surreptitious introduction, but the record really wakes up on \"Kimmy.\" On the third track, \"White Noise,\" the pre-chorus and chorus hand claps give the whole thing an almost throwback, sing-a-long '50s feel, but the trembling guitar interlude sends us forward to <i>Contra</i>-era Vampire Weekend. \"Breathless on DVD\" shimmers as well, and pokes fun at pseudocinephiles and their Jean-Paul Belmondo affectations.",
            "About halfway through the record, \"So Vivid!\" and \"Freakin' U Out\" turn up the fuzz and add a pop-punk edge to the album, as though these guys listened to the Larry Arms on the way to the studio that day or something. The rest of the record is, for the most part, a little quieter after that, until the outro, \"E-Mail,\" takes us back to where \"Voicemail\" kicked things off in the beginning.",
            "Solid cover art, too, by the way."
        ]
    }, {
        "song": "Ambrosia",
        "artist": "Rosie Tucker",
        "spotify_id": "17PBeLUldWC941sX8Ffmkd",
        "post_page": "2020-09-14",
        "description_lines": [
            "This is a neat little track by a pretty recent artist. It's got gloomy, underwater guitar chords which bubble beneath a crystal clear and front-foot-forward female vocal track. Its slow pace and occasional half-step movements are really nicely punctuated by little vocal licks that run back to the one (\"cover dish and chilllll for awhile\"). Those few moments really make the track, and you find yourself listening for them specifically on repeat takes.",
            "This one reminds us of another recent WMT entry, Frances Quinlan's \"Piltdown Man.\" (\"Six AM so loud your mom/HAD to kick us out.\") This week's WMT is short, so go ahead and re-visit that one while you're at it."
        ]
    }, {
        "song": "Pleasure Line",
        "artist": "Video Age",
        "spotify_id": "2XlQCGzPPXX7e8KA3pIBBT",
        "post_page": "2020-09-14",
        "description_lines": [
            "Video Age, indeed. From its opening moments, this track is squarely rooted in the kind of faux '80s nostalgia that started emerging ten years ago and hasn't quit since. It's got dreamy synth melodies, shifting sixteenth note hi-hat shimmies, and rubber band guitar chords that kick in with each chorus. It sounds like Hall and Oates meet Miguel Jackson with just the slightest sprinkle of vaporwave influence.",
            "For what it's worth, their guitarist looks like a cross between Danny Pudi and Adam Driver"
        ]
    }, {
        "song": "Lavender Boombox",
        "artist": "Miniature Tigers",
        "spotify_id": "04TOyd9HCUL8do2srcIyXY",
        "post_page": "2020-09-07",
        "description_lines": [
            "Between the dreamy saxophone and the cool, breathy, effortless vocals, there's a distinct Destroyer vibe to parts of this track. They collide really interestingly with the rest of the instrumentation, which has a sort of organic take on vaporwave, if we may. It's sort of like if Dan Bejar was making music in high school in like 2018. The consistent clap/snare sounds on the back half of each bar give the whole thing a real sense of momentum. The track rides on like that until just past the halfway mark when things go quiet and slow and fingerpicked, before coming back in with some vaguely Caribbean upstroked chords and a spicy sax solo."
        ]
    }, {
        "song": "Ruin (My Ride)",
        "artist": "Hovvdy",
        "spotify_id": "6JduePL4y2un1UAuTNSBHE",
        "post_page": "2020-09-07",
        "description_lines": [
            "This one is a little tricky to place. There are parts of it that remind us of <i>Blink-182</i>-era Blink-182 (think \"I Miss You\")--the distant vocals, the vaguely Tom DeLonge tinge to the vocals, the inorganic drum tracking--but there are also parts of it which feel very '90s rock. (Not that Blink-182 aren't themselves some form of '90s rock, but don't play dumb--you get what we mean.)",
            "Separately, we think that Hovvdy should open for Alvvays before a screening of <i>The Vvitch</i>."
        ]
    }, {
        "song": null,
        "album": "All or Nothing",
        "artist": "Mel*n",
        "spotify_id": "7nTPIgjFsBEUjkK1LGNTDE",
        "post_page": "2020-09-07",
        "description_lines": [
            "Want to feel authentic? Check out Mel*n. Here's an artist with 226 monthly listeners on Spotify. It doesn't get much more artisanal than that.",
            "The name comes from the artist's actual name, Mel Lynn, from Philadelphia. (Derek--do you know her? Did you guys torch cop cars together at Penn Charter?) Anyway, this is a monotone, shoegaze-y electronic record with some vague dance tones to it. The real standout is the eponymous \"All or Nothing.\" The song starts out with a nice enough vibe but not much to write home about--just a drowsy sad kinda chick who is, in the parlance of our times, \"all of us.\" It's not until the second verse passes and the chorus begins that things really turn up. We get a brief hiccup, and then a vaguely \"Strobe\"-like layer settles over the chorus and provides a nice bounce to the track. The other songs on this EP are all worth a listen as well. It doesn't jump out at you, necessarily, but we've found ourselves coming back to it all week.",
            "Separately, 2019's single \"Little More\" isn't half-bad, either."
        ]
    }, {
        "song": "new song d",
        "artist": "The Front Bottoms",
        "spotify_id": "5OrWjKjmlOehKTiSH9caKQ",
        "post_page": "2020-09-07",
        "description_lines": [
            "What more do we have to say? You already know what this is. The Front Bottoms have appeared here multiple times before (most notably, with \"Camouflage\"), and all of the things that landed them here before are landing them here again. The casual/frantic spoken-word verses, the driving drum tracks, and the lyrics. The real value in this track comes in its progressive bombast. It starts off solidly enough, but builds noticeably as it moves along. It doesn't reach the same heights as the aforementioned \"Camouflage,\" and there's an unnecessary pseudo-profound outro, but it's a worthy entry nonetheless."
        ]
    }, {
        "song": null,
        "album": "Set My Heart On Fire Immediately",
        "artist": "Perfume Genius",
        "spotify_id": "5qWrp5RcqjxB8ak7dtK6Iv",
        "post_page": "2020-09-07",
        "description_lines": [
            "Sam had tried to turn us on to Perfume Genius years ago but at the time it didn't stick. Now we're here to eat crow, because this latest release feels like it could be really special. (The record was released back in May but we're just now discovering it for ourselves.) We've only spent a couple of days with it and therefore only given it a few full listens, but we're really excited by how both familiar and new it feels at the same time. This is evident from the opening track, \"Whole Life.\" There's a classic, timeless element to the production--it reminds you of the shaky, quivery kind of pretty songs you hear in old movies--but it also manages to sound like nothing we've heard before.",
            "If we had to make comparisons, Grizzly Bear's <i>Veckatimest</i> (2009) would probably be up there for the same, shared polished ricketiness, but <i>Set My Heart On Fire Immediately</i> is a much more accessible album than <i>Veckatimest</i> (and much better for it). Also, other tracks feel much more modern and forward, like \"Describe,\" which feels almost like Beck meets The Flaming Lips? We're not quite sure about that, but this track is a hipster's slow-motion entrance dream. And things just keep evolving from there. \"Without You\" is a breezy evening ditty--you can almost (we said <i>almost</i>, okay?) hear a bossa nova underneath it--and \"On the Floor\" is actually, of all things, <i>shuffle</i>. Although we probably need a lot more time with this record before we can say more, that's a chunk of time we're really looking forward to putting in.",
            "This new/old conflagration is captured even in the album art. (First of all, how nice it is to see some aesthetically pleasant cover art? We feel like most cover art nowadays vaguely resembles a rainbow highlighter vomitus...) Hadreas, the eponymous genius himself, stares shirtlessly, knowingly, defiantly at the camera in a black/white contrast that somehow seems to simultaneously evoke Humphrey Bogart, our final look at Norman Bates in <i>Psycho</i> (1960), and Joaquin Phoenix's Arthur Fleck (<i>Joker</i>, 2019). The question on everyone's mind--does anyone make <i>albums</i> anymore--finally has an answer: yes."
        ]
    }, {
        "song": "detonate",
        "artist": "Charli XCX",
        "spotify_id": "1M6VHCglQ2PLWeAsyhgEUH",
        "post_page": "2020-08-31",
        "description_lines": [
            "Charli XCX is (are? is this a person? is this a band? is this a m--man? FLOCKA) like TikTok, in that she is super popular and we just generally aren't that familiar. We feel like we should become more familiar, though, because this isn't the first time one of her tracks has caught our attention and made its way onto this thread.",
            "This track is like a fun, light, super bubbly champagne. Part of that quality comes from the sound of the song itself--all of its rapid, moving, bubbling tones actually seem themselves to effervesce. Or maybe, given the adolescent feel of the whole thing, Pop Rocks would be a better comparison? Of course, like so many great tracks, form and content are exactly opposed: as light as the sounds are, the lyrics offer a different story.",
            "We are open to recommendations as to where to begin with this artist. We'd like to hear more."
        ]
    }, {
        "song": "Crimson and Clover",
        "artist": "A.G. Cook",
        "spotify_id": "3MBMKV1sWbwssL3MY5IqnA",
        "post_page": "2020-08-31",
        "description_lines": [
            "We've come across A.G. Cook before, but always in collaboration, either with Hannah Diamond (see below) or 100 gecs. This is a solo effort off of a recent LP, and we really like it. It almost sounds like another collaboration, only this time, with Lou Reed and the Velvet Underground (and maybe a touch of Contra-era Vampire Weekend thrown in for good measure). At least, that's how the verses sound. As you'll see if you take a listen, the bridges move off into a different direction before returning to the sweet, lazy verse that makes this whole thing work. And about halfway through, we get an interesting slowdown in which things seem to flip: the drums become organic, while the vocals are filtered through a very present vocoder.",
            "There's probably a version of this song that works as a bigger banger in some alternative multiverse reality, but we're pretty into this version nonetheless."
        ]
    }, {
        "song": "Hologram",
        "artist": "Tacocat",
        "spotify_id": "29J86Fn14T8BB93kNW43eU",
        "post_page": "2020-08-24",
        "description_lines": [
            "Kicking off a relatively short list this week is \"Hologram\" by Tacocat. We've never really listened to Tacocat before, but apparently they're a well-established Subpop outlet from Seattle (RIP). This track is a catchy pop-punk sing-along that sounds like a cross between Courtney Barnett and The Thermals. It's summery--we recommend listening to it while standing up shotgun-side in a slow-motion convertible."
        ]
    }, {
        "song": "It's Gonna Be Okay, Baby",
        "artist": "MUNA",
        "spotify_id": "5lH5KTgUiP5CSjGctZusTQ",
        "post_page": "2020-08-24",
        "description_lines": [
            "It's hard to ignore a song that opens with lines like \"You're gonna move to New York/and experiment with communism/Go down on a girl/after reading her some Frantz Fanon.\" (It's a little hard to imagine <i>Fanon</i> getting anyone--except for maybe sadomasochists?--in the mood, but the point is well taken nonetheless.) This one, which sounds like pronoun meets Miel, is not nearly so summery as the above entry. It's more of a rainy day, in your feelings, meaningful cafe vibe.",
            "A quick glimpse at the group's Spotify page reveals that it's not one of their bigger songs. Those honors would go to \"Bodies,\" \"Number One Fan,\" and \"I Know a Place.\" A single listen of each reveals that they're all worth your time as well, although we don't have time to discuss them fully here."
        ]
    }, {
        "song": "Valentine",
        "artist": ["Lala Lala", "Grapetooth"],
        "spotify_id": "6DzjAbFIAvE8kXoo64JzBK",
        "post_page": "2020-08-24",
        "description_lines": [
            "This track comes as a collaboration. It's got a little bit of a New Wave, shoegaze feel to it, but with an almost reverent synth background that kind of evokes the backing to the chorus of \"Love My Way\" by the Psychedelic Furs (which is, of course, included on the <i>Call Me By Your Name</i> soundtrack). Two of the members of Grapetooth actually belong to the band Twin Peaks, who we've featured here before as well."
        ]
    }, {
        "song": null,
        "album": "Welcome to Conceptual Beach",
        "artist": "Young Jesus",
        "spotify_id": "76nK69DufkCMk1v8kkmSA5",
        "post_page": "2020-08-17",
        "description_lines": [
            "Young Jesus have appeared on the WMT before, but never before like this. This past Friday saw the release of the band's fourth studio and fifth overall record, Welcome to Conceptual Beach, and you can go ahead and both induct that into the Names Hall of Fames *and* call it truth in advertising. It's an artsy record, for sure, but one which ends up being more accessible than it seems. We've heard it described as a mix of Sigur Ros, Neutral Milk Hotel, and Dave Matthews Band, which is accurate but incomplete. For good measure, we'd also throw in Wild Beasts, Destroyer, and a host of other acts as well.",
            "The record does meander at times, and it will take a few more listens to tell whether or not it sticks as a total overall effort. That being said, there are a couple of serious stand-outs. The closer, \"Magicians,\" for instance, shows off a stuttering, schizophrenic alternation between a pleasant, structured sort of verse and long, unstructured, understated solo efforts in a way that kind of recalls The Velvet Underground's \"Heroin\" (a great, great track on its own, in case you're not familiar). It feels a little bit gratuitous at first until everything comes together in the third act.",
            "By far the best track off of the record, however, is \"(un)knowing.\" This is the stand-out, the \"put it on repeat and sing along\" anthem. The song is essentially split into two mirror-image halves. The first half, with its alternative guitar tuning and clean acoustic sounds, is almost reminiscent at times of mid '90s radio rock, but the second half is where things really come alive. Everything becomes distorted, muddled, electrified, and the lyrics reach a max meaningfulness level. By the time John Rossiter is wailing \"Oh God and Mary, Jesus Christ/won't bless me for my every vice,\" so are we, and even if we don't know exactly what he means, we know exactly what he means. This is Young Jesus at their most NMH, and it's really, really good.",
            "We recommend starting off with \"(un)knowing,\" and then trying out the record as a whole from there."
        ]
    }, {
        "song": "Boomer",
        "artist": "Bartees Strange",
        "spotify_id": "2WahhszjFFN9qLK3G2ihZL",
        "post_page": "2020-08-17",
        "description_lines": [
            "Last week, we brought you an introduction to Bartees Strange, with his excellent \"Mustang.\" This week, Strange has another new track out, called \"Boomer.\" It's equally interesting if a somewhat different vibe--sort of like if Kid Cudi made garage rock with the children of The National and The Killers? We're not sure how much that description is going to hold up, but if you liked the first effort from Strange, you'll like this one, too."
        ]
    }, {
        "song": "Turnstile Effect",
        "artist": "PHONY",
        "spotify_id": "0ua3mFtpYZfVMmmbC53aYr",
        "post_page": "2020-08-10",
        "description_lines": [
            "Fittingly, this track sounds kind of like a mix between The aforementioned Shins (but, like, early Shins, like Flake Music-era Shins), Elliot Smith, and Sufjan Stevens. At least, for the first two-thirds of the track. After that, things go electric and heavier."
        ]
    }, {
        "song": "In a Van",
        "artist": "Saintseneca",
        "spotify_id": "1YhMsfBi41meCDqLHUTzHk",
        "post_page": "2020-08-10",
        "description_lines": [
            "In what we can only assume is a Chris Farley reference, Saintseneca gives us another Shins-worthy effort with \"In a Van.\" There's a touch of more recent Vampire Weekend to it as well. This one ambles along nicely--it's a spring/summer track."
        ]
    }, {
        "song": "Idaho",
        "artist": "Slow Pulp",
        "spotify_id": "4Vz0Wt4ySnCJi7WJycnoNj",
        "post_page": "2020-08-03",
        "description_lines": [
            "We feel like Slow Pulp is one of those artists who are constantly recommended to us, and with whom we have a vague familiarity, but no real knowledge to speak of. At any rate, this track is one of the headies. It's got a whiff of '90s nostalgia to it--slowly strummed acoustic guitars forward in the mix and all that, doubled female vocals crooning slowly over a spacey refrain, et cetera et cetera. Almost like if the daughter or younger sister of the lead singer of Sixpence grew up to be kinda alternative and record tracks in 2020, you know? (Speaking of, who knew that Sixpence was a Christian rock band? You really do learn something new every day.)"
        ]
    }, {
        "song": "Garden",
        "artist": "Meet Me @ The Altar",
        "spotify_id": "00JfiKSB2Ne3dWu6EGcec9",
        "post_page": "2020-08-03",
        "description_lines": [
            "These are just high-quality, chick-driven pop punk tracks. If you listen beneath those really heavy drums and bass guitars, you might even pick up on some vaguely metal lead guitar licks, which give the whole thing a kind of Coheed and Cambria flavor. This is a relatively new group--only a few singles and an EP here or there on Spotify--but for those of us who like polished, melodic, sing-along pop punk, they're fun for sure. (For those of us who are more into annoying, irritating gatekeeping and exclusionary etymologies of \"punk,\" well, this probably isn't the weekly music thread for you.) We're old for the Earth now, but if we weren't, this is the kind of stuff we imagine the lil goth chicks with jelly wristbands we'd pine after at school dances would be into."
        ]
    }, {
        "song": "May the Odds Be in Your Favor",
        "artist": "Meet Me @ The Altar",
        "spotify_id": "3TvGAPUOAEcyXKVnRFHavM",
        "post_page": "2020-08-03",
        "description_lines": [
            "These are just high-quality, chick-driven pop punk tracks. If you listen beneath those really heavy drums and bass guitars, you might even pick up on some vaguely metal lead guitar licks, which give the whole thing a kind of Coheed and Cambria flavor. This is a relatively new group--only a few singles and an EP here or there on Spotify--but for those of us who like polished, melodic, sing-along pop punk, they're fun for sure. (For those of us who are more into annoying, irritating gatekeeping and exclusionary etymologies of \"punk,\" well, this probably isn't the weekly music thread for you.) We're old for the Earth now, but if we weren't, this is the kind of stuff we imagine the lil goth chicks with jelly wristbands we'd pine after at school dances would be into."
        ]
    }, {
        "song": null,
        "artist": "Katie Dey",
        "album" : "Mydata",
        "spotify_id": "5DejDGv9n1FTq0fAULcLpL",
        "post_page": "2020-08-03",
        "description_lines": [
            "Although we'd never heard of Katie Dey, it seems like she's been around for a few years. (In 2019, for instance, she released an album with the dope ass, Names Hall of Fames-quality title <i>Solipsisters</i>.) This release is what we look for in records: something original. Something that we've never heard before. <i>Something that we didn't even realize that we wanted, that we needed, that we'd been missing until the moment we heard it.</i>",
            "There is a fragility to this record. Dey's wavering, CocoRosie voice is vulnerable enough, but when she buries it under reverb and the rest of the mix, it positively shrinks. The instrumentals here are thin somehow, too--on the opening track \"Darkness,\" for instance, all of the instruments seem to rest on the same notes, leaving a sense of space and weakness to a track which otherwise bounces along nicely. In fact, that's a pretty good description of the album in general.",
            "We think this jumped out at us because it seems like it uses a lot of familiar elements to make something new. It's like if Mum, Kid A/Amnesiac-era Radiohead, James Blake, and Cerulean-era Baths cut a concept album about online relationships together during a quarantine."
        ]
    }, {
        "song": null,
        "artist": "Stay Inside",
        "album" : "Viewing",
        "spotify_id": "5IQv4Dr6KeSSFC8akkYpic",
        "post_page": "2020-08-03",
        "description_lines": [
            "Last week, we were all introduced to Bartees Strange. Through Strange, we've now encountered Stay Inside. (He used to be a part of their line-up.) If you're expecting something similar to \"Mustang,\" however, adjust your expectations.",
            "Continuing an ongoing theme now, this is another fall/winter-feeling record. Stay Inside are an emo/post-hardcore hybrid. This works best on tracks like \"Revisionist,\" in which heavy drums and droning guitars get muted and suppressed in the mix, and blanketed beneath a lackluster, muttering lead vocal. Tracks like the follow-up, \"Void,\" seem to lose a little bit of that flavor and wander into more generic emo/screamo territory at times, but not necessarily to particularly distracting effect. And on certain other tracks (\"Ivy\" and \"Divide\"), undistorted, quickly arpeggiated guitar patterns over sterile quality drum recordings even evoke early era Joan of Arc.",
            "This group feels like a more mature version of the hardcore emo bands we liked in eighth grade--Thursday, for instance, or Thrice. (For a little bit of a different vibe, check out their 2018 record The Sea Engulfs Us and the Light Goes Out to hear what the group sounds like with Bartees on vocals.)"
        ]
    }, {
        "song": null,
        "artist": "Gulch",
        "album" : "Impenetrable Cerebral Fortress" ,
        "spotify_id": "4bfyHcprcCpzLWqgOsAu4r",
        "post_page": "2020-07-27",
        "description_lines": [
            "Wow, this lo-fi hardcore debut from Gulch is decidely different from anything we've discussed here in a long time. We seriously wonder whether anyone other than us will go in for this, but here goes...",
            "This is a rip-roaring hardcore debut. The guitars absolutely growl...at times, they sound more like monster truck engines than musical instruments. The unintelligible lyrics are screamed to such an extent that virtually every syllable clips. The drums, for the most part, stay in the 120 bpm-plus polka beat zone of punk hardcore, but at times dip into a more metalhead double-bass pattern. The bass is such a low, dull throb that you can barely hear it--like, dogs probably hear it or something.",
            "A brief look at the track listings--there are only eight of them, and the whole record lasts just over 16 minutes--may give you even more of an idea of what you're in for. Tracks include \"Self-Inflicted Mental Terror,\" \"Fucking Towards Salvation,\" and \"Shallow Reflective Pools of Guilt,\" among other similarly named offerings.",
            "We dare any of you WMTers to like this as much as we do. Or, even, like, at all."
        ]
    }, {
        "song": null,
        "artist": "Backxwash",
        "album" : "God Has Nothing To Do With This Leave Him Out of It",
        "spotify_id": null,
        "post_page": "2020-07-27",
        "description_lines": [
            "We had never heard of Backxwash before this, but apparently she is releasing a new EP soon. News of that led us back to her recent full-length debut, God Has Nothing To Do With This Leave Him Out of It, which is just, so great.",
            "It's like, unsettling lo-fi horror hip hop. It's like the best parts of what we get out of Danny Brown's <i>Atrocity Exhibition</i>, Tyler the Creator's <i>Igor</i>, and Kanye West's \"Monster,\" but as its own thing. This is another relatively short record--10 tracks, only two of which clock in at over 3:00 long. We're not really into this scene--is it even a scene? We've googled and spotified \"horror rap\" before to no real avail--so we don't have much more to say here, but this is a really cool record that we're interested to dig into more as the seasons change, the days get shorter, and the temperature drops. A fall/winter record for sure."
        ]
    }, {
        "song": "Mustang",
        "artist": "Bartees Strange",
        "spotify_id": "6tCuo98GRDGE2IJF6nmP8m",
        "post_page": "2020-07-27",
        "description_lines": [
            "We have no idea who this guy is, but apparently he's been making some pretty rad covers of the National songs (via the Francis Scott Keys). This track sounds like the National meets early the Killers with a sprinkle of Kings of Leon vox with lyrics straight out of an Antlers song. \"You're screaming and cursing, I'm smiling, you're killing me,\" anyone? ",
            "This is music to go on a run to. But, like, a <i>meaningful</i> run. Like you're running away from, like, your past. Or your problems. Or, like, responsibility, or something. And like you might find like a like MPDG along the way or something. You know, that kind of run. Not, like, an exercise run, or whatever. Exercise is no way to cultivate the wan, tubercular physique of a tortured but meaningful aesthete."
        ]
    }, {
        "song": null,
        "artist": "Miel",
        "album" : "Tourist Season",
        "spotify_id": "0KZIZ7GtnsJ91Wu7xTXgzw",
        "post_page": "2020-07-27",
        "description_lines": [
            "We've written here about a couple of tracks that Miel, a new artist, has released over the course of the last few weeks. (One of those, \"Must Be Fine,\" is really something.) Well, Miel's debut is finally here, and it's a pretty solid affair. Nothing for us rises to the heights of that debut track, and this is a largely mellow effort--really more of a winter release, if you ask us--but it's a pleasantly threadbare, emotional solo effort with light but effective synth/electronica notes to it. New highlights include the eponymous \"Tourist Season\" and closer \"Early Hours.\"",
            "This record probably isn't going to blow you away on first listen, but we think it's a grower (especially, as we said above, as the seasons turn). This is a really promising debut and we are eager to see what else comes out of this woman. This is music to, like, have your first kiss with a like pseudo-goth girl (or <i>boooy</i>) to or something. Possibly it's raining. At a wedding? And you're Timothee Chalamet and she's, like, Kristen Stewart's artsier sister? Just listen to it."
        ]
    }, {
        "song": null,
        "artist": "Taylor Swift",
        "album" : "folklore",
        "spotify_id": "2fenSS68JI1h4Fo296JfGr",
        "post_page": "2020-07-27",
        "description_lines": [
            "Let's be clear about something: we like Taylor Swift. Like, a lot. She's already had a long career of success for someone so young, and she's reinvented herself several times already. In fact, this record itself marks something of a reinvention",
            "Throughout her career, though, Swift has functioned as the ultimate pop artist. She observes what's happening on the fringes of music, imbibes it, and reproduces it in exactly the fashion that the average passive listener can connect to. She's like a Rosetta Stone or Babel Fish for musical movements. She's a <i>translator</i>.",
            "Probably the best example of this is <i>1989</i>. We listened to that 9-10/10 over and over and over for months. Maybe years. It's in many ways a perfect record, and for those of us who, like Swift, were born in 1989, there's something about its sound that seems to sum up our lives in a really accessible and yet unique way. Like if on your 30th birthday, you got to see a slideshow of all of the pictures people had ever taken with you in the background. A bunch of the experiences that made up the timeline of your life, seen from the perspective of someone else who was there too, but standing just a few feet off. At any rate, enough gushing. Because in addition to these things, <i>1989</i> was also a translation. It was a translation of artists like Robyn, artists like Tegan and Sara, like Carly Rae Jepsen, who for years had been making chick-driven, 80's era pseudo-nostalgic synth pop, but who had committed so hard to that sound that they could not have possible broken through to arena-level mainstream fame. It is Swift's unique talent to take that sound, to soften its edges, and to turn it into, again, one of the greatest pop records of our lives.",
            "And <i>folklore</i> feels like another translation. This time, it's not Robyn, but Lana del Rey who provides the source material. Opening tracks \"the 1\" and \"cardigan\" are nice, solid stand-alone efforts, but both of them also kinda make you just wanna listen to Lana. It's the blase tone, the breathy delivery, the swung bounciness, the vocal runs and held notes fading into a reverby background, the references to youth, to women, to men, to America. This vibe breaks for a little bit around tracks 4 and 5, but shows back up in time for \"mirrorball\" and the creatively named \"seven.\" The eighth track, \"august\" (do you get it?) sems to break out of that ambien daze for a bit. Indeed, the back half of the album seems to earn the title of \"folklore\" a little more, and feels maybe like a bit of a return to some of Swift's roots. (track 14, \"betty,\" pulls in, for instance, some quiet harmonica and some lyrics about gyms and dances and him and homerooms and a subtle take on a \"Love Story\" wave key change.)",
            "The truth is, like all of Swift's efforts, this is a long record, and we'll need to spend a little more time with it. Vexingly, this is yet another late July release that feels to us like a winter record, but we wonder whether all of that has to do more with lockdowns than anything else. Cold weather and coronavirus both force musicians indoors for extended periods of time, and we as fans wind up with these beautiful elegiac efforts as a result. If it were up to us, it'd always be autumn or winter."
        ]
    }, {
        "song": "Carrie",
        "artist": "Ruby Haunt",
        "spotify_id": "3Ik9HLSy6kuI3ANwwt5BIo",
        "post_page": "2020-07-20",
        "description_lines": [
            "That this track appears on this particular WMT is a minor coincidence. We've discussed Ruby Haunt here before, most notably for \"Curtain Call\" and most recently for \"Avalon.\" \"Carrie\" comes off of the same release as \"Avalon\" and, though still with the characteristic RH lo-fi sound, is clearer and more present than a lot of their recent work. This one is driven by a finger-picked guitar and vocals are placed front and center. Like pretty much any RH track, the song drags on in a way that gives a sense of both progress and stagnation.",
            "We mentioned last week that RH really capture the spirit of melancholy in all of their songs. Check out the artwork associated with this single on Spotify. That's melancholy if we've ever seen it."
        ]
    }, {
        "song": "Born Confused",
        "artist": "Porridge Radio",
        "spotify_id": "67WYyxMKmuFd7E4pELpwcm",
        "post_page": "2020-07-20",
        "description_lines": [
            "We'd never heard of Porridge Radio before but this track grabbed us quickly. Instrumentally, it's almost got a very early (as in, Flake Music-era) Shins vibe, but the vocals and lyrics give us vague flashes of we wanna say Courtney Barnett. About half way through the song, everything breaks down into a vamp on the phrase \"thank you for making me happy\" which builds and builds and builds and crests and crests and crests and then sort of falls apart.",
            "There's a whole record to explore here (2020's Every Bad) but we haven't had time to do it yet. It's part of our plan for the upcoming week."
        ]
    }, {
        "song": null,
        "artist": "The Lawrence Arms",
        "album" : "Skeleton Cost",
        "spotify_id": "1KoFC7rBDqWZrDbLFAPXAu",
        "post_page": "2020-07-20",
        "description_lines": [
            "We've written here before about the Larry Arms (most notably, their near flawless-from-front-to-back record Oh! Calcutta!), and they're out this week with a new record. Importantly, that record's got an older school sound to it--to us, it's actually reminiscent of that classic aforementioned effort. Early winners include \"PTA\" and \"Belly of the Whale.\"",
            "If you need to ease into the Larry Appendages, we'd recommend the following favorites: \"Are You There, Margaret? It's Me, God,\" \"Like a Record Player,\" \"Warped Summer Extravaganza (Major Excellent),\" and \"The Slowest Drink at the Saddest Bar on the Snowiest Day in the Greatest City.\""
        ]
    }, {
        "song": "What's the Matter",
        "artist": "Twin Peaks",
        "spotify_id": "2m2ckP35IsKmIxWmzYq4LA",
        "post_page": "2020-07-13",
        "description_lines": [
            "We've heard tell of this group but had never encountered their stuff before. \"What's the Matter\" is a really nice, pleasant, infectious track. It's laid back but dancey. The multiple, overlaid vocal tracks throughout give it a real sing-along feel, and the riding on the cymbal bells really contribute to accenting certain beats over others. And, on that front, the drum fills here really follow the melody, which is an interesting touch you don't see often. (It's common for the vocal melody to mimic the lead guitar/keys melody, which can be either infectious or totally annoying and dead-sounding, but it's tougher to pull off with drum fills for obvious reasons. It's used to great success all over this track, however.)"
        ]
    }, {
        "song": "I'll Be Holding",
        "artist": "Miel",
        "spotify_id": "21M6s9DMnK6HtXZ0Xb1dB5",
        "post_page": "2020-07-13",
        "description_lines": [
            "Last week, we wrote about Miel's then-only single, \"Must Be Fine.\" That track has stuck with us on repeat all week. Since then, however, Miel has released a second track, \"I'll Be Holding.\" As is often the case, this one isn't quite as powerful as the debut, but it's still a really solid track. It comes complete with an 80s retro synth gloom to it and still feels very pronoun-adjacent (if pronoun, like, took a bunch of Xanax or something). We're going to be on the lookout for more tracks from this artist in the days to come."
        ]
    }, {
        "song": "montgomery forever",
        "artist": "The Front Bottoms",
        "spotify_id": "4BkfM7H1lPM1gzi05FXmIP",
        "post_page": "2020-07-13",
        "description_lines": [
            "The Front Bottoms have appeared on the WMT multiple times for their unique blend of frantic, skittish tracks under non-chalant, nearly spoken word lyrics. \"montgomery forever\" delivers more of that sweet, sweet same. This is a really energetic track with messy verses and messier choruses, and the singer still has that weird, hard-to-pinpoint kind of quasi-accent to his singing.",
            "These guys are hard to place, but this track almost borders at times on edgy pop punk. We guess that the music video for this one would consist of sped-up footage from some '90s-looking home videos."
        ]
    }, {
        "song": "Avalon",
        "artist": "Ruby Haunt",
        "spotify_id": "5rwKSB1WtNDWOBmwxZMWrg",
        "post_page": "2020-07-13",
        "description_lines": [
            "We've written about Ruby Haunt here before--most notably, their incredible track \"Curtain Call\" off of 2019's <i>The Middle of Nowhere</i>--but they're back with a new release. \"Avalon\" doesn't have the same peculiar combination of constancy and momentum as that track does, but it's still worth a listen or two. This is a stripped down Ruby Haunt. The track proceeds over a couple of chords strummed over and over again on an acoustic guitar and a simple melody that constantly repeats in response. \"spinnin' out, runnin' away/felt way different yesterday,\" the lead sings lazily, the unadorned delivery starkly set against what those words actually mean. The track yawns on like that for five and a half minutes, before the simplest, softest drum part comes in and seems somehow to still just push it over the edge.",
            "These guys really capture the spirit of melancholy in all of their songs."
        ]
    }, {
        "song": "The Day the Politicans Died",
        "artist": "Magnetic Fields",
        "spotify_id": "7uvmVIVSoFXfxbc3nUYnvC",
        "post_page": "2020-07-13",
        "description_lines": [
            "This song is particularly remarkable or enjoyable from a musical perspective, but the lyrics are worth printing here in full just for how laugh-out-loud funny they are. Politics in art is usually anathema to us, but we'll make an exception for something as naked and bald-faced as this.",
            "<p style = \"padding-left: 33em;font-size: 80%\"><i>Billions laughed and no one cried<br>The day the politicians died<br>Celebrations spread worldwide<br>The day the politicians died<br>Even their own mothers<br>Their own husbands and wives<br>Said, \"Now all men are brothers\"<br>Let's get on with our lives<br>Billions laughed and no one cried<br>The day the politicians died<br>Celebrations spread worldwide<br>The day the politicians died<br>We've risen from the mud<br>We're different from the beasts<br>We've got the taste for blood<br>So let's eat all the priests<br>Billions laughed and no one cried<br>The day the politicians died<br>Celebrations spread worldwide<br>The day the politicians died<br>It's all one big party now<br>'Cause all the politicians died</i></p>"
        ]
    }, {
        "song": "Get Me Back in the Game",
        "artist": "LL Burns",
        "spotify_id": "4K9n5qyCUGYBtfuJAgh23X",
        "post_page": "2020-07-06",
        "description_lines": [
            "This is an interesting one. A very organic sounding track, it feels like Thievery Corporation (think \"Lebanese Blonde\") did a take on some sort of whiskey-soaked country-infused hip hop. It incorporates elements of all of these things in a way that makes it feel decidedly like it's from another decade. Maybe as though it would have been one of the most intriguing songs of the '90s.",
            "Equally interestingly, the artist--LL Burns--has only two tracks out on Spotify. He (?) has a pretty limited bandcamp page, and it doesn't seem like a ton of other information (aside from a London location) is available. It'll be interesting to see if he follows the track up with anything else worthwhile."
        ]
    }, {
        "song": "Vegetable",
        "artist": "Happyness",
        "spotify_id": "3Fhoc2UFQs1n9GNVOnApZ3",
        "post_page": "2020-07-06",
        "description_lines": [
            "This one is a warped, melodic, lo-fi banger. It sounds almost like if Kurt Cobain fronted Weezer. The pre-chorus really reminds us of...something but we can't quite put our finger on it. At any rate, there are a lot of shimmering hi hats here, fuzzy chords, squealing held notes, and age-old contrasts between palm-muted verses and out-loud choruses.",
            "\"Vegetable\" is a track off of 2020's Floatr. We haven't had time to give it a listen, but we'll try to do so this week and will report back if anything noteworthy comes of it."
        ]
    }, {
        "song": "Must Be Fine",
        "artist": "Miel",
        "spotify_id": "19jfMrCGfO2uPDMTyhsOPD",
        "post_page": "2020-07-06",
        "description_lines": [
            "Want to feel cooler than your friends? Read the WMT every week. Here's another artist with four-digit monthly listeners on Spotify. In fact, \"Must Be Fine\" is Miel's only track posted so far. (Fun fact: \"miel\" is the French word for honey.)",
            "The remarkable thing about all of this is that \"Must Be Fine\" shows incredible restraint as a track. It may or may not be your thing as a piece of music--its thick aural melancholia most certainly makes it ours--but the form of the song mimics the content exactly. The lyrics hint at exchanges which never take place, sentences which are never said, and loves which, requited or not, are never realized. There are no climaxes. No consummations. And all of this is brilliantly reflected by the track itself. The drums and strings plug along in non-stop, repetitive eighth-notes, and the vocals never rise above the place where they begin. We plug along like the narrator herself: \"I keep going...I must be fine.\"This is such an obvious move but so few artists make it successfully.",
            "It's like pronoun and \"Lilies\"-wave Bat for Lashes got together, watched Lars von Trier's Melancholia, and then cut a track they know we'd appreciate.",
            "If that's not enough for you, get a load of the \"About\" section on Spotify:",
            "<blockquote class=\"blockquote\">After a half-decade in the grisly world of internet comedy, Miel emerges with the humiliatingly honest synth pop break-up album, Tourist Season. Set to release July 22nd, the album blends dreamy planetarium synths with breathy vocals that have no business being as sultry as they are, coming from a former Vine star. In the summer of 2019, she fled to her parent's barn and enlisted the help of producer/multi-instrumentalist/brother Henri Bardot to weep-sing her way through the velvety collection that would become Tourist Season.</blockquote>",
            "We'll definitely be interested to see if this is a one-off, or if that July 22nd release really delivers."
        ]
    }, {
        "song": "Oh No",
        "artist": "Softee",
        "spotify_id": "3FLazwxIsNIWPmND1t1RIx",
        "post_page": "2020-07-06",
        "description_lines": [
            "Softee, for us, are like the kids who were seniors in your fraternity/sorority/selective living group/school newspaper/theater troupe/intramural sports team when you were a freshman. You traveled in the same circles, you've seen them around, you recognize their names. We'd never really given them a listen before though.",
            "This track opens with a stripped down, bass-y bouncey verse that evokes Deniece's Williams' \"Let's Hear it for the Boy.\" From there, it progresses to a pretty great dance-pop song in general. (It's got a little of the best elements of Haim to it as well, in places.) Like the Miel track above (but in a very different direction), the lyrics to this one just fit perfectly: <i>What if I did it? What if I kissed you right here? And what if you felt it? What if you felt the way I do about you?</i>",
            "Who <i>hasn't</i> felt this way? Set against the schizophrenic, mercurial ups and downs of the track, these lines perfectly capture the uneasy excitement (or is it the exciting uneasiness?) surrounding a new crush, a hot date, a first kiss."
        ]
    }, {
        "song": "Headgear",
        "artist": "Elizabeth Moen",
        "spotify_id": "7Gb1uSZjs0fsAoqPrfLArL",
        "post_page": "2020-06-29",
        "description_lines": [
            "We're not familiar with Moen, but a quick look at her Spotify artist page shows she's got a couple of releases under her belt. This track grabbed us right away--it is splattered with loud, unabashed personality, vocal yips, and a pretty driving drum part. It's also got some pretty warm and chirpy guitars front and center in the mix. It's the kind of track that goes along with an exuberant vacation morning bike ride under cloudless skies on a breezy beach. The vocal stylings remind us a little of a track we saw on the WMT a couple of months ago, \"How I Get Myself Killed\" by Indigo de Souza."
        ]
    }, {
        "song": "Now That's What I Jack Off About",
        "artist": "Hot Dad",
        "spotify_id": "5LkaN9i1mI7sPdqiYN9eJi",
        "post_page": "2020-06-29",
        "description_lines": [
            "What even is this? First of all, a candidate for the Names Hall of Fames. The track kinda slaps, too--it's got a synthy, moody '80s vibe, with almost Peter Gabriel-wave vocals. But check out the cover art for this single--it's a take on Now! That's What I Call Music! We honestly have no idea how seriously to take this. It comes from a guy who makes a lot of comedy music? As evidenced by tracks like \"Big Money Salvia,\" which seems largely to center on \"cock-slapping\" Martin Shkreli, or another similarly named track, \"Big Money Salvia City.\" There's also \"Elon Musk (Cars in Space.\" Let's be clear--these are obviously joke tracks, but we would be lying if we didn't confess that there is something...aesthetically kinda pleasant about them."
        ]
    }, {
        "song": "The Times They Are a-Changin'",
        "artist": "Goth Babe",
        "spotify_id": "4fYeRpiNyejUfkgskbhqmz",
        "post_page": "2020-06-29",
        "description_lines": [
            "This one came out of nowhere. We've reviewed Goth Babe here before, and they're obvious members of the Names Hall of Fames, but they've just recently released this cover of Dylan's TTTAaC and it is--something. We're not quite sure how we feel about it, but it at least does what any truly successful cover needs to do--it remakes BD's song in GB's image. Listen to this one and see for yourself. We think we like this but offer no guidance here, at least not yet."
        ]
    }, {
        "song": "Walk In The Woods - (Acoustic)",
        "artist": "Snarls",
        "spotify_id": "0VwdoYFbubpHqoAa8vDVTf",
        "post_page": "2020-06-29",
        "description_lines": [
            "We recently reviewed Snarls' full-length release <i>Burst</i>, and one of the tracks we highlighted was \"Walk in the Woods.\" Snarls are back already with an acoustic release of this track. It's nice, but it loses the particular quality of the original. The plugged-in version offsets the drowsy, bland vox against bouncy and head-bobbing instrumentation but that's lost in the acoustic track. A nice addition, but not a must-listen by any stretch of the imagination."
        ]
    }, {
        "song": null,
        "artist": "RMR",
        "album" : "Drug Dealing is a Lost Art",
        "spotify_id": "2wFBXSq8EyQNEtqXg8Xej2",
        "post_page": "2020-06-22",
        "description_lines": [
            "RMR, by now, needs no introduction here. We've covered several of the tracks off of this EP already--most notably, \"Rascal,\" which remains the most arresting--but the full EP dropped last week. P4k gave it a generous, considered 3.3 and called RMR himself <a href=\"https://pitchfork.com/reviews/albums/rmr-drug-dealing-is-a-lost-art-ep/\">\"a wiped smartphone--sleek, modern, empty.\"</a> (How wiping a smartphone is akin to emptying it is beyond us. It sounds like P4k is about as knowledgeable about the wiping process as HRC.) This leads us to our new method for interpreting P4k scores:",
            "1) Avoid them.<br>2) If they can't be avoided, then record the given score (in this case 3.3)<br>3) Subtract the given score (3.3) from 10 to reverse the 10-point scale (in this case, the new score is a 6.7)<br>4) Round to the nearest whole number, because no one needs decimal places on a 10-point music review scale (in this case, 7)<br>5) Take the new score itself with a grain of salt, because the first one was bogus to begin with",
            "The new P4k scoring system isn't perfect (it would leave several Kanye and Radioguts records with near 0's), but we're willing to bet that it works more often than not. It certainly does here. None of the new tracks on RMR's EP match \"Rascal\" in our opinion, but the entire effort feels new and aesthetically interesting. (P4k mistakes a lack of apparent depth in the lyrics--none of Justin Vernon's <i>\"melic in the naked/drew a lake/and drew the lofts for page\"</i> pseudo-profound gobbledygook here--for lack of depth in the <i>concept</i>, but RMR's veneer is in many ways the entire point. One wonders whether they even watched the video for Rascal. But we suppose it's hard to see a video itself when all you ever see in a piece of music is a mirror reflecting back at your own uninteresting face.)",
            "So, to summarize:",
            "Review of RMR: 7 <br>Review of P4k review of RMR: 3.3<br>Review of P4k: [vomit emoji]<br>Review of smartphone/server wiping: ",
            "<img src=\"img/mrclean.png\">"
        ]
    }, {
        "song": null,
        "artist": "Phoebe Bridgers",
        "album" : "Punisher",
        "spotify_id": "2xECuqnvvmVktV7UO8Dd3s",
        "post_page": "2020-06-22",
        "description_lines": [
            "We're <i>still</i> taking down large portions of Bridgers' <i>Stranger in the Alps</i> (2017),  so the surprising release of this year's Punisher is almost too much for us to handle. We haven't had time to fully get into it, and have only gotten through a listen or two, so take everything here with a grain of salt.",
            "(First, however, a brief aside...we were out Friday night and into the early morning hours of Saturday--<i>day? night? what's day? what's night? to whom? and if so how?</i>--with an old friend who told us a story. Here is a friend who has long harbored a hatred for Eric Clapton, and for his birthday last year, a writer friend of <i>his</i> surprised him by publishing <a href=\"https://thebaffler.com/latest/the-fairest-soul-brother-in-england-marzoni\">an article</a> on Clapton's racist history. Well, it turned out that Phoebe Bridgers read that article, and has stated in an interview that it served as the inspiration for the track \"Moon Song,\" which appears on <i>Punisher</i>. So we basically wrote this song.)",
            "Anyway, as for the record itself--like we said, we're still on early listens. Impressions so far? This is still Bridgers, but a little bigger, a little more expansive. Gone, or at least a little further buried, is the pure ambient warmth of her trundling rhythm guitars. It's like she found out about computers, and effects. They're not overdone by any stretch--in fact, they're used quite tastefully--but the greater emphasis on production definitely gives the impression of an older, more mature musical artist. String work shows up as early as the opener, and we even get some horns a few tracks in.",
            "In sum, we like it so far, but a big part of Bridgers' appeal is her nuance, subtlety, and understatement, and that kind of thing normally takes at least several listens to fully sink in."
        ]
    }, {
        "song": "get off",
        "artist": "groan room",
        "spotify_id": "4bRa6E85kNoVREhlu0OCtx",
        "post_page": "2020-06-22",
        "description_lines": [
            "Here's a first--a review by request! It turns out someone on this listserv knows someone who knows someone. We won't say who. They're like racists and communists. They walk among us, they could be anyone. Look to your left. Look to your right. ALL of you are bodysnatchers! Are you now or have you ever been, et cetera, et cetera. We'll never tell.",
            "At any rate, groan room is a new group with 67 total listens on Spotify as of this moment. \"get off\" feels modern, but like a well wet sommelier with a Burgundy white, we're picking up a lot of subtle notes here. Nirvana? BoJo? We've also gotten tips on Pavement, Yuck, and Built to Spill. We'll see how this one ages--and what the new vintages show us when they arrive--but for now, we're sipping pleasantly on it. Get in on the ground floor so you can go out to some bar tonight and tell some tasty treat about your new favorite band that neither they nor anyone they've ever heard of has ever heard of."
        ]
    }, {
        "song": "Piltdown Man",
        "artist": "Frances Quinlan",
        "spotify_id": "5fXCsxVsE4q4Yz92QtrUKv",
        "post_page": "2020-06-08",
        "description_lines": [
            "Here's a new artist whose sole contribution on Spotify is this year's debut LP Likewise. Her unusual voice, playfully free-associative lyrics, and arpeggiated melodies evoke Joanna Newsom, only rougher, with a little more of a folk-punk sensibility. The record opener, \"Piltdown Man,\" is our personal favorite, but there are lots of worthy tracks in play--check out \"Went to LA\" for the kind of eyebrow-raising rough and raw emotion you might find in a surprisingly good local line-up. Like Newsom, this isn't exactly easy listening. You've got to pay attention. But, for the most part, it's worth it."
        ]
    }, {
        "song": "Fair Shot",
        "artist": "Slaughter Beach, Dog",
        "spotify_id": "6LdrUBLETkQTYDFsEuK1rw",
        "post_page": "2020-06-08",
        "description_lines": [
            "Slaughter Beach, Dog have appeared in this thread before, and they're back here with this nice, soft track which just kind of peacefully walks along toward its harmonica conclusion. We haven't got much to say about this one--in the vein of Tobias Jesso, it's just a really well-made, pleasant song."
        ]
    }, {
        "song": "The Poet Acts",
        "artist": ["Philip Glass", "Bruce Brubaker", "Max Cooper"],
        "spotify_id": "0XiMoe7Dh3CcF5sYNWIwYR",
        "post_page": "2020-06-08",
        "description_lines": [
            "This new track is a 4-minute piano ballad over some synthy bass tones and scritchy-scratches and weepy-woops that is sure to make you feel all haunted and meaningful. It could almost be the instrumental portion of a Radiohead track (imagine Thom Yorke whining about the electronic horrors of the post-climate change Earthscape over this one) or the soundtrack to some movie in which Jake Gyllenhaal plays a lone spaceman at an abandoned intergalactic outpost who slowly loses his mind as he confronts the unending horrors of the infinite cosmos. It almost evokes an updated Kronos Quartet take on some of the pieces from <i>The Fountain</i>, if that helps at all."
        ]
    }, {
        "song": "Undead God of War",
        "artist": "Tre Burt",
        "spotify_id": "17pQuFJDgCkqSCVgxRailx",
        "post_page": "2020-06-08",
        "description_lines": [
            "He looks like a cross between Chaz Bundick and Donald Glover, and sounds like a cross between Bob Dylan and The Tallest Man on Earth. What? Yes. I am right. This is a great neo-folk track with some classic harmonica accompaniment on top. If you listen closely, the lyrics are vaguely political, but in a Dylanesque or Chapmanesque way that doesn't undermine the artistry. Though this be ideology, in other words, yet there are aesthetics in it."
        ]
    }, {
        "song": null,
        "artist": "Snarls",
        "album" : "Burst",
        "spotify_id": "5JoS6MbEFOKErbW1g96uqn",
        "post_page": "2020-06-08",
        "description_lines": [
            "We almost hesitate to list this one this week, as we just discovered it yesterday and have only had the time to listen to it once or twice through. However, the tracks seem to be sticky enough that we wanted to bring it to the people as soon as possible. After all, the WMT is a democracy. <i>Everything</i> is a democracy. You are, <i>literally</i>, a democracy.",
            "So, in lieu of saying anything more, we're simply going to put this one out there and ask, like a lonely mid-Western voting booth warding off malevolent Russian interference, what do y'all think?"
        ]
    }, {
        "song": "I'M NOT OVER YOU",
        "artist": "RMR",
        "spotify_id": "7azKwxRJQYTjshRkbLQVQS",
        "post_page": "2020-06-01",
        "description_lines": [
            "It feels like we check RMR's Spotify page every day, waiting week after week to bring you news of his ever-impending EP. Unfortunately, we still haven't got that, but last week brought us a new single: \"I'M NOT OVER YOU.\" \"I'M NOT OVER YOU\" continues the same trap-country trend as RMR's debut single, \"RASCAL,\" although without quite the same level of spectacle. It leans harder into the country sound, true--the song opens with and then flows over a finger-picked banjo melody--but it's the weakest of RMR's offerings thus far. Admittedly, part of this might be due to the fact that it's the only of RMR's three singles to be released without a video, and that the his imagery is intimately tied up with what makes his music so refreshing. The fact that \"I'M NOT OVER YOU\" is essentially a break-up song, however, robs it of the startling contrast that marked his first two efforts. We'll reserve judgment until we see the video. Until then, \"I'M NOT OVER YOU\" establishes that RMR's trap country sound was not some one-off parlor trick, but pales in comparison to the debut that announced that genre."
        ]
    }, {
        "song": "Automatically in Love",
        "artist": "Carly Rae Jepsen",
        "spotify_id": "69XN0XjxcMtUCrvOEd0KYd",
        "post_page": "2020-06-01",
        "description_lines": [
            "Last week, we brought you the album opener to Carly Rae's new <i>Dedicated Side B</i>. At the time, we mentioned that we never spent much time with 2019's <i>Dedicated</i>, and we're trying to rectify that. One of the tracks that's helping is \"Automatically in Love.\" It opens with some really fat, synthy sounds--they're so plush you can sit on them and they start to feel pretty fuzzy by the time you reach the bridge. The mix is also very drum-heavy, which, when combined with the slow tempo and sixteenth-note hi hat part, really accentuates every single beat across every single bar. In other words, it's hard not to bob your head.",
            "At some point, this shtick is going to get old. Or it's not. After all, it hasn't yet..."
        ]
    }, {
        "song": "Dreaming of",
        "artist": "Phoebe Green",
        "spotify_id": "48WIvbuYEhz3xeXif08Dh0",
        "post_page": "2020-06-01",
        "description_lines": [
            "We'd never heard of Phoebe Green before, and a cursory search reveals that she hasn't released much music to date: a short record in 2016, and then a couple of singles since. This track opens with a funky shuffling drum beat over ominous, held bass notes which together are evocative of <i>In Rainbows/The King of Limbs</i> era Radioface. The similarities don't end there--Green also has a penchant for repeating seemingly innocuous phrases that take on larger meaning in the context of the song. It also has some Interpol-wave synth to it. This is a cool one--we recommend it for sure."
        ]
    }, {
        "song": "Stay",
        "artist": "Future Generations",
        "spotify_id": "6BUC7ZGVswWxJNnK2XDQ12",
        "post_page": "2020-06-01",
        "description_lines": [
            "This track has a happy-go-lucky vibe that feels like \"California Sun\"-wave Ramones meets The Strokes. That's about all we got."
        ]
    }, {
        "song": "PTA",
        "artist": "The Lawrence Arms",
        "spotify_id": "3reyYApWAn5lkEckK5mgoL",
        "post_page": "2020-06-01",
        "description_lines": [
            "We've written here before about the Larry Arms, including an Up the Punx segment on 2006's <i>Oh! Calcutta!</i>, which is pretty close to a perfect punk record if ever we've heard one. We'll also refresh your memories as to \"The Slowest Drink at the Saddest Bar on the Snowiest Day in the Greatest City,\" which is just...sublime.",
            "Well, last weeks, the Lawry Second Amendments released a new track, \"PTA.\" It's pretty much their usual brand of dual vocalist-driven power-chord punk. Not as catchy as a lot of the tracks mentioned above, but it's still a really solid effort (and hopefully indicative of further upcoming releases)."
        ]
    }, {
        "song": "My House",
        "artist": "Kitten",
        "spotify_id": "3dcBeyPtKfTeV4sn789ptS",
        "post_page": "2020-05-26",
        "description_lines": [
            "We previously brought you both the original and acoustic versions of another Kitten track, \"Memphis.\" That one was notable for its supreme crafting as a pop song--flawlessly conceived and executed, an example in which the whole was greater than the sum of its parts. Today, though, we bring you \"My House,\" which is sort of the opposite. The song revolves around a simple melody and just one or two lines--all of which get continually reinterpreted through various instruments and musical styles. Electronic instruments, organic acoustic instruments, vocal effects, and more, until the track starts breaking down into bleepy bloops. The key here is the infectious loop it all happens over--it's so catchy that it ties the entire schizophrenic song together."
        ]
    }, {
        "song": "This Love Isn't Crazy",
        "artist": "Carly Rae Jepsen",
        "spotify_id": "03o4HPzUwftpgAPNQSuaBS",
        "post_page": "2020-05-26",
        "description_lines": [
            "C-Rayz Jepsen has been a favorite for us since 2015's <i>EMOTION</i>--followed up impressively with 2016's short but near perfect <i>EMOTION Side B</i>. As we've noted here before, we never really invested the time we needed into 2019's <i>Dedicated</i>, but it looks like we'll need to. This past week, Carly Ray J dropped <i>Dedicated Side B</i>. As you might expect, we haven't spent enough time with it yet to really make comment here, but the opening track, \"This Love Ain't Crazy\" is iCarly at her best. Another synth pop masterpiece, this track has an effervescent forward energy that distinguishes it from the largely more sexual, cynical tracks from those previous records. It feels optimistic. And it is very, very catchy."
        ]
    }, {
        "song": "I See You",
        "artist": "Phoebe Bridgers",
        "spotify_id": "6Xa2Y4EP6wossxPv1kUy2c",
        "post_page": "2020-05-26",
        "description_lines": [
            "After our recent introduction to Bridgers in the form of her 2017 <i>Stranger in the Alps</i>--a very organic album at least partially influenced by her break-up with Ryan Adams--we are still a little surprised at the degree of production and effects included on her newer tracks. Still, this one really grabbed us, and it feels very much like an appropriate evolution after that first record."
        ]
    }, {
        "song": "stupid horse (Remix) [feat. GFOTY & Count Baldor]",
        "artist": "100 gecs, GFOTY, Count Baldor",
        "spotify_id": "0aV4YQ18bZ9qt0PDUZIDSz",
        "post_page": "2020-05-26",
        "description_lines": [
            "This track combines three of the worst things in music: (1) errant capitalization (or lack thereof); (2) \"feat.\"; and (3) remixes. The song identifier on Spotify, reproduced here, looks like an incoherent line of code, and we have never met a single remix we ever liked. Until now, that is. If any artist's music lends itself to remixes, it's 100 gecs, and this one is a fun new take on one of the catchiest tracks off of 2019's <i>1000 gecs</i>."
        ]
    }, {
        "song": "No Rain",
        "artist": "Drab Majesty",
        "spotify_id": "5DFd4zB38aguAiHVwQ2op6",
        "post_page": "2020-05-18",
        "description_lines": [
            "The sole entry on our list this week (and not for lack of looking), this is an '80s, Depeche Mode-like take on Blind Melon's \"No Rain.\" Although we've never been particular fans of the original, it is an undeniable classic, and yet this take on it is somehow fresh and retro, new and nostalgic, at the same time. <i>We</i> happen to think that it actually works better than the original, but we're not sure anyone will agree with us on that..."
        ]
    }, {
        "song": "Tegel",
        "artist": "Lambert",
        "spotify_id": "5Vh9sUjTiivWtvKmif40wy",
        "post_page": "2020-05-11",
        "description_lines": [
            "We plugged Lamby on here a few weeks ago for his mysterious mask and gloomy piano tunes. The mask is still there, but this new release is a little more upbeat. There's not much to say about these, but they're really nice for cooking, chilling, or having meaningful candlelight conversations with once and former lovers."
        ]
    }, {
        "song": "The Night in Question",
        "artist": "TV Girl",
        "spotify_id": "2UXhV8EMkfNX1MZfBKPjNI",
        "post_page": "2020-05-11",
        "description_lines": [
            "These bad motherfuckas have been on our radar since a friend first fished them out of a bag of wallets for us back with 2018's fabulously titled <i>Death of a Party Girl</i>. Well, on the first of this month, TV Girl released outtakes from the 2014 record <i>French Exit</i>. This one, \"The Night in Question,\" has got all of the classic TV Girl vibes: the <i>ennuyeux</i> vocals, the shimmery constantly moving undercurrents, the dozens of tracks that show up for the chorus and drop out for the verses."
        ]
    }, {
        "song": "My Bike\"and \"Dennis Hopper in Easy Rider",
        "artist": "2nd Grade",
        "spotify_id": "60oaw9CeevDAdmFM8d4HGi",
        "post_page": "2020-05-11",
        "description_lines": [
            "We've never heard of these guys before, but these tracks jumped out at us this past week. \"My Bike\" is a sad, slowly strummed twanger reminiscent of The Weakerthans, whereas \"Dennis Hopper in Easy Rider\" is a moving, bouncing, teenie bopper anthem that evokes The Ergs! and other sorts of happy-go-lucky, energetic pop punk outfits. It's still got that Weakerthans vibe, but like, they're <i>happy</i>.",
            "With both of these tracks, you get the idea pretty much immediately, but you stick around to see the rest anyway."
        ]
    }, {
        "song": "Man of Weakness (Acoustic)",
        "artist": "Your Smith",
        "spotify_id": "2wNxLMab6QXz0gqFaF3SHM",
        "post_page": "2020-05-11",
        "description_lines": [
            "Variations on a theme--we don't know Your Smith either. This is a nice acoustic chick track. It sounds like something Phoebe Bridgers and Julien Baker might have collab'd on before they matured as songwriters. It's not going to blow you away, but it's not going to turn you away, either."
        ]
    }, {
        "song": "Striking\", \"May I Have This Dance\", and \"Morning",
        "artist": "Francis and The Lights",
        "spotify_id": "4A3sNKJXtH0bG2JvslzN8H",
        "post_page": "2020-05-11",
        "description_lines": [
            "You guessed it--we'd never heard of Francis and the Lights, either. Judging by their listens on Spotify and some of their collaborators (Chance the Rapper and Justin Vernon (of the Justin Vernons)), we are late to the party on this one.",
            "We're not sure exactly what to make of them. They feel to us almost like a cross between Peter Gabriel and The Weeknd? \"Striking\" is one of their oldest tracks on Spotify, and it feels much more organic and experimental. \"May I Have This Dance\" is more corporate, more professionally produced, and the Chance remix feels a little bit cynical and opportunistic, but it is at the same time an undeniable earworm. The same goes for \"Friends (feat. Bon Iver).\" Everything about these tracks makes us want to want to (not a typo) roll our eyes, but the truth is that this is pretty solidly constructed music, even if it's not entirely for us. It's the side of Justin Vernon's music that could have had interesting commercial appeal if he hadn't reached a higher plane of auteur consciousness and left us mere mortals behind in the dust.",
            "\"Morning\" has the same kind of easy-rolling, Sunday morning vibe as other famous morning songs--\"Sunday Morning,\" \"Easy,\" etc. The jaunty, rolling keys give the effect of actually walking down the sidewalk, reflecting on your life and its relationship to Justin Vernon's.",
            "We will be curious to see what kind of rxns these tracks get from the rest of the crew."
        ]
    }, {
        "song": "Presumably Dead Arm (617 Sessions)",
        "artist": "Signey Gish",
        "spotify_id": "7iFmqWr2KDvNJt9ZCm7V21",
        "post_page": "2020-05-04",
        "description_lines": [
            "We had a brief but torrid affair last year with Sidney Gish's 2017 record <i>No Dogs Allowed</i> (and how about <i>that name</i>, by the way?). This is another of her tracks from 2017. It's light and finger-picked--until it's not. The strummed guitar that comes in halfway through gets a lot twangier, and Gish's voice gets more shrill and desperate. It's a nice juxtaposition, and it underlines the frantic feelings behind the lyrics",
            "We find now looking back that you've got to be kind of in the mood to throw on <i>No Dogs Allowed</i>, but \"Presumably Dead Arm\" feels a little much universally approachable."
        ]
    }, {
        "song": null,
        "artist": "Day Wave",
        "album" : "Crush",
        "spotify_id": "3hfl52ng9pom8zbp1RLJzx",
        "post_page": "2020-05-04",
        "description_lines": [
            "A nice little new EP that came our way this past week from a group by the name of Day Wave. We don't know much about them, but the opening track \"Starting Again,\" hits you from the opening notes. It feels like an intersection between Tycho and <i>Minors</i>-era Toro y Moi. It's got the deep, simple bass lines of chill/vaporwave, set against a running tambourine line that gives a nice sense of forward motion to the track. The lyrics are sufficiently distant to enhance the chilled out, day drunk effect of it all. When it comes to the other tracks on the EP, they're not nearly as standout, but they're all solid. Second place goes probably to the closer, \"Crush,\" which is a lo-fi, pretty, rolling piano ballad somewhat in the vein of Tobias Jesso, Jr."
        ]
    }, {
        "song": null,
        "artist": "Alex Cameron",
        "album": "Miami Memory",
        "spotify_id": "33u2PRETjYklC6UqxJBGW2",
        "post_page": "2020-05-04",
        "description_lines": [
            "The opening few tracks on this record are FIRE. Specifically, the first track, \"Stepdad,\" has a real Honey Boy feel to it. It's written as a short-fallen good-bye from a failed stepdad to his stepson as he's being kicked out of the house. It has a glitzy, flashy feel to it, but the whole thing is against a single line in the chorus: \"I'm your step-dad.\" When Cameron hits the word \"dad,\" he hits it flat every single time, and the effect creates the very feeling that we imagine one would have toward just such a routinely imperfect stepparent. To us, this track is really the stand-out on the record.",
            "\"Stepdad\" is followed by the eponymous \"Miami Memory.\" Sufficiently sleazy, this track is tombout \"eatin' your ass like an oyster\" and \"[comin'] like a tsunami.\" The whole thing fits with Alex Cameron's general persona as a failed entertainer. The next track, \"Far From Born Again,\" came across our radar a few weeks ago, and we were torn enough on it at the time that we didn't include it on that week's WMT. Now, with the context of the entire record around it, we understand this track a lot better.",
            "We haven't had as much experience with some of the lattermost songs, so those remain to be truly explored."
        ]
    }, {
        "song": "Powder Blue / Cascine Park",
        "artist": "Yumi Zouma",
        "spotify_id": "1WnB6Oe5PHoV83UIYmq0sz",
        "post_page": "2020-04-27",
        "description_lines": [
            "You all know the Yummy Zoomsters by now--in fact, you all probably <i>are</i> yummy Zoomsters by now--but this is an older track that we just stumbled upon. It's not included on any of Yumi Zouma's LPs, and instead appears on 2018's <i>EP III</i>. It's pretty classic Why Zed, with a shuffling, persistent, hi-hat driven pulse underneath breathy vox and ethereal keys. Best listened to, like all Zumi Youma, day drunk and lazing on a yacht somewhere."
        ]
    }, {
        "song": "Pink Pony Club",
        "artist": "Chappell Roan",
        "spotify_id": "4xeGlEItAGRsWFykY7ixjW",
        "post_page": "2020-04-27",
        "description_lines": [
            "This one starts off as a breathy, piano ballad, but quickly dives into the sort of synthy, pulsing music we've come to expect of indie chicks over the last ten or so years. It's repetitive--I'm gonna keep on dancin', and on and on--but in the same sort of hypnotic way as all of these songs. We don't know much about Chappell Roan--it looks like she's released a handful of other tracks, none of which particularly grabbed us--but we'll keep an eye out for more from her in the future."
        ]
    }, {
        "song": "everyone blooms",
        "artist": "The Front Bottoms",
        "spotify_id": "1ifHinbz0uDy856VRBMPEE",
        "post_page": "2020-04-27",
        "description_lines": [
            "The Fun Bottoms have been one of our more distinct discoveries here. Their sound is instantly recognizable, and this track is no different, right down to the half-sung, half-not-quite-screamed-but-still-quite-forcefully-stated lyrics. It's no \"camouflage\" or \"twin-size mattress,\" but it's still worth a listen.",
            "Weirdly, the FBs are apparently opening for Jimmy Eat World on tour in the late summer/early fall..."
        ]
    }, {
        "song": "Dealer",
        "artist": "RMR",
        "spotify_id": "2DwKP4rWgDwefcFsPWT9pj",
        "post_page": "2020-04-20",
        "description_lines": [
            "Several weeks ago, we brought you [via Chris Koller] the absolutely fire \"Rascal\" from RMR. The mysterious artist is out with a new track and video, \"Dealer.\" It's shorter and less shocking than \"Rascal,\" but still very high quality and worth a listen. The video features a man--presumed to be the artist himself, in his now trademark ski mask and sandals+socks combo--being buried alive at the beach by some white lady.",
            "If you hop over to RMR's YouTube channel, you'll also find that the artist has posted a series of short videos which seem to serve as...trailers? for upcoming tracks. A couple released last week ended with the word DEALER flashed across the screen, and one posted three days ago seems to be advertising an upcoming track called \"Her Flesh Was Forbidden\"? We're staying tuned on this front for sure.",
            "We've also discovered, through this <a href = \"https://www.youtube.com/watch?v=RqOEobuVfkM\">Digital Fader Fort 2020 performance of \"Rascal\"</a>, that the artist's name is not pronounced \"Arr-emm-arr\" as we initially thought, but actually \"rumor.\" Who knew? At any rate, this video's worth a watch too--the St. Laurent bulletproof vest is swapped out for a Canada Goose jacket."
        ]
    }, {
        "song": null,
        "artist": "Lambert",
        "album" : "True",
        "spotify_id": "6U2xxftHI11KUGHckT6LE5",
        "post_page": "2020-04-20",
        "description_lines": [
            "This little-known German artist produces nice, short instrumental tracks--mostly synth and keyboard. There's not much to say here, except that this album is a really nice, gloomy listen--it's almost got a \"True Love Waits\" vibe to a lot of it--and that the artist apparently only performs with a Sardinian mask on. So, there's that.",
            "Check out the track \"Awake\" for a nice nugget."
        ]
    }, {
        "song": "China Gates",
        "artist": "John Adams",
        "spotify_id": "1yzoe7r21sTWPcPc57OrPc",
        "post_page": "2020-04-20",
        "description_lines": [
            "John Adams did the score for Luca Guadawannaneedahavea Bojangles' <i>I Am Love</i>, and just dropped this nice new piano track this week. It's very much in the skittery, shimmery style of that score, so if that appealed to you, then this will to."
        ]
    }, {
        "song": "Valens",
        "artist": "Graveyard Club",
        "spotify_id": "0zDnleArIoIwZ04qwhSZI3",
        "post_page": "2020-04-20",
        "description_lines": [
            "Graveyard Club have appeared here before, and by now, you know what to expect. This is an upbeat, synthy, shiny, slap-happy track, like M83 meets Chairlift."
        ]
    }, {
        "song": "forever",
        "artist": "Charlie XCX",
        "spotify_id": "5GsJIVCBFjhCcUwJaTW2sB",
        "post_page": "2020-04-20",
        "description_lines": [
            "We feel like we missed the boat on Charli XCX and, to be frank, still aren't really all that familiar. But this track popped up on our radar this past week and it really appealed to us. It's catchy, but the catchiness is masked by noise and constant shifts that keep us on our toes, like a more approachable Sleigh Bells or 100 gecs. Eventually the entire track deteriorates, decomposes, falls apart. It's a cool effect. We're open to other Charli XCX recos, if y'all got 'em."
        ]
    }, {
        "song": null,
        "artist": "The Bardic Depths",
        "album" : "The Bardic Depths",
        "spotify_id": "0pkbTVogVavulw1uNRC5sE",
        "post_page": "2020-04-20",
        "description_lines": [
            "This one's a little unusual--a prog rock concept album about the friendship between J.R.R. Tolkien and C.S. Lewis, with lyrics written by a history professor at Hillsdale College. It actually...kinda works. We haven't spent that much time with it but it's surprisingly approachable on first listen. It's definitely got an old school prog feel to it, but nothing too intricate. Fans of Pink Floyd will feel at home enough to get a handle on it."
        ]
    }, {
        "song": null,
        "artist": "Empty Country",
        "album" : "Empty Country",
        "spotify_id": "5AQVArKM4CPlbVwb4KG6mK",
        "post_page": "2020-04-20",
        "description_lines": [
            "This one came across our radio due to the fair amount of positive press it's been receiving. We can't say we like it quite as much as the reviews suggested we might, but it's a very solid record with some really nice tracks. The opener, \"Marian,\" is ABSOLUTE FIRE. It will get you moving instantly and keep you moving the entire time. We feel, unfortunately, that it makes a bit of a promise that the rest of the record can't keep, but that being said, we've been spinning this more than anything else this week."
        ]
    }, {
        "song": "x",
        "artist": "x",
        "spotify_id": "x",
        "post_page": "x",
        "description_lines": [
            "x",
            "x"
        ]
    }, {
        "song": "x",
        "artist": "x",
        "spotify_id": "x",
        "post_page": "x",
        "description_lines": [
            "x",
            "x"
        ]
    }, {
        "song": "x",
        "artist": "x",
        "spotify_id": "x",
        "post_page": "x",
        "description_lines": [
            "x",
            "x"
        ]
    }, {
        "song": "x",
        "artist": "x",
        "spotify_id": "x",
        "post_page": "x",
        "description_lines": [
            "x",
            "x"
        ]
    }, {
        "song": "x",
        "artist": "x",
        "spotify_id": "x",
        "post_page": "x",
        "description_lines": [
            "x",
            "x"
        ]
    }, {
        "song": "x",
        "artist": "x",
        "spotify_id": "x",
        "post_page": "x",
        "description_lines": [
            "x",
            "x"
        ]
    }, {
        "song": "x",
        "artist": "x",
        "spotify_id": "x",
        "post_page": "x",
        "description_lines": [
            "x",
            "x"
        ]
    }, {
        "song": "x",
        "artist": "x",
        "spotify_id": "x",
        "post_page": "x",
        "description_lines": [
            "x",
            "x"
        ]
    }
]
