[
    {
        "song": "Remember",
        "artist": "Jodi",
        "spotify_id": "5oDRMJMrMhEuFq37stGFkW",
        "post_page": "2020-12-07",
        "description_lines": [
            "Sometimes we impress even ourselves.",
            "When we first came across \"Remember,\" it stood out to us as something we'd heard before. (Not the song itself, of course--we knew that was new. But like a feeling of deja vu you feel in a place you're sure you've never been, it felt <i>familiar</i>.) There was something about the nonchalant vocals, the endearingly overwritten lyrics (such as \"metacarpal karaoke\"), the old attic creakiness of the acoustic guitars and drum sets, the way that the same melody evolves and changes over bars and bars (like those syncopated 16th notes we get on the guitar) but never gets very far from where it began, that felt like something we'd been listening to for a long time.",
            "Was it DeYarmond Edison? That was part of it, but not quite. This was a little too raw, alive, and youthful for that. And then it hit us: Pinegrove. It never explodes the way certain Pinegrove tracks--c.f. \"Aphasia\"--do, but all of the pieces were there. And a quick Google search revealed that, indeed, \"Remember\" is an entry from a 2017 stand alone solo EP by former Pinegrove founding member Nick Levine. (Nick is the brother of Pinegrove drummer Zack Levine, who is responsible for, among other things, the incredibly on-point and tasteful drumming in <a href=\"https://www.youtube.com/watch?v=YnsiyiC0Nc0\">\"this live studio version of \"Aphasia\"\"</a>--check out 2:30 and 4:15-4:25 (that fucking cymbal choke, though...))",
            "So, yeah. Sometimes we can hear when music sounds like each other."
        ]
    }, {
        "song": "Bara du och jag",
        "artist": "Tove Styrke",
        "spotify_id": "0xfpnnU2xGRDfaAXLqe6Je",
        "post_page": "2020-12-07",
        "description_lines": [
            "As soccer fans the US over know, the road to alternative relevance runs through the leisures and pastimes of Europe. We're not much for soccer ourselves--lotta unnecessary plays--but we get our kicks too.",
            "One such kick in recent years has been Tove Styrke. Styrke, who got her break in 2009 when she finished as the third place contestant on Swedish Idol (this is real), went on to establish a solo career that eventually lead to 2018's absolutely fire <i>Sway</i>. Seriously, we know every beat and moment of this record. It may have been the only thing we listened to over the course of that entire year. This is another one to just do the whole way through, but if you must streamline, start with opener \"Sway\" and then move on to \"Mistakes,\" which is probably the best song ever written. (Then, check out <a href=\"https://www.youtube.com/watch?v=8AAD9CX0e-E\">\"another live studio version\"</a>, this time with Karl Almost Knausgaard on drums.)",
            "At any rate, we've been on the lookout for some new Tove Styrke for awhile now, but all we ever get is Tove Lo. Well, no longer. Because now we've got \"Bara du och jag\" (which, Reddit tells us, translates to \"Just You and Me.\" And even though the majority of the lyrics--aside from \"come dance with me darling\"--are in Swedish, it's definitely got that vibe.) This isn't as bare and cool as Sway. It's louder, broader, more of a mouthful, more earnest. The opening notes almost remind us of Love You Later's \"How Many Nights Do You Dance with Tears in Your Eyes?\" Pretty quickly, though, that plucky, ebby bass in the background is accompanied by a four-on-the-floor bass drum pattern that tells us things are going to get a little more upbeat than that. And indeed they do. Next comes a first pass at a chorus, and then a second, with more and more instrumental voices layering on. Pretty soon, the whole thing is plugging along behind a series synthy backbeat.",
            "Like we said, it's less cool and guarded than <i>Sway</i>. There's actually--dare we say it?--a hint of ABBA to the whole thing. And all of your friends down on the pitch will think it's bloody brilliant that you're listening to music in another language"
        ]
    }, {
        "song": "Good Girls (Don't Get Used)",
        "artist": "Beach Bunny",
        "spotify_id": "2yKNCN7jsi5XtwJL5jBG1z",
        "post_page": "2020-12-07",
        "description_lines": [
            "Longtime readers of the WMT just soiled themselves.",
            "That's right--we've got ourselves a new Coastal Rabbits track. The Oceanside Hares require no introduction here, especially after 2020's Honeymoon--which we fully expect to grace a lot of the aforementioned Top 10 lists around here. If you're somehow still unfamiliar, can we recommend \"Ms. California\" off of that record, as well as earlier tracks like \"Prom Queen\" and \"Sports\"?",
            "At any rate, for those who've been around the block, let's talk about \"Good Girls (Don't Get Used).\" There's a lot of classic Beach Bunny here: youthful female vocals, shimmering arpeggiated chick pop guitar parts, punchy driving drums with a tom-tom-forward interlude, and lyrics lifted straight from a high school diary. Here's where we actually find the biggest change. Because unlike the earlier tracks we mentioned above, lead singer Lili Trifilio is no longer singing about her shortcomings or the girls that got the guy she wanted--now she's taking aim at Chad himself.",
            "By the way, not this is at all relevant to anyone we know, but Beach Bunny are scheduled to perform in Paris, France on April 19th, 2021. Just sayin'."
        ]
    },{
        "song": "What Are Friends For?",
        "artist": "The Sonder Bombs",
        "spotify_id": "64F2l136oePmUwOG9zB1vU",
        "post_page": "2020-11-30",
        "description_lines": [
            "Speaking of pop punk, check out this track by The Sonder Bombs. (Fun fact from the band's website: \"sonder\" itself is a noun which apparently stands for the feeling that comes with the realization that all of the strangers around you are living lives as rich and meaningful--not necessarily in a good way--as yours.) This is fun, energetic, sad chick pop punk that sounds like a threesome between Beach Bunny (aka Coastal Rabbits), Sincere Engineer (aka Heartfelt Architect), and Snarls (good luck on that one), all of whom have graced places atop the WMT in weeks past.",
            "Our one minor complaint with this one is that we think it might've been better served by a more lo-fi approach. It feels a little produced at times, but is nevertheless highly listenable and seems to possess a strange power over the \"repeat\" button."
        ]
    }, {
        "song": "What Year Are We In",
        "artist": "Kitten",
        "spotify_id": "1jkCLNfGQJgymKExs4MGZs",
        "post_page": "2020-11-30",
        "description_lines": [
            "Kitten are stars of the WMT. \"Memphis\" (not to mention its acoustic follow-up) remains one of the best and most infectious songs we've ever had the privilege to cover, and the group took a turn towards <i>la resistance</i> with the COVID-era herd immunity anthem \"My House.\" (The cover art to that single depicted a nude demented looking version of the group's lead singer stuffed into a miniature-sized house and the lyrics explained  that \"I'm watchin the world freakin out from my couch/Don't know what they're talkin about in my house/I wanna have fun again, I wanna go out/But they told me to stay in my house.\") Now, Kitten continue their turn toward far-right extremism with another banger entitled \"What Year Are We In,\" which talks about the hopeless nature of protests, Zoom parties, and getting pissed off over conspiracy theories.",
            "As far as the sound, it's got a bounce to it. There are some synthy keys and horns, not to mention a drum machine, that make the whole thing sound like an updated '80s throwback, which fits in well with the name and theme. There are other parts of the track that remind one of Madness (and, of course, \"[Their] House\"). In the end, one of the things that really interests us about Kitten is that, of the four tracks of theirs which have made it onto the WMT, they're all bangers, but they all sound totally different"
        ]
    }, {
        "song": "Hurt Me Now",
        "artist": "ASL",
        "spotify_id": "6tDrZQQhEWrHsYafpziiwg",
        "post_page": "2020-11-30",
        "description_lines": [
            "a/s/l? (only kids from the '90s will get it!!!)",
            "Anyway, we stumbled across this track, from a group that seems only to have been making music since about 2018, over the course of this past week. It should be kind of a mess of a track, with lots of heavy synth, drum machines, tons of reverb, misplaced horns, and a borderline hip hop/spoken word chorus, but all of it comes together in a surprisingly pleasant way. This isn't a banger--it's not one that's going to carry you away immediately. It's got the vibes of Robbi Robb's \"In Time\" but without the power and meaningfulness. But if Blood Orange's \"Time Will Tell\" is the perfect track for a postgame a deux, then \"Hurt Me Now\" might work best for its melancholy solo equivalent."
        ]
    }, {
        "song": "Empty (Dirt Road)",
        "artist": "Metric",
        "spotify_id": "7z7PeijP5wMkEWHvTrWKer",
        "post_page": "2020-11-23",
        "description_lines": [
            "Metric are, as an act, nearly as old as us, and yet they are also relatively unfamiliar to us. We've heard of them, of course, and they seem to be favorites of a lot of our fellow travelers, but we've never really listened to them at all.",
            "Well, in 2005, they released in album called <i>Live it Out</i>, which opened with a track called \"Empty,\" which we've never heard before. We bring this up because, recently, they released an acoustic version of this song which came across our desk. \"Empty (Dirt Road),\" as this version is called, is pretty nice. It opens with a creaky, antique-y finger-picked acoustic guitar, a pretty resonant-sounding piano, and a whole lot of reverb. The track stretches and pops its' knuckles in ways that remind us of Marlon Williams' \"Strange Things\"--which you may recognize from the soundtrack of <i>Wild, Wild Country</i>--but without any of the creeping, old-timey eerieness of that track. Instead, what we've got here is melancholy, almost like Williams meets Jewel meets, at times, The Weakerthans.",
            "One of the things we like about this song is how long it lasts. It feels almost oppressive--it just goes on and on, and eventually resigns itself to its final, unbelieving refrain: \"I'm so glad I'm an island now\" [via Paul Simon and Garth Brooks]."
        ]
    }, {
        "song": "Walking on a String (Alt. Version)",
        "artist": "Matt Berninger, Phoebe Bridgers",
        "spotify_id": "4k4VlcZtwPBDj6wx5ewzog",
        "post_page": "2020-11-23",
        "description_lines": [
            "Because Phoebe Bridgers is one of our favorite young artists, anything to which her name is attached is of immediate interest to us. In 2019, Bridgers collab'd with The National's Matt Berninger to record a track called \"Walking on a String.\" They released two versions of the track--the original and the \"alt version.\" The first one is a little more Berninger-forward, while the alt version is more Bridgers-forward, and, since we like Phoebe Bridgers more than we like The National, the alt version is our version of choice. It really sounds like it could have been a hidden track on 2018's <i>Stranger in the Alps</i>. (If, by some unfortunate turn of events you haven't yet experienced <i>SITA</i>, you've got something great coming. It's a solid listen-through, but \"Motion Sickness\" and \"Scott Street\" are early Stan Doubts.)"
        ]
    }, {
        "song": "Special Berry",
        "artist": "standards",
        "spotify_id": "6wQxjMRiJ9uqCiJSV5yAU7",
        "post_page": "2020-11-23",
        "description_lines": [
            "Call it what you will: math rock, post-rock, whatever you want, standards is apparently an Ezra Koenig-lookin' motherfucker with a guitar, but he does a lot with it. This track reminds us a lot of Fang Island, or the happy-go-lucky younger brother to Joan of Arc, or even, at times, STS9. It's basically a single guitar riff extended to about 3 or 4 minutes and length and constantly recycled and reinterpreted according to different genres, techniques, and tempos. Think of it as an organic \"Grape Soda.\"",
            "This dude also has a vibe. If you check out the music video for standards, you'll note his, again, Ezra Koenig face, his cutesay fingerboard inlays, and his array of stuffed animals. It extends to the cover art for his (their?) recent record, <i>Fruit Island</i>, as well."
        ]
    }, {
        "song": "Prior Things",
        "artist": "Hop Along",
        "spotify_id": "3X2899UzmQjl7gz0JsH42k",
        "post_page": "2020-11-16",
        "description_lines": [
            "This one came to us via shuffle, and although we'd never heard of Hop Along before--and had, admittedly, to clarify which phrase was the band name and which was the song title--it felt really familiar. It has a nice, comfortable, strumming-on-an-acoustic-guitar momentum to it (though with a little buried bit of the sort of string-forward frenzy that's showcased on tracks like, say, \"Burn the Witch\" by Radiodome), and the unusual particulars of the lead female vocals reminded us of Francis Quinlan, who appeared on the WMT earlier this year with \"Piltdown Man.\"",
            "xIndeed, a quick Google search reveals that \"Piltdown Man\" is one of Quinlan's solo efforts, and that, as a day job, she fronts Hop Along. So, look at us. This track doesn't grab us as much as \"Piltdown Man\" did--that one felt like it was written after spending some time with Joanna Newsom's Divers (which, speaking of spending time with, is worth about 8 months of your time)--but it's not nothing, neither. "
        ]
    }, {
        "song": "Runaway Dog",
        "artist": "Retirement Party",
        "spotify_id": "75ZI6agJsfrauG2Az6myJK",
        "post_page": "2020-11-16",
        "description_lines": [
            "We'll start by saying that you've got to give this one a minute. When it first opens, it does so over about a minute of a coughy, polluted guitar and bass riff, but this is like one of those indie tracks from the early-to-mid aughties that builds and builds and builds. In that respect, it almost feels like Funeral-era Arcade Fire, but like, if they had just discovered distortion and were, like, mildly about it. All in all the best part of this track is the outro, when the same forward momentum that's been building throughout the entire track barrels down on you underneath a desperate, arpeggiated...is it synth? is it guitar?...riff.",
            "Once that first minute is over and the song starts to bloom, you'll get the idea pretty quickly. From there, you can make up your mind for yourself or not as to whether to keep things going."
        ]
    }, {
        "song": "Over You",
        "artist": "HOLYCHILD",
        "spotify_id": "0O9AJJwRYvtiVGMceCC7lF",
        "post_page": "2020-11-16",
        "description_lines": [
            "We deliberated over this one for a while. But, in the end, what's to deliberate over? It's a big, synthy, bombastic, chick-driven pop song, and isn't that what we're mostly about here at the WMT? The verses here plod along atop a four-on-the-floor drum beat. That pattern continues into the choruses, of course, but it's joined by an explosion of shimmery synth parts that really take everything over the top. Just over halfway through, we also get a nice interlude that tamps things down in a way that feels middle school meaningful.",
            "Who do they sound like? There's so much going on here that it's a little hard for us to tease it out. It's like a big sloppy mess of bubblegum Robyn and indie Ting Tings and Spiceworld-era Spice Girls. (The Weekly Music Thread--it's like wine tasting, but for random songs from Spotify.)",
            "And, for what it's worth, Wikipedia tells us that, back when they were together, HOLYCHILD were \"known for their use of pubic hair in music videos.\" But, then again, who isn't?"
        ]
    }, {
        "song": "two reverse",
        "artist": "Adrianne Lenker",
        "spotify_id": "630Ts93UYV4ULSjsBDQdvn",
        "post_page": "2020-11-09",
        "description_lines": [
            "Adrianne Lenker, best known for fronting Big Thief, has recently started releasing solo music, and this track (the opener to 2020's songs) is one which really grabbed us. A ballad driven by intricate, vaguely dissonant, and at-times-finger-picked strings, it feels like Big Thief (duh) meets Joanna Newsom meets recent Tallest Man on Earth. It's beautiful but melancholic, peaceful but with a touch of quiet frenzy to it, too. You best believe that this track is going to kick off on our part an exploration of more of Lenker's solo work."
        ]
    }, {
        "song": "faith healer",
        "artist": "Julien Baker",
        "spotify_id": "2hNXb6IDn3CvvHjjwauEM3",
        "post_page": "2020-11-09",
        "description_lines": [
            "We've been big fans of Julien Baker ever since she burst onto the scene with 2015's <i>Sprained Ankle</i>. (If you haven't already, listen to that whole record straight through, but if you must pick favorites, we recommend the eponymous \"Sprained Ankle,\" \"Everybody Does,\" \"Something,\" and the elegiac \"Go Home.\" Like Justin Vernon and Kristian Matsson, Baker's got a thing for ending guitar records with piano tracks.)",
            "Like Phoebe Bridgers (with whom she collabs in the form of Boygenius), Baker is following up soft-spoken success with louder, more electric efforts. And although \"faith healer\" definitely retains a lot of the beauty of Baker's earlier work, \"louder\" is definitely the right word--the track is, at times, downright cacophonous (relative, of course, to Baker's other work). This song feels more confident than anything else she's released before. We look forward to seeing where that goes."
        ]
    }, {
        "song": "Killing Floor",
        "artist": "Emma Ruth Rundle, Thou",
        "spotify_id": "7CdVWqLUcMrFQH2fakdhRi",
        "post_page": "2020-11-09",
        "description_lines": [
            "The first track on this week's list to receive proper capitalization, \"Killing Floor\" is a little different from the usual fare on the WMT. It opens with nearly a minute of spectral, synthy tones which sort of evoke Disintegration-era The Cure or William Basinki's Disintegration Loops. At nearly the one minute mark, however, we break into a synthy, sludgy, metallic lurching sort of drone which creeps its way along for the next five or so minutes. We're not sure if this one will stick or not, but it's a really cool track (and the cover art for the record is really cool)."
        ]
    }, {
        "song": "Television Romance",
        "artist": "Pale Waves",
        "spotify_id": "2diAlJqrMMX7Sv9FlzcUMc",
        "post_page": "2020-11-09",
        "description_lines": [
            "The title and band name alone were almost enough to land this track on the WMT. Come on, look at 'em--you just knew this was going to be up our alley.",
            "\"Television Romance\" is an instant banger. Even before you've heard the chorus, you know it's going to be an infectious synth pop dance anthem. It's got that organic, unsophisticated synth sexiness of, for example, a \"Kim and Jessie\" or a \"Graveyard Girl\" or a \"Hearts Like Ours.\" In all of these cases, what makes the refrain captivating is less its lyrical content and much more some sort of guitar and/or keys hook, and the same is true here. (That being said, repeating the phrase \"television romance\" over and over again has its own intoxicating adolescent import.)",
            "This song is like the soundtrack to some imagined, less affecting prequel to <i>Bright Lights, Big City</i>"
        ]
    }, {
        "song": "Wheels Roll Home",
        "artist": "The Antlers",
        "spotify_id": "1KtWevswskSNR37e8hi9iC",
        "post_page": "2020-11-09",
        "description_lines": [
            "What? Yes. New music from The Antlers--this is exciting stuff.",
            "As you may or may not recall, The Antlers released the single greatest album of all time in 2009's <i>Hospice</i>. Seriously. If this hasn't affected you, take the next 18-24 months and listen to it almost exclusively, just like we did. Not impressed on first listen? Okay. Join the club. Listen to it a second time. \"Oh, yeah, I guess 'Bear' and 'Two' are pretty good.\" Oh, do you? Listen to it a third time. \"Oh Sylvia is kind of cool, too, I guess.\" That so? Do it again and again and again until you begin to realize that every single moment of that record is more important than the most important moment of your life. But that's okay, because by that time, every single moment of that record will be a moment of your life, too.",
            "At any rate, after Hospice, The Antlers went on to release <i>Burst Apart</i> (2011), <i>Undersea</i> (2012), and <i>Familiars</i> (2014). Then, tragically, they stopped making music. In March of last year, however, rumors surfaced that they were recording again, and last week frontman Pete Silberbro and drummer Michael Lerner released the single \"Wheels Roll Home.\" Per Silberdude, \"'Wheels Roll Home' is a simple song about the hopeful promise of reunion after a long time gone. It's that feeling of finding home in someone, eager and impatient to build a life together. It's the experience of waiting out tumultuous times, longing for stability someday.\" As Timothee Chalamet might say, \"ca fait longtemps.\"",
            "As far as the track itself goes, it's very <i>Undersea/Familiars</i>-wave, but we're not complaining. We're looking forward to the full-length. In the meantime, as the temperature continues to go down, we plan on spending yet another winter--our twelfth straight--with <i>Hospice</i>."
        ]
    }, {
        "song": "Trust Me",
        "artist": "Sincere Engineer",
        "spotify_id": "72rJBBioVhxm4A3XajM3Yn",
        "post_page": "2020-11-09",
        "description_lines": [
            "For more on Sincere Engineer, check out this week's <i>Up the Punx</i> installment below.",
            "As for this track in particular, \"Trust Me\" is a 2020 single which we hope heralds the appearance of a full-length (or at least a few more singles) on the horizon. This is a little darker and more emo-informed than Sincere Engineer's earlier works, and the production is certainly more polished as well. To be frank, we'd actually recommend starting with 2017's <i>Rhombithian</i> (just see below already!) and then coming back to this emo banger. But you really can't go wrong--these guys make very solid garage punk music."           
        ]
    }, {
        "song": "SGL",
        "artist": "Now, Now",
        "spotify_id": "3speBfGPCck1oe47EBPnhh",
        "post_page": "2020-11-02",
        "description_lines": [
            "Although we're not familiar with this group, they seem to have something of a discography (along with something of a following). At any rate, this track, \"SGL\"--which presumably, based on the lyrics, stands for \"shotgun lover\"--is worth at least a few listens. There's a warmth to the recording effects on the eighth note acoustic guitar strumming that backs the whole thing, and it feels almost like the War on Drugs meets Phoebe Bridgers meets Washed Out? But that doesn't quite put a finger on it, does it?",
            "Also, the music video, which is almost nothing, is also somehow strangely affecting..."
        ]
    }, {
        "song": "Nobody Loves You",
        "artist": "Similar Kind",
        "spotify_id": "4hlQeZJV29wKrTPLmqXkab",
        "post_page": "2020-11-02",
        "description_lines": [
            "In contrast to this week's other offering, Similar Kind are a group with a small discography and a small following (less than one-tenth of the monthly listeners of Now, Now). That being said, this track is an infectious one. It carries forward with what feels like a hi-fi version of Flake Music energy, and there's a touch of The Cure in some of the guitar runs you'll hear in the background. Interestingly, the drums are a little bit busier than you typically get on this sort of track, and the mix is surprisingly bass-forward, but all of those contribute to a frenetic energy which kind of meshes with the lyrical content."
        ]
    }, {
        "song": "Easier to Love",
        "artist": "Kississippi",
        "spotify_id": "3GqVIRlygsC48rklRcAHTb",
        "post_page": "2020-10-26",
        "description_lines": [
            "We're newcomers to Kississippi. We've seen the name around but have never really gotten into them. We decided to give them a spin this week, and came across these two tracks.",
            "\"Easier to Love\" has a little bit of a Beach House vibe to it, what with the washed-out tremulousness, crisp and clean hi hat notes, and glassy, staircase-climbing guitar parts. But there's something else to it, too, almost like early Pure Bathing Culture.",
            "\"Around Your Room\" is a harder track. Right off the bat, it's got a fat, serious bass line, and it pairs it with big ass percussion. About the bass line--it's like something off of the Drive soundtrack. That being said, nothing else here really is. If \"Easier to Love\" was like Beach House + Pure Bathing Culture, \"Around Your Room\" is like Heartthrob-era Tegan and Sara + Lover-era Taylor Swift. (In fact, listening to \"Around Your Room\" and \"Cruel Summer\" back-to-back, there's a definite harmony there.) So, you do the math."
        ]
    }, {
        "song": "Around Your Room",
        "artist": "Kississippi",
        "spotify_id": "37C77C5KP3MZINt2P3HZUv",
        "post_page": "2020-10-26",
        "description_lines": [
            "We're newcomers to Kississippi. We've seen the name around but have never really gotten into them. We decided to give them a spin this week, and came across these two tracks.",
            "\"Easier to Love\" has a little bit of a Beach House vibe to it, what with the washed-out tremulousness, crisp and clean hi hat notes, and glassy, staircase-climbing guitar parts. But there's something else to it, too, almost like early Pure Bathing Culture.",
            "\"Around Your Room\" is a harder track. Right off the bat, it's got a fat, serious bass line, and it pairs it with big ass percussion. About the bass line--it's like something off of the Drive soundtrack. That being said, nothing else here really is. If \"Easier to Love\" was like Beach House + Pure Bathing Culture, \"Around Your Room\" is like Heartthrob-era Tegan and Sara + Lover-era Taylor Swift. (In fact, listening to \"Around Your Room\" and \"Cruel Summer\" back-to-back, there's a definite harmony there.) So, you do the math."
        
        ]
    }, {
        "song": "Die Waiting",
        "artist": "Beck",
        "spotify_id": "4qAGr8V6mMg9itQpzcIB38",
        "post_page": "2020-10-26",
        "description_lines": [
            "Beck is one of those artists we've always wanted to explore more. We spent a lot of time with Midnite Vultures (1999) for about two weeks in Boston, but past that, we've never really given the man his career's due. Perhaps one day.",
            "At any rate, we stumbled across this track, from 2019's <i>Hyperspace</i>, and quite liked it. (By the way, check out that album artwork.) It's a pretty mellow track and you get the hang of it quite quickly, but it's nice for driving around with the windows down when it's about 65 degrees outside and you vibin'."
        ]
    }, {
        "song": "The Whole of the Moon",
        "artist": "Kirin J Callinan",
        "spotify_id": "1601brj4nGFEWeOxe7KJuk",
        "post_page": "2020-10-26",
        "description_lines": [
            "This track comes to you courtesy of the dialysis queen of Durham. A musician who says that his primary motivation is to \"excite and confuse,\" Callinan makes these big, bombastic '80s informed anthems. This is a track which bounces along on its spritely synth and arena drums, but what we really like about it is the way Callinan strains when he reaches for certain notes. That, along with the soaring feeling of some of the guitar parts, really reminds us of John Parr's \"St. Elmo's Fire.\" (Interestingly, \"St. Elmo's Fire,\" which is the best song ever made, was written for the original soundtrack to <i>St. Elmo's Fire</i>, which is the worst movie ever made.) There's also a little bit of Robbie Robb's \"In Time\" here. (Interestingly, \"In Time,\" which is also the best song ever made, is part of the original soundtrack for <i>Bill and Ted's Excellent Adventure</i>, which is a pretty good movie.)"
        ]
    }, {
        "song": "Hate Mail (feat. J Mascis)",
        "artist": "Weakened Friends",
        "spotify_id": "6h5BX0HE5FoqrCP3xW8Txl",
        "post_page": "2020-10-26",
        "description_lines": [
            "We've had this track on repeat all week. It's a grungy, chick-fronted alternative track that features former Dinosaur, Jr. J. Mascis on a pretty squealy/shreddy guitar part. The verses have this sort of round, redundant, trundling feel to them, but transition into these sublime sing-along choruses heralded by some buried but reliable guitar scratches.",
            "Elements of this remind us of a much more laid-back and approachable White Lung. More on that below."
        ]
    }, {
        "song": "Wingspan",
        "artist": "Prinze George",
        "spotify_id": "5OftW7uxP2Z2rtbfkAbVjq",
        "post_page": "2020-10-19",
        "description_lines": [
            "This is a group we hadn't heard of before, with a few singles and a 2016 full-length by the excellent name of <i>Illiterate Synth Pop</i>. We'll investigate that one more fully in the week to come. As for this track, it's a pretty mellow, bassy ballad. It reminds us a little bit of Miel with a touch of that M83-style synth in the interlude. The track kicks up a little bit in the latter third with an octave jump in the vocals. There's nothing super stand-out here but it'd be fitting on a vibe playlist."
        ]
    }, {
        "song": "Only Acting",
        "artist": "Kero Kero Bonito",
        "spotify_id": "4aIoxZWHySrA3BpnmeREXJ",
        "post_page": "2020-10-19",
        "description_lines": [
            "Sometimes it seems like we've always been floating in the same orbit as Kero Kero Bonito. That being said, we've never really listened to them--until now.",
            "\"Only Acting\" is a track off of their 2018 <i>Time 'n' Place</i>. It opens up with a sing-song vocal melody over a drum machine and follows up by layering a bass line on top of that. This repeats for a while in a way that doesn't particularly grab you as a listener--until the entire track switches to a lofi take on organic instrumentation. At this point, the exact same arrangement feels utterly irresistible ,and we imagine it's hard to listen to on anything other than high volume (we haven't tried).",
            "It takes balls to break away from something so catchy, and KKB do exactly that. The song oscillates back and forth between this sort of pissed off daughter of Weezer vibe and a progressively cacophonous and electronic disintegration. Yes, there's a key change, but KKB undermine it almost immediately with aggressive glitching which heralds the end of the track. Although it's annoying to be taken away from the super infectious, driving side of this song, the whole thing kind of works, and we've listened to it in its entirety more than a few times at this point."
        ]
    }, {
        "song": "Hit Me Where It Hurts",
        "artist": "Caroline Polachek",
        "spotify_id": "2wcrQZ7ZJolYEfIaPP9yL4",
        "post_page": "2020-10-19",
        "description_lines": [
            "Back in 2019, Caroline Polachek's <i>Pang</i> appeared on a list of \"Best of\" lists, but we were never really able to access it. We're not sure whether or not that's still the case, but we came across <i>Pang's</i> \"Hit Me Where It Hurts\" last week and really liked it. It's got a dreamy, synthy, barred out borderline spoken word chorus melody that's vaguely reminiscent of Das Racist's \"Fashion Party,\" but this song isn't as light and tongue-in-cheek as that one is. The pre-chorus and chorus make that clear.",
            "This is a track that's at home on the same playlist as \"Wingspan,\" above."
        ]
    }, {
        "song": null,
        "artist": "Chumped",
        "album": "Chumped",
        "spotify_id": "7pVKWe8jRWOYxsnfhRoCci",
        "post_page": "2020-10-19",
        "description_lines": [
            "Chumped is a 2013 EP from the defunct, Brooklyn-based pop punk outfit of the same name. We encountered it this week for the first time and it really grabbed us. It's evocative of early Alkaline Trio meets The Ergs! meets maybe a little bit of Charly Bliss?--or at least that's the best we can do here. It's got a charming level of underproduction to it, and there's real energy and feeling behind these tracks."
        ]
    }, {
        "song": "Cancer in the Water",
        "artist": "Clarence Clarity",
        "spotify_id": "2aHWWqD3ceKgFff07klSUg",
        "post_page": "2020-10-12",
        "description_lines": [
            "If you have trouble finding this track, it's because the \"TM\" in the title is actually superscripted, not parenthetical. We just couldn't figure out how to do that in Gmail.",
            "At any rate, we stumbled across this track this week, and it exists somewhere at the intersection of crunchy and fun. The whole thing is basically one big loop, right down to the vocals: \"Before I get out/I'll put cancer in the water/before you got out/you left cancer in me.\" Whatever that means precisely is beyond us, but it's clear that it means <i>something</i>. (There are those on the internet who think the song is about the fluoridation of the water supply [via How I Learned to Stop Worrying and Love the Cancer in My Water].)",
            "As that Radioguts-wave lyrical loop burrows its way into your thoughts, the rest of the track expands to occupy your earballs. It's carried along by a jaunty little melody that whirrs and clicks, beeps, shudders, and groans, but never strays too far away from its catchy base. It feels a little bit like Baths meets Katie Dey (but we repeat ourselves) meets Passion Pit. (And if you don't know Katie Dey, who appeared on this thread a month or two back, may we please recommend \"Darkness\"?)",
            "Guys, this one is an obvious choice. It's not going to change lives but it'll certainly enhance any carefree day."
        ]
    }, {
        "song": "Finally Found",
        "artist": "Graveyard Club",
        "spotify_id": "2UyQA6lJdRSJXprPtvJrds",
        "post_page": "2020-10-05",
        "description_lines": [
            "A familiar favorite, Graveyard Club have appeared on the WMT before for the excellent \"Witchcraft,\" \"Cellar Door,\" and \"Valens.\" Well, we were revisiting them this week, and we stumbled upon another keeper: \"Finally Found.\" This track, from 2019, eschews the M83 synth fuzz of some of those others in favor of a serious, almost '50s doo wop sensibility, replete with those \"2and...4\" snare notes. It'd be at home in a David Lynch re-make of <i>Grease</i>."
        ]
    }, {
        "song": null,
        "album": "Live Forever",
        "artist": "Bartees Strange",
        "spotify_id": "4Lu520UvMf7lJccCnKw3hJ",
        "post_page": "2020-10-05",
        "description_lines": [
            "This isn't the first time Strange has appeared on the WMT. A budding solo artist, Strange has been releasing singles over the past month or so--most notably, \"Mustang\" and \"Boomer\"--in anticipation of his first full-length original solo album, Live Forever. (We've been really, really hot on those two tracks, by the way.) Well, <i>Live Forever</i> has dropped in the past week, and we've had time to give it a listen or two since it did.",
            "This is an interesting, if loose, record. It sounds almost like one you discover after getting into an artist's later work, then going back and revisiting their early stuff and telling your friends, \"Yeah, but have you listened to his early stuff? Some of that's pretty cool, too.\" The record kicks off with a creaky and ethereal track, \"Jealousy,\" which as a stand-alone doesn't seem to stand for all that much (which, according to our co-workers who are really into mainstream politics, means it will fall for anything.) Where \"Jealousy\" mostly makes its money is as a lead-in to second and third tracks \"Mustang\" and \"Boomer,\" which retain some of the creakiness but up both the amplitude and the tempo. These were the two singles we were most excited about in past weeks, and they're the by far the standouts on our early listens. They've both got that National desperation that marks the best of Strange's solo tracks. After that, the record travels into Strange's third single, \"Kelly Rowland,\" which, aside from its interesting sample, never captured us as much as the other two did.",
            "The next two tracks, \"In a Cab\" and \"Stone Meadows,\" mostly sound like less fully realized versions of Strange's other signals. Things take a turn, however, with \"Flagey God,\" which, atop a vaguely subterranean house music backbeat, manages to sound something like a cross between a haunting and an R&B single. From there, the rest of the back half of the record is much, much looser than everything that came before it. Several of the tracks are essentially just strings and vocals with synth landscapes slothing around behind them.",
            "On the whole, we don't exactly know what to do with this as a record. There's a lot we really like here--the whole thing has a roomy sort of unsettling noisiness to it, like a beautiful jalopy bumping and trundling through an eerie and unfamiliar fog. You can't quite make out where different sounds are coming from, whether they'll repeat or not, whether they have anything to do with the melody at all or whether they're just window dressing. But this is as much a strength as it is a weakness, and we if Strange will find a more effective way to consistently harness it moving forward."
        ]
    }, {
        "song": "My Trust is Low",
        "artist": "M4ts00n",
        "spotify_id": "6ZPzJi1KcV2M1KY3EkNa2K",
        "post_page": "2020-09-28",
        "description_lines": [
            "This is a really neat track. It's a creative, repetitive, stripped down loop that evokes The Books and, with its mixture of twangy strings and synth chords, almost an Uncle Kracker pop country vibe, if you will. Like a Kerouac novel, you'll get the idea about 30 seconds in, and decide that you either love it or hate it. (Unlike a Kerouac novel, on the other hand, we like this.)"
        ]
    }, {
        "song": "S.W.I.M.",
        "artist": "Midwife",
        "spotify_id": "41qO4ILS1Gm4A1Szf25pz3",
        "post_page": "2020-09-28",
        "description_lines": [
            "The first thing we noticed about this track is the title. \"S.W.I.M.,\" for those not in the know, is an extremely clever acronym--Someone who isn't me--that people use on Reddit when they want to inquire about drugs. Law enforcement haven't figured it out yet, and defunding of the police is likely to put that understanding even further out of reach, but stay tuned. They may surprise us yet.",
            "At any rate, the second thing we noticed about this track is this track. The whole thing is heavy, a big fuzzy blanket of synth, but like under that blanket you're on an Ambien as well. The track feels like warm water washing over you, the rhythmic eighth notes ebbing and pooling around your outline as you lay on your back in the lazy surf. This one is for feeling meaningful. It's fitting that the vocals are so obscured that you can barely understand them-- you don't need to. You can't make out the words from where you are, underwater, but it doesn't matter--you already know what they mean. And we have this feeling like the water motif here is about rebirth. Like an addict who has freed himself from the cycle, one you read about once, in a long novel that you really liked, laying in the water on the beach as the tide rolls in and out, in and out, in and then out again. And he just lays there.",
            "(If you can't tell, we're listening to it as we write this.)"
        ]
    }, {
        "song": "Keep It Up",
        "artist": "Niko Noki",
        "spotify_id": "0hluOHimkaXBe4s8yO990Z",
        "post_page": "2020-09-22",
        "description_lines": [
            "The only really lasting thing to come out of Cuties. Early on in the film, the protagonist discovers a group of 11-year-old dancers, and films them as they offer signature dances to this track. It's fun and benign--we actually remarked out loud \"this film seems totally benign!\" (Like Lars von Trier's <i>Antichrist</i>, though, things eventually take a very dark turn--the controversy, if a little over blown, is still somewhat warranted.) At any rate, this track is an original which was made for the film.",
            "It's a fun, bouncy, dance pop track. It sounds sort of like if the Spice Girls were around today as a Tik Tok group, and their music was a captcha. The strong back beats and crowded rhythms offer a lot of texture to dance against, which is probably why it was selected for the scene it was used in. That being said, it's not clear to us whether the track can stand on its own apart from the film. It feels a little dinky on its own, a little flimsy--sort of like Less than Jake's \"We're All Dudes.\" Infectious when you hear it along with the movie's characters, but lacking when you don't."
        ]
    }, {
        "song": "Bye Bye Bye",
        "artist": "Brian Robert Jones",
        "spotify_id": "6qZyIToSdYKFhf58IFK9GW",
        "post_page": "2020-09-22",
        "description_lines": [
            "Brian Robert Jones (of Vampire Weekend fame) is celebrating the 20th anniversary of NSYNC's <i>No Strings Attached</i> with a synth- and vocoder-heavy re-release of <i>the entire album</i>. The entire thing just dropped, but we haven't had time to make our way through all of it. (And, frankly, we're not as familiar with some of the non-hits on it.) \"Bye Bye Bye,\" however, works surprisingly well in this format. It's actually a lot more interesting than the original arrangement.",
            "This is better than as good as covers get. Most covers are just carbon copies of the original track you loved, but because they're not exactly the same as the song you loved in the first place, they feel degraded. Then there are covers that aren't particularly <i>good</i> but at least deserve credit for doing something wildly different. This is the rare cover that, as recognizable as the original is, doesn't feel like a cover. It feels like its own track. It's honestly hard to believe it isn't. It just works so damn well."
        ]
    }, {
        "song": null,
        "album": "Love in the Time of Email",
        "artist": "Antarctigo Vespucci",
        "spotify_id": "0fB20lk7IujnEMO26kFGHa",
        "post_page": "2020-09-22",
        "description_lines": [
            "Sometimes, you uncover a hidden gem. This is one of those times.",
            "First of all and right off of the bat--here's another inductee into our Names Hall of Fames. Could've gotten in on the band name alone, but that record name is just...exquisite.",
            "Now for the music. This is a fun, laid-back, non-threatening indie pop collection that captures elements of Matt and Kim, and Brandon Flowers' solo work. Maybe a touch of the whimsy of Weezer as well? At any rate, it's great. It shines. It glistens. It tastes a little like bubble gum in our mouth. Big league chew.",
            "The opener, \"Voicemail,\" is a surreptitious introduction, but the record really wakes up on \"Kimmy.\" On the third track, \"White Noise,\" the pre-chorus and chorus hand claps give the whole thing an almost throwback, sing-a-long '50s feel, but the trembling guitar interlude sends us forward to <i>Contra</i>-era Vampire Weekend. \"Breathless on DVD\" shimmers as well, and pokes fun at pseudocinephiles and their Jean-Paul Belmondo affectations.",
            "About halfway through the record, \"So Vivid!\" and \"Freakin' U Out\" turn up the fuzz and add a pop-punk edge to the album, as though these guys listened to the Larry Arms on the way to the studio that day or something. The rest of the record is, for the most part, a little quieter after that, until the outro, \"E-Mail,\" takes us back to where \"Voicemail\" kicked things off in the beginning.",
            "Solid cover art, too, by the way."
        ]
    }, {
        "song": "Ambrosia",
        "artist": "Rosie Tucker",
        "spotify_id": "17PBeLUldWC941sX8Ffmkd",
        "post_page": "2020-09-14",
        "description_lines": [
            "This is a neat little track by a pretty recent artist. It's got gloomy, underwater guitar chords which bubble beneath a crystal clear and front-foot-forward female vocal track. Its slow pace and occasional half-step movements are really nicely punctuated by little vocal licks that run back to the one (\"cover dish and chilllll for awhile\"). Those few moments really make the track, and you find yourself listening for them specifically on repeat takes.",
            "This one reminds us of another recent WMT entry, Frances Quinlan's \"Piltdown Man.\" (\"Six AM so loud your mom/HAD to kick us out.\") This week's WMT is short, so go ahead and re-visit that one while you're at it."
        ]
    }, {
        "song": "Pleasure Line",
        "artist": "Video Age",
        "spotify_id": "2XlQCGzPPXX7e8KA3pIBBT",
        "post_page": "2020-09-14",
        "description_lines": [
            "Video Age, indeed. From its opening moments, this track is squarely rooted in the kind of faux '80s nostalgia that started emerging ten years ago and hasn't quit since. It's got dreamy synth melodies, shifting sixteenth note hi-hat shimmies, and rubber band guitar chords that kick in with each chorus. It sounds like Hall and Oates meet Miguel Jackson with just the slightest sprinkle of vaporwave influence.",
            "For what it's worth, their guitarist looks like a cross between Danny Pudi and Adam Driver"
        ]
    }, {
        "song": "Lavender Boombox",
        "artist": "Miniature Tigers",
        "spotify_id": "04TOyd9HCUL8do2srcIyXY",
        "post_page": "2020-09-07",
        "description_lines": [
            "Between the dreamy saxophone and the cool, breathy, effortless vocals, there's a distinct Destroyer vibe to parts of this track. They collide really interestingly with the rest of the instrumentation, which has a sort of organic take on vaporwave, if we may. It's sort of like if Dan Bejar was making music in high school in like 2018. The consistent clap/snare sounds on the back half of each bar give the whole thing a real sense of momentum. The track rides on like that until just past the halfway mark when things go quiet and slow and fingerpicked, before coming back in with some vaguely Caribbean upstroked chords and a spicy sax solo."
        ]
    }, {
        "song": "Ruin (My Ride)",
        "artist": "Hovvdy",
        "spotify_id": "6JduePL4y2un1UAuTNSBHE",
        "post_page": "2020-09-07",
        "description_lines": [
            "This one is a little tricky to place. There are parts of it that remind us of <i>Blink-182</i>-era Blink-182 (think \"I Miss You\")--the distant vocals, the vaguely Tom DeLonge tinge to the vocals, the inorganic drum tracking--but there are also parts of it which feel very '90s rock. (Not that Blink-182 aren't themselves some form of '90s rock, but don't play dumb--you get what we mean.)",
            "Separately, we think that Hovvdy should open for Alvvays before a screening of <i>The Vvitch</i>."
        ]
    }, {
        "song": null,
        "album": "All or Nothing",
        "artist": "Mel*n",
        "spotify_id": "7nTPIgjFsBEUjkK1LGNTDE",
        "post_page": "2020-09-07",
        "description_lines": [
            "Want to feel authentic? Check out Mel*n. Here's an artist with 226 monthly listeners on Spotify. It doesn't get much more artisanal than that.",
            "The name comes from the artist's actual name, Mel Lynn, from Philadelphia. (Derek--do you know her? Did you guys torch cop cars together at Penn Charter?) Anyway, this is a monotone, shoegaze-y electronic record with some vague dance tones to it. The real standout is the eponymous \"All or Nothing.\" The song starts out with a nice enough vibe but not much to write home about--just a drowsy sad kinda chick who is, in the parlance of our times, \"all of us.\" It's not until the second verse passes and the chorus begins that things really turn up. We get a brief hiccup, and then a vaguely \"Strobe\"-like layer settles over the chorus and provides a nice bounce to the track. The other songs on this EP are all worth a listen as well. It doesn't jump out at you, necessarily, but we've found ourselves coming back to it all week.",
            "Separately, 2019's single \"Little More\" isn't half-bad, either."
        ]
    }, {
        "song": "new song d",
        "artist": "The Front Bottoms",
        "spotify_id": "5OrWjKjmlOehKTiSH9caKQ",
        "post_page": "2020-09-07",
        "description_lines": [
            "What more do we have to say? You already know what this is. The Front Bottoms have appeared here multiple times before (most notably, with \"Camouflage\"), and all of the things that landed them here before are landing them here again. The casual/frantic spoken-word verses, the driving drum tracks, and the lyrics. The real value in this track comes in its progressive bombast. It starts off solidly enough, but builds noticeably as it moves along. It doesn't reach the same heights as the aforementioned \"Camouflage,\" and there's an unnecessary pseudo-profound outro, but it's a worthy entry nonetheless."
        ]
    }, {
        "song": null,
        "album": "Set My Heart On Fire Immediately",
        "artist": "Perfume Genius",
        "spotify_id": "5qWrp5RcqjxB8ak7dtK6Iv",
        "post_page": "2020-09-07",
        "description_lines": [
            "Sam had tried to turn us on to Perfume Genius years ago but at the time it didn't stick. Now we're here to eat crow, because this latest release feels like it could be really special. (The record was released back in May but we're just now discovering it for ourselves.) We've only spent a couple of days with it and therefore only given it a few full listens, but we're really excited by how both familiar and new it feels at the same time. This is evident from the opening track, \"Whole Life.\" There's a classic, timeless element to the production--it reminds you of the shaky, quivery kind of pretty songs you hear in old movies--but it also manages to sound like nothing we've heard before.",
            "If we had to make comparisons, Grizzly Bear's <i>Veckatimest</i> (2009) would probably be up there for the same, shared polished ricketiness, but <i>Set My Heart On Fire Immediately</i> is a much more accessible album than <i>Veckatimest</i> (and much better for it). Also, other tracks feel much more modern and forward, like \"Describe,\" which feels almost like Beck meets The Flaming Lips? We're not quite sure about that, but this track is a hipster's slow-motion entrance dream. And things just keep evolving from there. \"Without You\" is a breezy evening ditty--you can almost (we said <i>almost</i>, okay?) hear a bossa nova underneath it--and \"On the Floor\" is actually, of all things, <i>shuffle</i>. Although we probably need a lot more time with this record before we can say more, that's a chunk of time we're really looking forward to putting in.",
            "This new/old conflagration is captured even in the album art. (First of all, how nice it is to see some aesthetically pleasant cover art? We feel like most cover art nowadays vaguely resembles a rainbow highlighter vomitus...) Hadreas, the eponymous genius himself, stares shirtlessly, knowingly, defiantly at the camera in a black/white contrast that somehow seems to simultaneously evoke Humphrey Bogart, our final look at Norman Bates in <i>Psycho</i> (1960), and Joaquin Phoenix's Arthur Fleck (<i>Joker</i>, 2019). The question on everyone's mind--does anyone make <i>albums</i> anymore--finally has an answer: yes."
        ]
    }, {
        "song": "detonate",
        "artist": "Charli XCX",
        "spotify_id": "1M6VHCglQ2PLWeAsyhgEUH",
        "post_page": "2020-08-31",
        "description_lines": [
            "Charli XCX is (are? is this a person? is this a band? is this a m--man? FLOCKA) like TikTok, in that she is super popular and we just generally aren't that familiar. We feel like we should become more familiar, though, because this isn't the first time one of her tracks has caught our attention and made its way onto this thread.",
            "This track is like a fun, light, super bubbly champagne. Part of that quality comes from the sound of the song itself--all of its rapid, moving, bubbling tones actually seem themselves to effervesce. Or maybe, given the adolescent feel of the whole thing, Pop Rocks would be a better comparison? Of course, like so many great tracks, form and content are exactly opposed: as light as the sounds are, the lyrics offer a different story.",
            "We are open to recommendations as to where to begin with this artist. We'd like to hear more."
        ]
    }, {
        "song": "Crimson and Clover",
        "artist": "A.G. Cook",
        "spotify_id": "3MBMKV1sWbwssL3MY5IqnA",
        "post_page": "2020-08-31",
        "description_lines": [
            "We've come across A.G. Cook before, but always in collaboration, either with Hannah Diamond (see below) or 100 gecs. This is a solo effort off of a recent LP, and we really like it. It almost sounds like another collaboration, only this time, with Lou Reed and the Velvet Underground (and maybe a touch of Contra-era Vampire Weekend thrown in for good measure). At least, that's how the verses sound. As you'll see if you take a listen, the bridges move off into a different direction before returning to the sweet, lazy verse that makes this whole thing work. And about halfway through, we get an interesting slowdown in which things seem to flip: the drums become organic, while the vocals are filtered through a very present vocoder.",
            "There's probably a version of this song that works as a bigger banger in some alternative multiverse reality, but we're pretty into this version nonetheless."
        ]
    }, {
        "song": "Hologram",
        "artist": "Tacocat",
        "spotify_id": "29J86Fn14T8BB93kNW43eU",
        "post_page": "2020-08-24",
        "description_lines": [
            "Kicking off a relatively short list this week is \"Hologram\" by Tacocat. We've never really listened to Tacocat before, but apparently they're a well-established Subpop outlet from Seattle (RIP). This track is a catchy pop-punk sing-along that sounds like a cross between Courtney Barnett and The Thermals. It's summery--we recommend listening to it while standing up shotgun-side in a slow-motion convertible."
        ]
    }, {
        "song": "It's Gonna Be Okay, Baby",
        "artist": "MUNA",
        "spotify_id": "5lH5KTgUiP5CSjGctZusTQ",
        "post_page": "2020-08-24",
        "description_lines": [
            "It's hard to ignore a song that opens with lines like \"You're gonna move to New York/and experiment with communism/Go down on a girl/after reading her some Frantz Fanon.\" (It's a little hard to imagine <i>Fanon</i> getting anyone--except for maybe sadomasochists?--in the mood, but the point is well taken nonetheless.) This one, which sounds like pronoun meets Miel, is not nearly so summery as the above entry. It's more of a rainy day, in your feelings, meaningful cafe vibe.",
            "A quick glimpse at the group's Spotify page reveals that it's not one of their bigger songs. Those honors would go to \"Bodies,\" \"Number One Fan,\" and \"I Know a Place.\" A single listen of each reveals that they're all worth your time as well, although we don't have time to discuss them fully here."
        ]
    }, {
        "song": "Valentine",
        "artist": "Lala Lala, Grapetooth",
        "spotify_id": "6DzjAbFIAvE8kXoo64JzBK",
        "post_page": "2020-08-24",
        "description_lines": [
            "This track comes as a collaboration. It's got a little bit of a New Wave, shoegaze feel to it, but with an almost reverent synth background that kind of evokes the backing to the chorus of \"Love My Way\" by the Psychedelic Furs (which is, of course, included on the <i>Call Me By Your Name</i> soundtrack). Two of the members of Grapetooth actually belong to the band Twin Peaks, who we've featured here before as well."
        ]
    }, {
        "song": null,
        "album": "Welcome to Conceptual Beach",
        "artist": "Young Jesus",
        "spotify_id": "76nK69DufkCMk1v8kkmSA5",
        "post_page": "2020-08-17",
        "description_lines": [
            "Young Jesus have appeared on the WMT before, but never before like this. This past Friday saw the release of the band's fourth studio and fifth overall record, Welcome to Conceptual Beach, and you can go ahead and both induct that into the Names Hall of Fames *and* call it truth in advertising. It's an artsy record, for sure, but one which ends up being more accessible than it seems. We've heard it described as a mix of Sigur Ros, Neutral Milk Hotel, and Dave Matthews Band, which is accurate but incomplete. For good measure, we'd also throw in Wild Beasts, Destroyer, and a host of other acts as well.",
            "The record does meander at times, and it will take a few more listens to tell whether or not it sticks as a total overall effort. That being said, there are a couple of serious stand-outs. The closer, \"Magicians,\" for instance, shows off a stuttering, schizophrenic alternation between a pleasant, structured sort of verse and long, unstructured, understated solo efforts in a way that kind of recalls The Velvet Underground's \"Heroin\" (a great, great track on its own, in case you're not familiar). It feels a little bit gratuitous at first until everything comes together in the third act.",
            "By far the best track off of the record, however, is \"(un)knowing.\" This is the stand-out, the \"put it on repeat and sing along\" anthem. The song is essentially split into two mirror-image halves. The first half, with its alternative guitar tuning and clean acoustic sounds, is almost reminiscent at times of mid '90s radio rock, but the second half is where things really come alive. Everything becomes distorted, muddled, electrified, and the lyrics reach a max meaningfulness level. By the time John Rossiter is wailing \"Oh God and Mary, Jesus Christ/won't bless me for my every vice,\" so are we, and even if we don't know exactly what he means, we know exactly what he means. This is Young Jesus at their most NMH, and it's really, really good.",
            "We recommend starting off with \"(un)knowing,\" and then trying out the record as a whole from there."
        ]
    }, {
        "song": "Boomer",
        "artist": "Bartees Strange",
        "spotify_id": "2WahhszjFFN9qLK3G2ihZL",
        "post_page": "2020-08-17",
        "description_lines": [
            "Last week, we brought you an introduction to Bartees Strange, with his excellent \"Mustang.\" This week, Strange has another new track out, called \"Boomer.\" It's equally interesting if a somewhat different vibe--sort of like if Kid Cudi made garage rock with the children of The National and The Killers? We're not sure how much that description is going to hold up, but if you liked the first effort from Strange, you'll like this one, too."
        ]
    }, {
        "song": "x",
        "artist": "x",
        "spotify_id": "x",
        "post_page": "x",
        "description_lines": [
            "x",
            "x"
        ]
    }, {
        "song": "x",
        "artist": "x",
        "spotify_id": "x",
        "post_page": "x",
        "description_lines": [
            "x",
            "x"
        ]
    }, {
        "song": "x",
        "artist": "x",
        "spotify_id": "x",
        "post_page": "x",
        "description_lines": [
            "x",
            "x"
        ]
    }, {
        "song": "x",
        "artist": "x",
        "spotify_id": "x",
        "post_page": "x",
        "description_lines": [
            "x",
            "x"
        ]
    }, {
        "song": "x",
        "artist": "x",
        "spotify_id": "x",
        "post_page": "x",
        "description_lines": [
            "x",
            "x"
        ]
    }
]
