[
	{
        "song": "A Forest",
        "artist": "The Cure",
        "spotify_id": "3O4TPMOgChXOerSdB5WENH",
        "post_page": "2020-11-26",
        "description_lines": [
            "Hey guys come on The Cure is awesome, please tell me I am cool for liking it. Let's talk about our feelings, or let's just listen to The Cure tell us about their feelings in this number 12 hit single.",
            "This is my second paragraph about this stupid ass emo song. I love that shit though so you can suck it if you don't. How's that for a blog?"
        ]
    }, {
        "song": "Take on Me",
        "artist": "a-ha",
        "spotify_id": "2WfaOiMkCvy7F5fcp2zZ8L",
        "post_page": "2020-11-26",
        "description_lines": [
            "Woo hoo my second post now i need more text, I am jus going to repeat myself cuz I am bored. Woo hoo more text, I am jus going to repeat myself cuz I am bored. Woo hoo more text, I am jus going to repeat myself cuz I am bored. ",
            "This is my second paragraph about this stupid ass emo song. Woo hoo more text, I am jus going to repeat myself cuz I am bored. Woo hoo more text, I am jus going to repeat myself cuz I am bored. End of second paragraph for second post",
            "And here is a third line! I can print as many desc lines as you give me! <i>Here is some italic. </i><b>Here is some bold</b> - but really you shouldn't use i/b tags, you should use <a href='https://stackoverflow.com/questions/38205797/how-to-combine-bold-and-italic-in-css/38205861'>CSS classes</a>  instead!"
        ]
    }, {
        "song": "My Unknown Song",
        "artist": "Ale Alejandro",
        "post_page": "2020-11-26",
        "description_lines": [
            "Nothin much to say, this song isn't real.",
            "Notice how I did not print a spotify embed link cuz this one don't got one in the json!",
            "I know its big, but I didn't pull it out for air.."
        ]
    }, {
        "song": "Some other song",
        "artist": "Some other band",
        "spotify_id": "xxxx",
        "post_page": "2020-12-01",
        "description_lines": [
            "Woo hoo my third post but this shouldn't display with the first two posts because this is for a different date! now i need more text, I am jus going to repeat myself cuz I am bored. Woo hoo more text, I am jus going to repeat myself cuz I am bored. Woo hoo more text, I am jus going to repeat myself cuz I am bored. ",
            "This is my second paragraph about nothing. Woo hoo more text, I am jus going to repeat myself cuz I am bored. Woo hoo more text, I am jus going to repeat myself cuz I am bored. End of second paragraph for third post"
        ]
    }   {
        "song": "What Are Friends For?",
        "artist": "The Sonder Bombs",
        "spotify_id": "64F2l136oePmUwOG9zB1vU",
        "post_page": "2020-11-30",
        "description_lines": [
            "Speaking of pop punk, check out this track by The Sonder Bombs. (Fun fact from the band's website: \"sonder\" itself is a noun which apparently stands for the feeling that comes with the realization that all of the strangers around you are living lives as rich and meaningful--not necessarily in a good way--as yours.) This is fun, energetic, sad chick pop punk that sounds like a threesome between Beach Bunny (aka Coastal Rabbits), Sincere Engineer (aka Heartfelt Architect), and Snarls (good luck on that one), all of whom have graced places atop the WMT in weeks past.",
            "Our one minor complaint with this one is that we think it might've been better served by a more lo-fi approach. It feels a little produced at times, but is nevertheless highly listenable and seems to possess a strange power over the \"repeat\" button."
        ]
    }   {
        "song": "What Year Are We In",
        "artist": "Kitten",
        "spotify_id": "1jkCLNfGQJgymKExs4MGZs",
        "post_page": "2020-11-30",
        "description_lines": [
            "Kitten are stars of the WMT. \"Memphis\" (not to mention its acoustic follow-up) remains one of the best and most infectious songs we've ever had the privilege to cover, and the group took a turn towards <i>la resistance</i> with the COVID-era herd immunity anthem \"My House.\" (The cover art to that single depicted a nude demented looking version of the group's lead singer stuffed into a miniature-sized house and the lyrics explained  that \"I'm watchin the world freakin out from my couch/Don't know what they're talkin about in my house/I wanna have fun again, I wanna go out/But they told me to stay in my house.\") Now, Kitten continue their turn toward far-right extremism with another banger entitled \"What Year Are We In,\" which talks about the hopeless nature of protests, Zoom parties, and getting pissed off over conspiracy theories.",
            "As far as the sound, it's got a bounce to it. There are some synthy keys and horns, not to mention a drum machine, that make the whole thing sound like an updated '80s throwback, which fits in well with the name and theme. There are other parts of the track that remind one of Madness (and, of course, \"[Their] House\"). In the end, one of the things that really interests us about Kitten is that, of the four tracks of theirs which have made it onto the WMT, they're all bangers, but they all sound totally different"
        ]
    }   {
        "song": "Hurt Me Now",
        "artist": "ASL",
        "spotify_id": "6tDrZQQhEWrHsYafpziiwg",
        "post_page": "2020-11-30",
        "description_lines": [
            "a/s/l? (only kids from the '90s will get it!!!)",
            "Anyway, we stumbled across this track, from a group that seems only to have been making music since about 2018, over the course of this past week. It should be kind of a mess of a track, with lots of heavy synth, drum machines, tons of reverb, misplaced horns, and a borderline hip hop/spoken word chorus, but all of it comes together in a surprisingly pleasant way. This isn't a banger--it's not one that's going to carry you away immediately. It's got the vibes of Robbi Robb's \"In Time\" but without the power and meaningfulness. But if Blood Orange's \"Time Will Tell\" is the perfect track for a postgame a deux, then \"Hurt Me Now\" might work best for its melancholy solo equivalent."
        ]
    }
]
