[    
    {
        "song": "hospital",
        "artist": "Ellis",
        "spotify_id": "4UzvLVnjwss4kBEMljLSNn",
        "post_page": "2021-05-11",
        "image": "ellis_hospital.jpeg",
        "description_lines": [
        "Ellis has appeared on the WMT before with tracks \"All This Time\" and \"Fall Apart.\" Those two tracks were pretty different, however, and now \"hospital\" makes three.",
        "The track kicks off with a sleepy, faraway, telephoned-in intro that opens up eventually in full volume, like speaking to someone on the telephone before opening the door to find (and hear) them speaking right in front of your face. \"hospital\" reminds us of something, but we can't quite put our fingers on it. It's an ambling, glistening, dream-like, pretty little thing, and a definite play-on-repeat candidate. We'll leave things there for now."
        ]
    },    {
        "song": "Black Maps",
        "artist": "Mint Julep",
        "spotify_id": "61OropGB1h5bLzZznmKgvv",
        "post_page": "2021-05-11",
        "image": "blackmaps_mintjulep.jpg",
        "description_lines": [
        "This is the first appearance for husband-and-wife duo Mint Julep on the WMT. Last month, MJ released their new record, In a Deep & Dreamless Sleep, which opens with \"Black Maps.\"",
        "A track which recalls the sounds of Washed Out's 2009 EP, <i>Life of Leisure</i>, \"Black Maps\" ebbs and flows over a rhythmic, thrumming bass line and synthetic waves of sound. Even lead Hollie Kenniff's voice is a reminder of Ernest Greene's distant, calling vocals on <i>Life of Leisure</i>'s \"New Theory.\" With summer just around the bend, this is one to queue up for days of drinking and lounging in the moneyed sun."
        ]
    },    {
        "song": "I WANNA DIE BUT I CAN'T (CUZ I GOTTA KEEP LIVING)",
        "artist": "PRONOUN",
        "spotify_id": "0lcwE4dOsg3HB2BiUJxurh",
        "post_page": "2021-05-11",
        "image": "pronoun_iwannadiebuticant.jpg",
        "description_lines": [
        "Over a year ago, we brought you pronoun's <i>i'll show you stronger</i>. We spent a lot of time with that record, and especially with what we saw as the standout track, \"stay.\" Well, now pronoun are back with new single \"I WANNA DIE BUT I CAN'T (CUZ I GOTTA KEEP LIVING).\"",
        "We're not sure if the move from exclusive lower case to exclusive upper signifies something, but it sure feels like it does. Gone is the mutedness of <i>i'll show you stronger</i>. The tones are brighter here, the sounds cleaner, the vocals much more forward and distortion/reverb-free. Now, that being said, the somehow simultaneously blase and energetic frustration means that this track is still decidedly pronoun"
        ]
    },    {
        "song": null,
        "album": "Inbred",
        "artist": "Ethel Cain",
        "spotify_id": "1Q4UcRCYPn6u0pNHioOYjs",
        "post_page": "2021-04-26",
        "image": "ethelcain_inbred.jpg",
        "description_lines": [
        "You had to know this was coming. ",
        "We’ve been all about Ethel Cain ever since we discovered 2019’s Golden Age earlier this year, and “Crush” took us by storm just a couple of weeks ago. (We have introduced that track to just about everybody we know since then, by the way, and not a single person has responded with anything less than the same exact sort of obsession.)",
        "Well, Inbred is finally here. <a href=\"https://weeklymusicthread.com/ethelcain_inbred.php\">Click here to read the full review</a>"
        ]
    },    {
        "song": null,
        "album": "Nurture",
        "artist": "Porter Robinson",
        "spotify_id": "4Hjqdhj5rh816i1dfcUEaM",
        "post_page": "2021-04-26",
        "image": "porterrobinson_nurture.jpg",
        "description_lines": [
        "This past Friday, the Chapel Hill-based music producer released his sophomore album, <i>Nurture</i>. A full seven years after debut <i>Worlds</i>, <i>Nurture</i> was long awaited by Robinson’s fans, and the internet has been aflame with excitement since it dropped. To be honest, Robinson really was not on our radar at all, and we’re not sure how much we really have to add to the conversation. We’re coming at this album from outside of its scene; on top of that, it’s a long record—nearly an hour in runtime—and we’ve only had a few listens through since it dropped on Friday night (our time). So we’ll offer some initial thoughts here, and we’ll leave the rest either for some other point in time, or for some other writer.",
        "The entire album is, more or less, arresting. The brief opening track—“Lifelike”—blends atmospheric electronic music, bleeps and bloops, with organic(-sounding?) piano and strings to create a truly beautiful introduction to the sort of mélange that listeners will encounter throughout the rest of the record. Porter Robinson cites the Japanese composer Masakatsu Takagi as an influence, and you can really hear parts of his <i>Wolf Children</i> OST informing that piano melody. Quickly, though, the piano gives way to strings, and we’re reminded of the soundtrack to another unique and moving piece of work: Brit Marling’s “The OA.” Needless to say, any record that opens with something that reminds us of “The OA” has our attention. ",
        "Following “Lifelike” is “Look at the Sky.” Lest you thought that Nurture might be all slow introspection, Robinson follows up that 90-second introduction with a certifiable banger. That’s not to say, however, that “Look at the Sky” itself is any less moving. “Something must have changed in me,” the lyrics go, and they’re delivered with such an impersonal, incredulous distance that you think to yourself, “yeah, something <b>did</b> change in me.” That sort of resonance comes in ten-fold during the chorus. “Look at the sky/I’m still here/I’ll be alive next year.” The song builds and builds over the course of the next several minutes, until eventually it starts to decay in the opposite direction. As it does, we become less and less convinced that the narrator is still there, or that they’ll be alive next year.",
        "Other certifiable bangers include “Musician,” which is probably the leading “play-on-repeat” candidate off of <i>Nurture</i>. (And, trust us, that isn’t a short list.) The song feels like an explosive intersection of Baths, Katie Dey, Pearly Drops, ELIO, and “Digital Love”-wave Daft Punk. Two tracks later, “Mother” is another entry into dreamy, detached emotional synth pop. In some ways, it’s similar to the Pink Floyd track of the same name—a gorgeous and (we imagine) lasting take on a mother-son relationship. In others—like, for instance, the <i>quality</i> of that relationship—it’s the exact opposite of the Floyd track.",
        "Like we said, it’s a long record, and it’s a little out of our wheelhouse, so we’ll stop there for now. But this one feels like a candidate for year end lists. What a year it’s been already, what with releases from Ethel Cain, Harmony Woods, and now Porter Robinson, all threatening to decide the year’s best records before we’re even halfway through."
        ]
    },     {
        "song": "Monsters",
        "artist": ["Hit Like a Girl", "Bartees Strange"],
        "spotify_id": "5DmoVa9EhEpyBZd4m7OUO8",
        "post_page": "2021-04-19",
        "image": "hitlikeagirl_monsters.jpg",
        "description_lines": [
        "With “Goldbug Champignon,” Strange proved he could forge catchy, melancholy collaborations that are worthy of playing on repeat for weeks. With “Monsters,” the second track off of Hit Like a Girl’s recently released <i>Heart Racer</i>, Strange does it again. ",
        "Honestly, “Monsters” is a hit from its opening moments. The lonely lead guitar part and wandering, half-time percussion set the stage perfectly for lead singer Nicolle Maroulis’ Alphaville-wave vocals to kick in. “I can’t believe it’s December again,” she croons, “I feel like I have never left my bed.” (And we’re not kidding about the Alphaville thing, either: something between the vocals and the drums really remind us of “Forever Young” every time we listen to this track.) Finishing out the first verse, Maroulis describes a sense of ennui that would have been at home on The National’s <i>High Violet</i>. “All my friends are moving on/And making something of themselves/While I’m always getting left behind I am/Wishing all of them well.” ",
        "From there, the lost, electronic drums give way to coordinated waves of organic snares and cymbals, and the song crests into its chorus. “I haven’t been myself these days/And my friends are starting to notice,” Maroulis sings. “I’ve just been feeling so broken/And my eyes are losing focus.” Immediately, we recede back into the verse—but not entirely. Things are different. Yes, we return to the original drum rhythm, but not to the electronics—we lose those altogether. This gives the song a sense of progress, as does the appearance of Strange on vocals. “Another night spent tossing and turning/Pacing around my house, waiting until the morning/Do I have to go to work with these bags under my eyes,” he asks. “Just put on some make-up,” Maroulis answers. “And pretend I’m doing just fine.” The duet works well. Maroulis’ crystal clear voice slides nicely against the rougher, muted texture of Strange’s, and the presence of a second singer gives our forlorn narrator(s) a much-needed flicker of company in lonely solitude.",
        "The rest of the track is a certified banger: sixteenth-note hi-hat licks here and there, and the recurring, syncopated full-band follow-up to fill-ins at the end of phrases make it impossible not to nod along and smirk to yourself in a sort of knowing agreement. Honestly, if it weren’t for the next entry on this week’s WMT, this probably would have been the only song we listened to all week. It never gets old."
        ]
    },    {
        "song": null,
        "album": "GRACEFUL RAGE",
        "artist": "Harmony Woods",
        "spotify_id": "0B4WZ04NHPE4Hb4Ei0WJbG",
        "post_page": "2021-04-19",
        "image": "harmonywoods_gracefulrage.jpg",
        "description_lines": [
        "GRACEFUL RAGE is the kind of record that holds immediate promise. From the beautiful, melancholy opening acoustic guitar lick to “Good Luck Rd.,” GRACEFUL RAGE grabs your attention, and suggests to you that it could be one of those kinds of records: the kinds of records that you hope for, that you wait for, and that, once you’ve finally found them, you listen to over and over and try to get your friends to do the same.",
        "Since this is an extended review of the album, we felt it deserved its own post. <a href=\"https://weeklymusicthread.com/harmonywoods_gracefulrage.php\">Click here to read the full review</a>"
        ]
    },    {
        "song": "Stupid Boys",
        "artist": "Bleached",
        "spotify_id": "3VVTR5byzYX15kSLhENnVN",
        "post_page": "2021-04-12",
        "image": "bleached_stupidboys.jpg",
        "description_lines": [
        "Sometimes things are exactly the way that they seem, and that’s the way it is with 2020’s “Stupid Boys.” The track comes from artist Bleached, formed in 2011 by sisters Jessie and Jennifer Clavin. Formerly of Mika Miko, the sisters Clavin started off by making lo-fi punk recordings that could have shared the stage at CBGB with ‘70s punk acts like The Ramones and Dead Milkmen. Seriously, their earlier stuff actually sounds like it was recorded decades ago, and we mean that in the very best way.",
        "“Stupid Boys” is something completely different. From its opening moments, we’re made aware that the tinny, charming, underwater sound of those early lo-fi recordings is gone, and we’ve since relocated to the land of higher production qualities. “Stupid boys with broken hearts,” we hear in a staccato, a cappella chant before the rest of the band kicks in. Instantly, the song is a banger, and it’s impossible to imagine listening to this one without moving your head and/or feet. It is, in other words, positively infectious. In that way, it almost has the same quality as the Ting Tings’ “That’s Not My Name.”—you get the point from the opening bars, and if there’s a brain in your head, you’re fully on board. Whereas the Ting Tings track comes off as grating to some (not us) people, however, we can’t imagine anyone rejecting “Stupid Boys.” Given its sunny, liberated feeling, moreover, we anticipate that we’ll spin it that much more when the sun comes out and the weather heats up."
        ]
    },    {
        "song": "When You Were Made",
        "artist": "The Growlers",
        "spotify_id": "47WtMNT8S9n3eqsCn076Bf",
        "post_page": "2021-04-12",
        "image": "thegrowlers_whenyouweremade.jpg",
        "description_lines": [
        "This week, we’ve also discovered The Growlers. Around since 2006, these California-based cats have put out a whole slew of records, none of which we have yet had time to explore. “When You Were Made” comes from 2016’s <i>City Club</i>. In particular, this track sounds a bit like a vaguely southwestern cross between The Wallflowers’ “One Headlight,” early, <i>Hot Fuss</i>-era Killers, and The Strokes. (Indeed, that last comparison shouldn’t be surprising—the track and the rest of <i>City Club</i> were produced by The Strokes’ own Julian Casablancas.)"
        ]
    },    {
        "song": "Object Permanence",
        "artist": "Sydney Sprague",
        "spotify_id": "7GOXzZvQKdNzvPI1JnCq40",
        "post_page": "2021-04-12",
        "image": "sydneysprague_objectpermanence.jpg",
        "description_lines": [
        "Sydney Sprague is a new act—with releases dating back to only 2020 and just 15,000 monthly listeners on Spotify—but the 29-year-old Phoenician is already making confident, competent music that feels wise and accomplished beyond her years.",
        "Recently, Sprague released her debut album, <i>maybe I will see you at the end of the world</i>, which features acclaimed singles “i refuse to die” and “steve.” Before you make it to those two tracks, however, you’ll come across “object permanence,” which, to us, is the true standout off of <i>maybe I will see you at the end of the world</i>.",
        "“object permanence” opens with a thrumming, ‘90s bass line before immediately unfolding itself a little bit with a twangy, reverb-y lead electric guitar part. The drums soon follow, as does Sprague, with a line that introduces the listener to the thematic approach of the rest of the song: “I get lonely but I/I get used to it I,” Sprague sings. Later, she’ll up the ante at the beginning of the second verse: “When I think of you I/I get angry and I/I see couples in love/I hope they die.” Where the first verse is passive and resigned, then, the second becomes more active, almost like the chorus that the verses lead into. The drums switch from a simple rock beat to a quarter note snare and bass drum pattern, and eventually Sprague wonders out loud, “is object permanence real?”",
        "We can’t quite put our finger on it, but there is something so ‘90s about this song. A quick look at Sprague’s Spotify “About” page confirms we’re on the right track: “backed by familiar-yet-surprising hooks and hard-hitting, topical lyrics, sprague’s songwriting continues to evolve,” the bio reads. “with eyes on contemporaries like her ‘90s idols, notably avril lavigne, she flawlessly carries that same fire, creativity, and wit into her 2021 release.” There’s definitely a little Avril Lavigne here, and we feel like we hear tones of a more subdued Alanis Morissette or a chippier Indigo Girls—maybe like a mix of all three. At any rate, we think that listeners who grew up with this sort of music playing on the radio everywhere they went will find a lot to like in “object permanence,” and in the rest of <i>maybe I will see you at the end of the world</i> as well. " 
        ]
    },    {
        "song": "4 American Dollars",
        "artist": "U.S. Girls",
        "spotify_id": "4yKvIwTl5ATNa17NOobHqh",
        "post_page": "2021-04-12",
        "image": "usgirls_4americandollars.jpg",
        "description_lines": [
        "U.S. Girls, the brainchild of Meghan Remy, have been around for a while. In 2020, Remy and the rest of the Girls put out their seventh studio album, <i>Heavy Light</i>, which starts off with the striking opener “4 American Dollars.” Even from the opening bars, we know we’re in for something special. From the bent bass note that slides us from silence into the song to the whiny synth lead melody to the bongos and congas that beat in the background, we feel like we’ve just traveled several decades backwards in time. (Specifically, we feel like we’re smackdab in the middle of a collision between Motown and Disco.) “Shade tassels/shake your ass,” the lyrics go. “We all do what we gotta do to pass/In this world where they say/It’s not personal it’s business.” The rest of the song rolls on like that. It’s strange: lyrically, it’s an indictment of capitalism and grotesque wealth, but the coolness of the tune somehow gives the subject material an almost celebratory vibe.",
        "Make no mistakes, though. As cool as money may seem, U.S. Girls aren’t impressed. “I don’t believe in pennies and nickels and dimes and dollars and pesos and pounds and rupees and yen and rubles no dinero,” the song vamps over and over. Or maybe it’s just fiat money that they oppose, and “4 American Dollars” is actually their gold standard anthem. U.S. Girls? More like U.S. Goldbugs!"
        ]
    },    {
        "song": "My Friends Online",
        "artist": "ELIO",
        "spotify_id": "64RnefzM0iBMHyDDzU2GbZ",
        "post_page": "2021-04-05",
        "image": "elio_myfriendsonline.jpg",
        "description_lines": [
        "When we hear the name Elio, the first thing we think is that it’s the name of Timothee Chalamet’s character from <i>Call Me By Your Name</i>. The second thing we think is that it might also be the name of actor/cannibal/persiciphage Armie Hammer’s character from <i>Call Me By Your Name</i>, if indeed we are in the habit of calling one another by one another’s name. And now that we’ve discovered ELIO, the third thing that we think is that it’s also the stage name for 23-year-old Welsh artist Charlotte Grace Victoria.",
        "ELIO (who, in her biopic, should <i>clearly</i> be played by Anna Paquin) debuted last summer with her EP u and me, but mostly me. Hers is a brand of fragmented bedroom dream pop which speaks to the alienation and loneliness of a generation raised on the ever-present façade of connection in our disconnected and battery-depleted digital epoch. It’s a little if like Charli XCX reinterpreted <i>OK Computer</i> and <i>Kid A</i>-era Radioguts. ",
        "That’s not in terms of <i>sound</i>, so much, but in atmosphere. Although, as far as sound goes, you can do worse than Charli XCX as far as artist comparisons go. “My Friends Online,” for instance, employs a lot of the same glitchy, fluctuating, scattered-sounding as songs such as Charli XCX’s “Detonate,” albeit to a more melancholy effect. It remains us of an intersection between a Charli XCX track and recent WMT first-timer Pearly Drops’ “Final Form.” We feel that the lyrics are worth printing in their entirety here:",
        "<div style=\"padding-left: 3em\"><i>My social life is blinding<br>Feels like I never get the call<br>One post for the right timing<br>I swear I’ve seen her face before<br>I’m socially exhausted<br>But haven’t looked up from my phone<br>I swear I think I’m dying<br>Here’s hoping I don’t die alone<br><br>I just want my friends online<br>To be around me when I die</i></div>",
        "Maybe it’s the heavy, fuzzy synth that sits like a soft bedroom carpet beneath the track, or maybe it’s the subtle, shimmering ringtones that cascade from time to time throughout the background, but ELIO succeeds in making what might seem like narrow lyrics feel tragic, timeless—elegiac, even. So when it all becomes too much—when the simulation finally overtakes you—play this one on repeat."
        ]
    },    {
        "song": "Out of Reach",
        "artist": "Sincere Engineer",
        "spotify_id": "08iWorHkXSK4MxpG0aHXnP",
        "post_page": "2021-04-05",
        "image": "sincereengineer_outofreach.jpg",
        "description_lines": [
        "Sincere Engineer are a recent discovery for us. It hasn’t been long since we were raving, several years behind the times, about 2017’s <i>Rhombithian</i>. A shockingly mature, original, and confident debut, <i>Rhombithian</i> boasted instant bangers like “Corn Dog Sonnet No. 7” and “Overbite” which have kept it in a weekly—if not <i>daily</i>—rotation for us since we first discovered it several months ago. Since then, SE have also released the 2020 single “Trust Me,” which we covered as well.",
        "Well, now, Sincere Engineer—the now full band project of Chicago punk up-start Deanna Belos—are out with another single, “Out of Reach.” The song opens with the same thick, chewy sort of bass line that we remember from <i>Rhombithian</i> as Belos eases into her signature sort of small and intimate storytelling: “Sitting out on the back steps/you let out a big breath/with lingering smoke from your last cigarette.” Shortly thereafter, the full band comes in, and Belos’ words stay equally close while also taking on a grander significance. In a line that could have been written by fellow Chicago punk pioneer Matt Skiba himself, Belos sings “I watch the weather on TV/I watch the green on the screen cover up this stupid fucking city.”",
        "Eventually, the song switches into double time for the second verse, before slowing back down into that sweet, meteorologically themed chorus. “Out of Reach” doesn’t have quite the same vim or vigor to it as many of the <i>Rhombithian</i>-era tracks do—it’s softer, slower, more contemplative. It’s the sound of the songwriter in Belos becoming more reflective, perhaps, or introspective. It shows a touch of restraint which was (rightfully) lacking on <i>Rhombithian</i>. Belos is no longer the young kid who at times on that record screamed directly at us about her youthful insecurities; instead, she’s learning now to get at them obliquely. “I remember it was warm then,” she sings on “Out of Reach,” “now it’s cold.” And you know what she means.",
        "Maybe it’s the fact that we were raised on other Chicago punk acts like early Alkaline Trio and the Lawrence Arms, but we feel pretty confident in saying that Sincere Engineer are one of our favorite groups out there right now, and we’re eager to hear whatever else they’ll be putting out in the future. (And, by the way, we’re not sure how Belos pronounces her last name, but if it’s anything like the word <i>bellows</i>, well, then, it’s apropos.)"
        ]
    },    {
        "song": "When U Call My Name",
        "artist": "DOGBRETH",
        "spotify_id": "0yTkoz7AskXKaOQQZoODd8",
        "post_page": "2021-04-05",
        "image": "dogbreth_whenucallmyname.jpeg",
        "description_lines": [
        "This track, “When U Call My Name,” marks our first encounter with the enigmatic DOGBRETH. A power-pop project from Arizona-based songwriter Tristan Jemsek, the group have been around for some years, and “When U Call My Name” comes to us off of 2019’s <i>Ever Loving</i>. ",
        "From the get-go, “When U Call My Name” rocks like a surf pop soundtrack for a soft reboot of “That Thing You Do” set in sunny California, or something. Although it’s got the same beachy sort of energy as late aughties outfits like Girls or maybe Wavves, it leaves out the lo-fi recording quality that was so specifically emblematic of those acts and of that era. The result is something that is utterly infectious and completely listenable, and should be played on repeat under the sun and behind a pair of Wayfarers."
        ]
    },    {
        "song": "Archie, Marry Me",
        "artist": "Flyte",
        "spotify_id": "0rcwROyUguj5RQa5pPKajI",
        "post_page": "2021-03-22",
        "image": "flyte_archiemarryme.jpg",
        "description_lines": [
        "Originally, “Archie, Marry Me” exploded into the world by way of the Canadian indie rock group Alvvays way back in 2013. (Which, Jesus Christ, how is it possible that this song came out almost ten years ago?) Since then, it’s been covered by, like, <i>everyone</i>. (Seriously: Ben Gibbard, Fourteener, Good Luck with Everything, and Savanna Brooke Jones.)",
        "Well, at any rate, we’ve found another one to cover. This one comes via Flyte’s 2017 album <i>The Loved Ones</i> and, like all great covers, it reinterprets the original to bring out of it something we didn’t even know it had. This arrangement, which is largely chorale, tends both toward growth and stasis, changes and doesn’t, in a way that’s reminiscent of Bon Iver’s “Woods.” It’s the simplicity that really does it: the long, held notes and the bare nudity of the track really bring out the momentary sense of rapture (“heeey, heeeeey”) that made the original so great.",
        "Give this one a spin. Preferably loud, via headphones, lying alone in bed in the dark. At first, it won’t seem like much, but by the end—well, by the end, it will. "
        ]
    },    {
        "song": "Johnnie and Jonnie",
        "artist": "Twin Shadow",
        "spotify_id": "682pVIYG5WT39UktvX1NwS",
        "post_page": "2021-03-22",
        "image": "twinshadow_johnnieandjonnie.jpg",
        "description_lines": [
        "We’ve been bumping Twin Shadow since our college days, and 2018’s “Brace”—a clever, oblique take on Tom Petty’s “Free Fallin’”—was a personal favorite for us. Well, recently, Twin Shadow put out “Johnnie and Jonnie,” which sounds sort of like he packed up all his gear and starting making music from a beach resort somewhere. Gone are the familiar New Wave and R&B trappings of the artist’s earlier work. This one sounds instead like Neon Indian’s take on “Rudie Can’t Fail” by The Clash, with a chorus that reminds us a lot of Brandon Flowers’ “Still Want You.”",
        "Which, we mean, if that doesn’t get you to listen to a track, nothing will."
        ]
    },    {
        "song": "I Wanna Help Your Mind",
        "artist": "Goth Babe",
        "spotify_id": "08ZZ7SILfKcreLtA3K6Gqr",
        "post_page": "2021-03-22",
        "image": "gothbabe_iwannahelpyourmind.jpeg",
        "description_lines": [
        "Speaking of Neon Indian, this new Goth Babe track also has some serious NI/Washed Out vibes going for it. It’s a light-hearted, stringy, synthy romp that wouldn’t be out of place with a beer in hand on a sunlit patio. It’s sort of like a hot dog: it’s probably not the most balanced nutritional intake you’re going to come across. It’s not, like, going to sustain you. But it tastes really, really good in the right setting. This one’s gonna come in handy as the weather warms up."
        ]
    },    {
        "song": "Crush",
        "artist": "Ethel Caine",
        "spotify_id": "5bwLs2TUxldWW6ZGOI9Zx6",
        "post_page": "2021-03-22",
        "image": "ethelcaine_crush.jpg",
        "description_lines": [
        "We’ve written about Ethel Cain before. Specifically, we covered 2019’s <i>Golden Age</i> a few weeks ago (and we’ve been listening to it religiously ever since). Cain has been on the scene only since 2019, but we feel comfortable already saying that she’s one of our favorite up-and-coming artists.",
        "This past week, Cain dropped the single “Crush.” The second single off of the upcoming (and spectactularly titled) EP <i>Inbred</i> (due out April 23rd), “Crush” is an instant success. It opens with a lazy bass line and Cain’s signature blasé vocal delivery, lilting along together like the aimless, disinterested ne’er-do-wells at the center of the story the song tells. Soon, we get a vaguely hip hop drum part (reminiscent of some of the trap-adjacent percussion from <i>Golden Age</i> tracks like “Sunday Morning” and “Casings”), and Cain’s delivery picks up a little, and the end of the first verse unfolds into absolute perfection (more on that below). The song is sad and beautiful, and it’s bold as well: as it ambles forward, it sways from side to side into interesting choices in the form of its vocal part. Here some spoken word, there some transient distortion. And all of it somehow works. (Longtime readers will be aware of our rule regarding spoken word vocals in music: every song would always enhanced by removing them. But not so here. As far as we’re concerned, when it comes to Ethel Cain, the rules just don’t apply.)",
        "Last time we wrote about Cain, we discussed (flawed) comparisons to Phoebe Bridgers. (Honestly, the more we think about these, the more they boggle the mind.) We argued then that a more appropriate comparison—although still an imperfect one—would be to Erika M. Anderson, known professionally as EMA. As we listen to “Crush,” however, it occurs to us that Cain vaguely reminds us of another sad girl who croons in a muted, dampened voice about scenes of dilapidated grandeur: Lana del Rey.",
        "If there are superficial similarities between LDR and Cain, though, they serve little more purpose than to highlight the even more profound differences between the two. Don’t get us wrong: both are quality creators with unique, subversive, and captivating artistic visions. From there, however, they track in different—almost opposite—directions. Whereas LDR offers us artifice—a persona which feels built, almost entirely constructed for the audience—Cain shows us authenticity—a person who seems rundown, almost in danger of falling apart right there in front of them. We find this, as we wrote previously, in the specificity in a lot of Ethel Cain’s lyrics. On “Crush,” for example, when she sings about a burned out boy who keeps guns in his locker at school, and explains that “his friends move dope/he hasn’t tried coke/but he’s always had a problem saying no,” you really believe that she knew (and loved) just such a boy. And even if Cain herself didn’t, then maybe you did, or at least you know someone who had. (In fact, the comments on <a href=\"https://www.youtube.com/watch?app=desktop&v=COQHYwNS8m4&t=77s\">Cain’s “visualizer” for “Crush”</a> –which is also, we mean, just <i>excellent</i>—suggest as much.)",
        "But it’s the next line that really hits. “His older brother bagged the valedictorian,” Cain bounces, “his mother steady screaming he should be more like him.” It’s almost arresting in its tragic parody of a burned out, claustrophobic, small town life: the notion that one is made less in <i>being</i> than in <i>bagging</i> a valedictorian, and that these are the standards to which disappointed mothers hold their less successful sons. Cain showed talent for capturing this sort of mundane devastation on <i>Golden Age</i> tracks like “Head in the Wall,” but here, she’s truly transcendent. In that way, she’s like an anti-Springsteen, and “Crush” is like a too-bored-to-be-bitter-anymore answer to his <i>Born to Run</i> street anthem “Jungleland.” There’s nothing to elevate here, Cain seems to say. No stand to make, and no opera out on the turnpike. No heroes and no villains. There’s just crime and foreclosures and an opioid epidemic. And the people here, they’re the stock characters that we forget about even before the story ends. (And that’s a big part of the unique tragedy in Cain’s music.) It reminds us of that Baudelaire line that Bolano used as an epigraph to 2666: “an oasis of horror in a desert of boredom.” No, you don’t elevate that to the level of your listeners. Instead, you pull them down into it with you. And that’s exactly what Cain does.*",
        "Things don’t get lower than that. They do, however, continue to evolve, as the chorus appears and then gives away to an equally (if not more) impressive second verse. Here, however, it isn’t the burned out wreckage of small towns and small lives that grab our attention, but the glowing embers of a girl’s still smoldering sexual attraction to the boy from the first verse. “I owe you a black eye and two kisses,” Cain sings coolly. “Tell me when you wanna come and get ‘em.” (With lines like those, we can’t imagine the narrator was stuck holding onto those kisses for very long.) “I only want him if he says it first to me/I wanna…him in the back of his mom’s Mercury/He looks like he works with his hands and smells like Marlboro reds/It makes me so…and I can’t get enough of it.” The skipped syllables in these lines remind us of a very different track: Tove Styrke’s “Mistakes.” The only similarity between the two is the restraint that the artists show in not saying their sexually charged words, and instead letting the silence they would otherwise occupy hang in the air for listeners to fill in for themselves. We don’t know why—it’s pretty obvious in both cases what the words are supposed to be—but it’s somehow so much more powerful this way.",
        "As we mentioned, “Crush” is the second single off of Inbred, and it’s got serious play-on-repeat potential. (In that sense, it’s a worthy follow-up to “Golden Age,” and already a serious contender for our ever-evolving Best of 2021 list. It should go without saying, moreover, that it’s Certified Thready<sup>WMT</sup>.) The full EP will be available on April 23rd, which, for us, cannot come soon enough. (And yes, this is a shameless, throw-it-at-the-wall-and-see-what-sticks effort at soliciting an advance copy, if you’re reading this.) Our only concern is that it will mean the end of the cover art for the single, which is a perfect profile of Cain, in a car, driver’s side, in large and low-hanging Petrine Cross earrings. Pair that with the “visualizer” to “Crush,” and it’s all the evidence you need that Ethel Cain is the new cool.",
        "*We hate to ruin the effect here, but we honestly can’t help but make this comparison: it’s like if <a href=\"https://www.youtube.com/watch?app=desktop&v=ZbLENQGcnGM\">Tim Dillon’s “The Wallet”</a> was <i>actually</i> a bleak, hopeless, emotional gut punch instead of the funniest thing on the internet. "
        ]
    },    {
        "song": "Frame of Reference",
        "artist": "Drug Store Romeos",
        "spotify_id": "4BTet4QXPBOaoAS4Nw4PW4",
        "post_page": "2021-03-15",
        "image": "drugstoreromeos_for.jpg",
        "description_lines": [
        "A three-piece from Fleet, Hampshire, Drug Store Romeos (great name) don’t appear to have been around for very long: their tracks on Spotify date back only to 2019. But for all its unpolish and youthfulness, “Frame of Reference” still feels mature beyond its years. A soft, muted electronic track which could have been recorded in your bedroom (and, we’re guessing, probably was), it plays like a cross between The Real People’s <i>The Joys of Losing Weight</i>—a work of Beirut’s Zach Condon which dates to the time he was 15 (!) years old—and Ruby Haunt. It’s got the same lo-fi, melancholic charm of both of those efforts."
        ]
    },    {
        "song": "Rory Shield",
        "artist": "Sorority Noise",
        "spotify_id": "34pLArf9NZO0bSTNXri70Z",
        "post_page": "2021-03-15",
        "image": "sororitynoise_roryshield.jpg",
        "description_lines": [
        "Lots of candidates for the Names Hall of Fames on this week’s installment of the Weekly Music Thread. First ballot contenders Sorority Noise started in 2013 as an outlet for the alternative material written by its members, most of whom played in other notable punk bands. As far as we can tell, the Sorority Noise material is pretty classic pop-punk, at least as far as 2014’s <i>Forgettable</i> is concerned.",
        "It’s the opening track off of <i>Forgettable</i>, “Rory Shield,” which we’re bringing to you this week. This is one of those tracks that announces to you from the very beginning that you’re going to like it. It opens with a catchy, plucky bass line before quickly going full band. It’s edgy but approachable, catchy but a little bit raw.",
        "What really sets this track apart is the opening line to the chorus: “Tell me again that you don’t wanna break my heart.” The lyrics themselves aren’t particularly special or unique, but it’s the intensity and feeling with which lead singer Cameron Boucher delivers the line that really makes the entire song. Although he’s straining a little to reach into the higher register the song requires, we get the sense that this isn’t really a question of vocal range at all. It feels like Boucher is actually singing this to someone, someone who told him exactly that—that she didn’t want to break his heart. It gives the song an angsty, adolescent power that instantly takes us back to time years ago when we felt the same.",
        "Indeed, the rest of the ironically titled <i>Forgettable</i> is worth visiting as well. The only reason we haven’t written more about here is that we have such a hard time making it past that opening track without clicking repeat. "
        ]
    },    {
        "song": "Leo\" and \"Stay Another Day",
        "artist": "Holiday Sidewinder",
        "spotify_id": "3qftVsjTMJz3Z40ZFI4y08",
        "post_page": "2021-03-15",
        "image": "holidaysidewinder_leo.jpg",
        "description_lines": [
        "This week, we discovered two tracks from a new artist, Holiday Sidewinder. (We also feel that it’s important to note, as soon as possible, that this is not a stage name but a birth name, which pretty much vaults this act to a place of honor in our informal Names Hall of Fames.) The daughter of entertainers, pretty much everyone in Sidewinder’s orbit is involved in the entertainment industry in some way. (Her godfather, for instance, is the actor who plays the guy in the elevator at the end of <i>Vanilla Sky</i>.)",
        "“Leo” opens with an understated verse that is, neverthless, undeniably dance-pop: the reverby, produced female vocals, the jaunty, staccato bass line, the insistent synthetic drum part. It calls to mind the recent music of Carly Rae Jepsen with the lyrics of a slightly more sophisticated Kesha. That’s because “Leo” is a song about loving men and leaving them, and it leans increasingly into this premise as the track progresses. The song’s prechorus lists generic male names—in a belated answer, perhaps, to Lou Bega’s “Mambo No. 5”? Is it possible?—before climaxing into a rapturous pop chorus. “And when the sun is rising up/I get my things and run,” Sidewinder sings. “And if I wrote my number wrong/life goes on, just move on.”",
        "For all the buzz that “WAP” generated in 2020—you’d think that it was the first explicit song ever written by a woman, that Lil’ Kim hadn’t done the same thing two decades earlier with <a href=\"https://www.youtube.com/watch?app=desktop&v=2kJS8Uk0twE\">“Suck My Dick”</a>—“Leo” feels like a more effective female libertine anthem, probably because it’s more fun, subtle, and tongue-in-cheek. For a glimpse of that contrast one need look no further than the music videos: whereas <a href=\"https://www.youtube.com/watch?app=desktop&v=74giZVQ1NAI\">the video for “Leo”</a> leverages the same kind of coquettish restraint and insinuation inherent to flirtatious wordplay, most of the imagery in the <a href=\"https://www.youtube.com/watch?app=desktop&v=hsm4poTWjMs\">video for “WAP”</a> is, quite literally, constructed and contrived. Like the song’s lyrics, it hides nothing, it leaves nothing to the imagination and, in so doing, it quickly loses this viewer’s interest.",
        "As much as we adored “Leo,” we also spent time this week with Sidewinder’s 2019 single, “Stay Another Day.” These are two different tracks: whereas “Leo” feels liberating and celebratory, driven by its bouncy bass line and sing-song vocals, “Stay Another Day” feels more reflective. It opens with clarion synth held notes over an electronic drum part before easing into a breezy, dreamy languor that wanders about sleepily for the rest of the track’s nearly four-minute runtime. The pace of the track echoes its message: unfolding slowly, lazily, it beckons the listener to stay, not to leave, and the feeling between the listener and the track quickly becomes mutual. Unlike “Leo,” it’s melancholy and a little bit beautiful. (If “Leo” was Sidewinder’s take on Jepsen meets Kesha, then “Stay Another Day” is her take on Enya meets a pop star version of Ethel Cain?) But just like “Leo,” it’s a strong candidate to play on repeat. "
        ]
    },   {
        "song": "C’est Beau la Bourgeoisie",
        "artist": "Discobitch",
        "spotify_id": "0O2TNG8ban1JDCk8U4jPOz",
        "post_page": "2021-03-08",
        "image": "discobitch_cestbeau.jpg",
        "description_lines": [
        "This one throws you for a loop. A creation of French DJs Kylian Mash and Laurent Konrad, Discobitch only ever released exactly one single: “C’est Beau la Bourgeoisie.” And it is fire.",
        "From the opening bars, it’s clear that the song is a club anthem, and that’s exactly what it became. After its release in 2008, “C’est Beau la Bourgeoisie” hit top 10 and top 100 lists in multiple European countries. It’s not hard to see why: in addition to a rock-solid backbeat and some driving electronic melodies, the lyrics and vocals are perfectly realized. “I’m a bitch,” the song begins in English. “I’m a bitch.” And then, just like a lot of the European club kids for which the song was presumably written and recorded, it switches from English back into its native language. “C’est pour la petite bourgeoisie qui boit du champagne,” it insists over and over again in a gauche, bitchy, petulant whine. It’s a worthy predecessor to Far East Movement’s “Like a G6”: it’s a song that captures the waste and indulgence of youthful clubgoing—expenditure without value, attraction without beauty, consumption without taste."
        ]
    },    {
        "song": "Nothing",
        "artist": "Jetty Bones",
        "spotify_id": "5D69A58kri9MFywpIEwpVX",
        "post_page": "2021-03-01",
        "image": "jettybones_nothing.jpg",
        "description_lines": [
        "We’ve written here before about Jetty Bones. (Specifically, we’ve shared our enthusiasm for “No Lover” and “That’s All.”) Well, this week, ol’ JB is out with another new track. “Nothing” comes off of the same recently released record (<i>Push Back</i>) as “That’s All,” and shares the same alt-pop sense of enthusiastic movement. We haven’t had the chance to explore <i>Push Back</i> yet, but if it’s anything like these last two tracks, you can expect a lengthy write-up on the subject in about a week’s time.",
        "(And with Julien Baker’s new record out this week as well, we’ve got a lot of new music we’re excited to listen to between now and then…)"
        ]
    },    {
        "song": "Only Wanna Be With You",
        "artist": "Post Malone",
        "spotify_id": "3SawmGBjjq8EOYZJV11cJm",
        "post_page": "2021-03-01",
        "image": "postmalone_onlywannabe.jpg",
        "description_lines": [
        "First of all, we still love <i>beerbongs & bentleys</i>. Seriously. We listen to tracks off of that record like every single day.",
        "We haven’t followed as much of Post Malone’s music since that record, but this track, which comes from a tribute to, of all things, Pokemon, is a fun entry in the artist’s catalogue. As far as covers go, it isn’t particularly impressive—it neither reinterprets nor improves upon the original—which leads it into the trap we discussed several weeks back. But it’s at least fun and surprising and brings a smile to our face.",
        "And, to be fair, it’s hard to make surprising covers feel weighty in comparison to RMR’s recent “4th Quarter Medley.”"
        ]
    },    {
        "song": "Final Form",
        "artist": "Pearly Drops",
        "spotify_id": "1qSNm5br36JmvwKDbxjZeI",
        "post_page": "2021-03-01",
        "image": "pearlydrops_finalform.jpg",
        "description_lines": [
        "Here’s a new one for you: Pearly Drops. This strangely named Finnish duo craft what they call “eerily haunting pop dirges,” which feels like an appropriate description. At any rate, they’ve only got about 8,000 monthly Spotify listens at this point, so get in on the ground floor while it’s still cool!",
        "As far as we can tell, Pearly Drops have been around only since 2019. Last year, they put out <i>Call for Help</i>, a full-length record which is really worth listening to a few times through in full. The bulk of the record has a synthy, shoegaze-y feel to it which is announced pretty much from the first bars of the opener “Call for Help.” If you like that track, you’ll love the record. If you don’t, you probably won’t. It is, in other words, a bit of truth in advertising.",
        "Regardless if you go in for all of <i>Call for Help</i> the way that we have, you’ll probably still crack for penultimate track “Final Form.” This is one of those tracks that you just know is going to be a banger, even from its opening notes. And boy, is it ever. This one gets played on repeat for days at a time. And the idea of a “final form” is taking us back to our Dragonball Z days."
        ]
    },    {
        "song": "Fake Blood",
        "artist": "Heart Attack Man",
        "spotify_id": "7vhpxl3VrqXZNEMs8NZhHe",
        "post_page": "2021-02-22",
        "image": "heartattackman_fakeblood.jpg",
        "description_lines": [
        "In 2017, Heart Attack Man put out <i>The Manson Family</i>, a record with which we are becoming increasingly familiar. We haven’t spent much time with 2019’s <i>Fake Blood</i> aside from this single, but if the rest of it is anything like this, it’s well worth a listen.",
        "HAM—not to be confused with HAIM—hail from Cleveland, but we pick up notes of Chicago-style punk on this track. Specifically, we’re hearing some minor similarities to specific eras of Alkaline Trio, not to mention the Lawrence Arms (both of which we’ve always liked). That being said, this track is a little more melodic and approachable than some of the better offerings from either of those groups. It’s almost like a cross between that and some alternative ‘90s rock that still got mainstream radio play, if that makes sense."
        ]
    },{
        "song": null,
        "artist": "Black Country, New Road",
        "album": "For the first time",
        "spotify_id": "2PfgptDcfJTFtoZIS3AukX",
        "post_page": "2021-02-15",
        "image": "ncbr.jpg",
        "description_lines": [
        "Black Country, New Road are a new post-punk group from Brixton who not two weeks ago put out their debut record, <i>For the first time</i>. And what a debut it is.",
        "The record opens surreptitiously, with a simple, ominous drum and bass heartbeat that pulses on for four bare and unaccompanied bars.  If it is not quite menacing, well, it at least feels foreboding; like the theme from John Carpenter’s <i>The Thing</i> (1982) the early moments of opener “Instrumental” seem to imply a calm that is about to be interrupted. But whereas <i>The Thing</i> begins as a slow burn, “Instrumental” almost immediately explodes into a frenzy of sixteenth-note tom-tom fills, maddeningly repetitive strings, and, of all things, horn sections which seem to shift imperceptibly in between styles and influences every eight or so phrases. Here and there, the track regresses, but only momentarily; in spite of these brief pauses for breath, “Instrumental” is a beast which has lost control. It grows increasingly agitated over the course of its five-and-a-half minute runtime until it starts to take on, in its final movement, the feeling of Radiohead’s “The National Anthem”: by turns, jazzy or demented, Eastern European or Middle Eastern, and nearly impossible to adequately classify. It’s a bold statement of an opening track, and it works really, really well.",
        "From there, we travel to “Athens, France,” where we are first introduced to lead singer Isaac Wood’s peculiar vocal stylings. Think Cake’s John McCrea meets Arcade Fire’s Win Butler meets Okkervil River’s Will Sheff meets Destroyer’s Dan Bejar. In fact, Destroyer feels like a relevant comparison here. The two groups don’t necessarily sound the same—Destroyer is much smoother, soft jazzier, lounge-informed—but the lyric games, at-times-spoken-word-style lyrics, and unusual song structures are all there. Maybe Black Country, New Road come off like Destroyer for people who are into post-punk? At any rate, “Athens, France” begins as a jerky, angular jaunt before slowing down and settling itself into what feels like a sleepy ballad, complete with jarring Phoebe Bridgers reference (“why don’t you sing with an English accent/I guess it’s too late to change it now”). This is all followed by an elegiac guitar outro that wouldn’t be out of place on an early Joan of Arc or American Football record (think “Never Meant” off of 1999’s <i>American Football</i>).",
        "The third track on the record, “Science Fair,” was feted as the single for the record and has by far the most listens to this point on Spotify. That being said, we actually find it to be one of the least interesting tracks on <i>For the first time</i>. (To clarify, we’re not saying that it is not interesting in its own right, but rather that we simply prefer the other tracks on the record.) Perhaps that’s because “Science Fair” does not weave and dodge the way so many of the other tracks do, but rather slowly builds over the course of its six-and-a-half minutes to what always felt like its logical conclusion, which recaptures a lot of that “The National Anthem”-like frenzy that was presaged on opener “Instrumental.” (Although chock this one up for another surprising reference. This time, it’s to Springsteen’s “Born to Run.” Although, should we really be that surprised? Apparently BC, NR have covered the Springsteen song live…)",
        "The last three tracks on the record are all utterly outstanding. “Sunglasses” opens with a raw, fuzzy, and crunchy electric guitar riff that would feel at home on Neil Young’s original soundtrack to Jim Jarmusch’s <i>Dead Man</i> (1995). From there, the track recedes into a clean, running backbeat and feather-light guitar parts over an ongoing, semi-spoken tale of the ennui associated with growing up and becoming a cliché just like your parents, just like your in-laws, just like everyone else. At this point, confronted with that realization, the track shatters, falls apart, and totally reinvents into an utter banger, complete with screaming references to Kanye West. The penultimate song, “Track X,” is the shortest on For the first time, clocking in at 4:44, and the prettiest throughout. Finally, the record ends on “Opus,” which recaptures much of that vaguely Eastern European to Middle Eastern promise set out in “Instrumental,” carrying itself through three total up-and-down cycles before bringing the record to a close.",
        "All in all, For the first time feels like a fitting name: we’d never heard anything like this before. It is so new, so creative, so stuffed with seemingly contradictory influences, that we were utterly taken aback on first listen. After playing it over and over for about a week, however, we feel like we understand it better. Indeed, even after the first listen or two, things started to emerge for us. As stiff as parts of <i>For the first time</i> are, for instance, there are also passages of sublime beauty, which are rendered all the more beautiful for their juxtaposition with the edgier, more intense parts of the record. Moments like the outro to “Athens, France,” the interlude four minutes into “Sunglasses” beginning with the phrase “I become her father,” and the chorus to “Track X” emerge like caramel notes from beneath a rough-necked whisky or the hints of chocolate under a bitter cup of coffee. And just like those beverages—staples of adult life which nevertheless make eager adolescents inadvertently turn up their noses and frown—<i>For the first time</i> will probably, for most, arrive as an acquired taste. The first sensation is just of something <i>different</i>.  And it is only on subsequent listens that the subtleties of the record show themselves.",
        "This is truly an excellent record. We will be shocked if it doesn’t appear on 2021 Year-End Best-Of lists. But give it time. Give it a few listens. It’s not easy to try new things, but in this case especially, it can be very, very rewarding."
        ]
    },{
        "song": "Snow Angel",
        "artist": "Ruby Haunt",
        "spotify_id": "6vovUt5MibSaYxnhB5VHtr",
        "post_page": "2021-02-08",
        "description_lines": [
        "Ruby Haunt are like Wes Anderson or Quentin Tarantino: going in, you pretty much know what you’re going to get. And if you’re into that thing you’re going to get, then you’re in luck, because it’s always done well. We’ve written about Ruby Haunt here before (“Carrie,” “Avalon,” and “Sunbelt,” and we’ve mentioned our personal favorite, “Curtain Call,” as well) so we won’t go into all the shoegaze-y details here. See those reviews if you want to know more about the sound. Or just spin the songs themselves, especially when you’re feeling a little introspection."
        ]
    },{
        "song": "That's All\" and \"No Lover",
        "artist": "Jetty Bones",
        "spotify_id": "3RHxEG6JqPKNesUpEv3FUg",
        "post_page": "2021-02-08",
        "description_lines": [
        "Sometimes you come across something that checks very two specific boxes: 1) you like it; and, 2) you’ve never heard anything else quite like it. So it is with Jetty Bones. (Even that name—apparently, an anagram of “the band’s namesake, Betty Jones, who broke out of her all girl’s Catholic school to remove herself from a situation where she wasn’t happy,” per her Spotify “About” page—caught our attention. And here we were thinking it was some sort of marine life reference…) The Urbana, Ohio-based alternative pop project of Kelc Galluzzo has shown up on our radar in a big way this week.",
        "First, there’s 2017’s “No Lover.” This one opens with palm muted eighth notes before welcoming Galluzzo’s gawky and awkward (and, as we’ll see shortly, excellent) lyrics:",
        "<i>I don’t want to say I<br>I just want to say we<br>We’d make a great team<br>And teamwork is…good</i>",
        "There’s a lot to love there already. For one thing, notice how the word that ends each line shows up in the very beginning of the next line (“I”/“I”, “we”/“we”, “team”/“team”). The repetition is important—it suggests stammering, as though our narrator isn’t sure of what she wants to say and is in circles trying to figure it out. That last word, “good,” is working in the same way. It’s late, syncopated, almost as though it got caught in the back of Galluzzo’s throat on the way out of her mouth. And, in addition to all of that, it also establishes a “sing-song” sort of vibe which feels somehow both authentic and tongue-in-cheek at the same time.",
        "From there, we get bass, bass drum, hi hats, hand claps, and a tambourine before the song <i>really</i> hits its stride with a “hey!,” a rim shot, and an electrifying chorus which defies you not to bob your head. As soon as you adjust, however, it’s gone, collapsed into a half time sway which ends with Galluzzo insisting—a little over eagerly—that “I don’t need a lover / ‘cuz I don’t need anyone.”",
        "The vocals there sound so familiar. They remind us of <i>Tell All Your Friends</i>-era Taking Back Sunday, or maybe <i>In Keeping Secrets of Silent Earth: 3</i>-era Coheed and Cambria (think “Blood Red Summer” or “A Favor House Atlantic”). We hear the same exact echoes in the second verse, when Galluzzo triples—quadruples? we can’t say for sure, but there are at least two voices singing the high part and at least one on the low—her voice and taunts “limelight, limelight / you’ll get it when the time’s right / it’s my life, my life / but romance takes the spotlight.” And then we’re right back to that kickass chorus. This track is a banger for sure.",
        "But that was three or four years ago, and as much as we love that track, Jetty Bones’ more recent sounds might be even more intriguing. If “No Lover” was an expert take on territory which was already at least partially explored, then 2021’s “That’s All” feels like something new entirely. This track feels like Hannah Diamond grew up into Sigrid and joined Destiny’s Child (or something). There are elements of pop, hip hop, R&B, and electro here. We’re honestly not even sure how to describe it further, except to say that it’s so fresh, so original, and so infectious that we’ve been listening to it on repeat for days at this point. (The crazy thing is that, in spite of all of that, this track also works well as an <a href=\"https://www.youtube.com/watch?app=desktop&v=Oe5sLv1FPoM\">acoustic ballad</a>.)",
        "“That’s All” is a single from an upcoming album, Push Back, due out February 26th. Pre-release singles can be a lot like pilots for television series: they’re often much, much better than the rest of what follows. That being said, if the rest of the record sounds anything like this single, we anticipate that we will be devoting a lot of time to it come March. (Ms. Bones—can we call you Jetty?—if you’re reading this, we’d love to get our hands on that a little early if at all possible!) We really can’t wait to hear more from this artist who we feel, frankly, is probably about to blow up, and deservedly so.",
        "Jetty Bones? More like Heady Bones."

        ]
    },{
        "song": "Enfance 80",
        "artist": "Videoclub",
        "spotify_id": "41EVzZNXWACIguYgegrrFX",
        "post_page": "2021-02-01",
        "description_lines": [
        "We’re just going to warn you from the outset: this one is a hit. It’s Certified Thready&trade;. (That’s a new thing we’re doing. We do that now.)",
        "Videoclub are a relatively new duo formed in 2018 in Nantes, France by Adele Castillon and Mathieu Reynaud. As such, there’s not a ton for us to say about them, so we’ll move on to “Enfance 80” itself.",
        "Released first as a single and then as a track on <i>Euphories</i> (2020), this recent French dream pop track would have felt at home on the soundtrack of Nicolas Winding Refn’s Drive (2007). The deep, cardiac baseline that thrums underneath the track, the shimmering synth lines that follow the vocal melodies, and the blasé, world-weary vocals all evoke bangers from that soundtrack like Desire’s “A Real Hero” and College’s “Under Your Spell.” (Which, by the way, revisit those, if you haven’t recently.)",
        "By the way, what are they saying in that unforgettable chorus? “Je laisse aux autres les demains/moi, je prends que les maintenants/si c’est pour penser a la fin/comme tout mes reves d’enfant.” Veeeerrrrryyyyy loosely translated, this means something along the lines of “I leave tomorrow to others/and take only todays/if it’s to think of the end/like all my childhood dreams.” Which is worth noting, because there’s a contradiction there, isn’t there? If you’re taking only todays, then sure, you can leave tomorrow to others, but can you really afford to fixate on your childhood dreams as well? This seems to fit in so well with the faux ‘80s nostalgia of the track—the dream past, the fictional childhood, the longing to return to sounds and events that never really happened—that we felt we had to mention it here.",
        "At any rate, as we said, a certified hit. Almost sure to show up nearly a year from now on “Best of” lists. The rest of the album isn’t half bad, either, so be sure to give that a spin."
        ]
    },    {
        "song": "All This Time\" and \"Fall Apart",
        "artist": "Ellis",
        "spotify_id": "6120SAPVW9R3gLTImuMfre",
        "post_page": "2021-01-25",
        "description_lines": [
        "This week, we discovered Ellis. Self-described as “emo dream pop from Hamilton, Ontario,” Ellis seems to have been on the scene for a couple of years, beginning with the 2018 EP <i>The Fuzz</i>, which, appropriately enough, was also our introduction to her.",
        "The standout track on <i>The Fuzz,</i> is second-act closer “All This Time.” It opens over a grungy, heavily distorted guitar part that for the briefest of moments almost recalls (to us) Miguel’s “coffee” (off of 2015’s <i>Wildhearts</i>), but that’s where that similarity ends. Almost immediately after that, we get Ellis’ voice and some plodding percussion, replete with messy sock cymbals and a very present, hollow-sounding snare drum. Throughout the verse, Ellis’ pretty voice rolls between modal and falsetto, almost as though the vocals themselves are rolling around the hills and divots created by the rich texture of the rest of the track.",
        "The energy here—the contrast between a light, beautiful voice and a heavy, momentous track—is reminiscent of Sky Ferreira (think “Heavy Metal Heart” off of 2013’s <i>Night Time, My Time</i>, or, perhaps a little more appropriately, a track called “Cheater” by a group called Stella by Starlight, both of which, as far as we can tell, have been totally lost to time, because we couldn’t find either anywhere). At any rate, it’s a heady track off of a really solid EP.",
        "Again, we feel like we should reiterate that we are just discovering Ellis (in Chains) at the end of what was otherwise a very dry week for us in terms of music discovery, so we haven’t had enough time to really survey her canon. However, we can already tell there’s a lot to like here. For one thing, in 2020, she put out <i>Bedroom Covers</i>, a three-song EP of—well, figure it out. One of those covers is, interestingly enough, The Used’s “Buried Myself Alive” (off of their 2002 self-titled debut). First of all, it’s worth noting that Used record had a home in our CD wallet and, for a while, was in constant rotation. It’s an interesting choice for a cover. The original track is whiny (in a good way), aggressive, and, at times, brutal. It’s one of the best tracks off of that record, but it doesn’t jump out at you as a good opportunity for an “emo dream pop” cover. As Ellis (Cooper) proves here, however, that’s exactly what it is. This is the best sort of cover—the kind that doesn’t just regurgitate the original (as so many covers unfortunately do), but actually reinterprets it, and gives it new meaning by placing it within a new context. Whereas The Used’s Bert McCracken (quite literally at times) <i>screams</i> the lyrics to that song, Ellis croons them. It’s the difference between agony and resignation—McCracken is protesting as he’s burying himself alive; Ellis is lamenting it indifferently. We’re not sure how clear that will be to those who are not familiar with the original track, but for those who are, this one should land pretty hard. It did for us. ",
        "Also in 2020, Ellis (in Wonderland) put out the full-length <i>Born Again</i>. We haven’t had the time yet to listen to this record all the way through, so we’re going to withhold judgment. However, we’ve sampled some of the tracks here and there, and “Fall Apart” feels like a standout. It feels a little more mature than <i>The Fuzz</i> and “All This Time.” Those dreamy, attractive vocals are still there, but gone are the heavy instrumentals. The track is more restrained, more comfortable with itself, more exposed, more vulnerable. This feels less like Sky Ferriera and more, maybe, like early Pure Bathing Culture (think “Dream the Dare,” off of 2013’s <i>Moon Tides</i>). We’ll have to report back in the future on the rest of that record.",
        "At any rate, we really like what we’ve heard from Ellis so far, and we look forward to hearing more."
        ]
    },{
        "song": "Solstice - Edit",
        "artist": "The Antlers",
        "spotify_id": "4rUFenCwnmutWENy25XhfQ",
        "post_page": "2021-01-18",
        "description_lines": [
        "For us, personally, the Antlers' <i>Hospice</i> may be the single most compelling record of all time. Follow-up efforts such as <i>Burst Apart</i> and <i>Familiars</i> were excellent as well, but never reached the same levels as <i>Hospice</i> itself did. Because, well, what could?",
        "Well, lately, Pete Silberbro and drummer Michael Lerner have been collaborating to create some new tracks. (Miss you, Darbywave, not to mention your Darbywave hair.) The first of these, \"Wheels Roll Home,\" we covered on a previous installment of the WMT, and noted that it had a distinctly <i>Undersea</i> vibe to it.",
        "\"Solstice\" feels similar. (We mean, for one thing, the song opens over what sounds like running water.) But where <i>Undersea</i> was characterized by wetter, warmer tones that evoked, well, being underwater, the sounds on \"Solstice\" are colder, sharper, glassier. They are more reminiscent of the harsher pitches of, for instance, <i>Hospice</i>. But that melodic repetition is still there. Forgive the tortured comparison, but it's almost as though the <i>Undersea</i> EP...froze.",
        "Interestingly, whereas the Antlers used to be notable for the staggering intimacy of their lyrics, \"Solstice\" feels far away and impersonal. There isn't a personal story to connect to here, but rather something less direct than that. \"The week went slow, the year flew by/From the end of June back to last July/When I lost my coat swimmin' underneath/Heavy everything, an oppressive heat.\" If there's a girl involved here, we definitely don't get her name (lookin' at you, Sylvia), much less an exhaustive list of all of the different ways in which she tortured Pete Silberbro."
        ]
    },{
        "song": "Her Honeymoon",
        "artist": "RMR",
        "spotify_id": "5aZuJDwYLDPjUtvmIwrRrY",
        "post_page": "2021-01-18",
        "description_lines": [
        "Readers of the WMT will know that RMR was, in our opinion, the most important thing that happened in 2020. We don't have time to rehash all that here, but rest assured that the search button will get you far in that respect.",
        "Well, RMR is back, this time with \"Her Honeymoon.\" Although we've felt comparisons to Lil Nas X were to this point comically misinformed, even we need to admit the similarity here. The arpeggiated acoustic guitar part that undergirds the entire track gives \"Her Honeymoon\" a vague country twang . That window dressing, layered as it is over a classic trap beat, is probably most reminiscent of RMR's prior effort, \"DEALER.\"",
        "The really special thing about \"Her Honeymoon,\" however, is the music video. The video, which tells the story of a betrayal of RMR by a girlfriend played by model Janet Guzman, is frequently intercut with RMR's meta messages about the video itself. These begin as simple narration but progress to include his indecision as to how the video should end. He includes three possible endings in succession, and then shares what is (presumably) a personal phone number (?), encouraging fans to share their thoughts directly with him. (As obviously fake as this sounds, RMR himself also commented directly on the YouTube video, thanking those fans who did in fact reach out to him and insisting that he reads all the comments.)",
        "All in all, RMR continues to be the most interesting working musical artist of the past year."
        ]
    },{
        "song": "Chemtrails Over the Country Club",
        "artist": "Lana del Rey",
        "spotify_id": "1PZDyestTVydtHpaIcfUJg",
        "post_page": "2021-01-18",
        "description_lines": [
        "We've been fans of Lana del Rey since we first heard \"Video Games\" back in the summer of 2011. (Months after that, <i>Born to Die</i> impressed, and that's a record that recent listenings can confirm still holds up to this day.)",
        "LDR's most recent effort, \"Chemtrails Over the Country Club,\" will show up as the second track of her upcoming album of the same name, which is due out March 2021. The album was produced by Jack Antonoff (who also produced <i>Norman Fucking Rockwell</i>, not to mention a lot of Taylor Swift's catalogue, including the LDR sound-alikes on <i>Folklore</i>.)",
        "The track opens with LDR's classic, blase vocal mumble over a pretty, haunting piano part. And honestly, much of the track continues like that (although the vocals do break into something a little cleaner throughout). But this is a really solid track that's worth a listen.",
        "It's also worth noting that, lyrically, this is what LDR does best: mixing low-brow hallmarks (like conspiracy theories about \"chemtrails\") in with ostensibly high-brow trappings like country clubs. (The word ostensibly, of course, is doing a lot of heavy lifting in that sentence.) Because critics are quick to willfully misinterpret LDR, some will no doubt see the song's lyrics (and title, and album title) as a sort of pseudoartistic, covfefe-wave commentary on the contemporary Republican party, but there's not much here to support that. Instead, the song is, like a lot of LDR's work, a view of swimming pools and jewels as languorous and unearned glamor. "
        ]
    },{
        "song": "Fade Away",
        "artist": "Hannah Diamond",
        "spotify_id": "5w6wMKwRH8OUCHap7OqyD6",
        "post_page": "2021-01-11",
        "description_lines": [
        "Hannah Diamond has been on our radar ever since we first encountered her A.G. Cook collab, \"Keri Baby,\" at No. 1 on <a href=\"https://www.gorillavsbear.net/gorilla-vs-bears-songs-of-2014/\">Gorilla v Bear's Best of 2014 list</a>. (We were killing time in an annexed terminal of a dingy Northeastern airport and counting the mice which kept scurrying back and forth across the floor, but once this track popped up, we started to count instead the number of consecutive times we listened to it. It was a lot.)",
        "Diamond is part of the shiny, glitzy London-based PC Music collective, and \"Fade Away\" shows all the hallmarks of that: breathy, pitchy, hyper \"girly\" female vocals, flamboyantly bouncy synth leads, and lots of other assorted bleepy bloops. It doesn't rise to \"Keri Baby\" levels for us (it isn't enough of a banger for that), but it's a worthy entry in Diamond's canon.",
        "Honestly, PC Music isn't for everyone. If you thought Lana del Rey (in our opinions, successfully) blurred the lines between art and trash (and we use that term affectionately), then some of the better PC Musicians totally obliterate it. The movement has held substantial staying power for us. At the very least, it's worth checking out."
        ]
    },{
        "song": "Hey QT",
        "artist": "QT",
        "spotify_id": "7nJoufbWvXXIcOLyDEci8t",
        "post_page": "2021-01-11",
        "description_lines": [
        "You're gonna wanna strap in for this next one. QT is...\"a pop singer portrayed by [vocalist and performance artist Hayden] Dunham who promotes and is the living embodiment of the semi-fictitious DrinkQT energy drink.\" Great sentence (h/t Wikipedia).",
        "Like Grimes and WarNymph, QT represents the intersection of two connected, and yet independently interesting, artistic impulses, which is another way of saying that in addition to being conceptually interesting, this track is a banger. Like Hannah Diamond, Hayden Dunham is a part of the PC Music movement and has been working with A.G. Cook since 2014 (when this track released). Indeed, QT as a...recording artist?...is made up of Dunham, A.G. Cook, and Scottish producer Sophie.",
        "For the uninitiated, \"Hey QT\" is a great, approachable introduction to all the hallmarks of PC Music we mentioned above. The lyrics, for instance, are adorably air-headed (and made to seem even more so by the track's spritely, pitch-shifted female vocals):",
        "<i>Hey QT, yeah?<br>Yeah, there's something I want to say<br>I feel your hands on my body<br>Every time you think of me</i>",
        "<i>Hey QT, yeah?<br>Even though you're so far away<br>I feel your hands on my body<br>Every time you think of me, boy</i>",
        "The entire track bounces along on uber-staccato synth and drum machine parts. We're not dancers, but we imagine that, for those who are, \"Hey QT\" would present a lot of opportunity for motion. Like a lot of PC Music, the track doesn't particularly evolve over time, but neither did we really want it to. PC Music is less like wine than it is like bubble gum: you're not looking for it to breathe. You're looking for a lot of flavor up front, and when you find it, you want it to last for a long time."
        ]
    },{
        "song": "Loving Not Loving You",
        "artist": "Foxes",
        "spotify_id": "1VSsfA5Z37dSNPqiK5dxmM",
        "post_page": "2021-01-11",
        "description_lines": [
        "Our third consecutive track to come at least partially from across the pond, \"Love Not Loving You\" is a 2020 release from the British singer Louisa Rose Allen (Foxes). Allen put out LPs in 2014 and 2016 which we're not familiar with, went on hiatus for a period of time, and started releasing new music over the course of 2020.",
        "\"Love Not Loving You\" is one of those releases. It's an energetic, funk-infused pop track that picks up steam from the first couple of bars and never really looks back. It's full of that faux nostalgic retro charm that's been a hallmark of a lot of pop music over the past ten years. Think of this as Carly Rae Jepsen with a little bit less polish and a little bit more edge, with the sort of punchy, funky, forward bass part you'd expect on the front end of a <i>Cupid Deluxe</i>-era Blood Orange release."
        ]
    },{
        "song": "Cleansing Foam",
        "artist": "Parsimon",
        "spotify_id": "3xkgWR1g0SoyzvZ9l1UGjx",
        "post_page": "2021-01-11",
        "description_lines": [
        "And now for, as another British collective used to say, something completely different.",
        "We can't provide a lot of background on Parsimon because, frankly, there's not much background to be had. Judging by their Spotify page, they seem to be a pretty new group with an interest in bathtub-related cover art (both live action and animated) who hail from Sweden. (They don't sound anything like her, but another Swedish export, Tove Styrke, has been a recurring favorite here on the WMT.) Parismon put out a self titled EP last year, and followed it up most recently with the stand-alone track \"Cleansing Foam.\"",
        "\"Cleansing Foam\" is a gentle, melancholy indie pop track that recalls in the blase, indifferent overtones of its unimpressed, female lead vocalist the stylings of Sidney Gish tracks like \"Sin Triangle\" (another favorite of the WMT). Both artists also craft tracks which are simple at first glance, yet more sophisticated when you look beneath the hood. Where Gish is clean and crisp, however, with vocals much more forward in the mix, the Parsimon track is hazier. The vocals are set further back and sport more reverb, for instance, which give them a dreamier, less intelligible feel. If Gish wants you to smile at her wordplay (\"Two-faced bitches never lie/ and therefore I never lie\"), Parsimon want you to forget about the lyrics and get lost in the song's overall vibe, which is, in a phrase, \"rainy day.\" The song is not quite sad, but resigned. Not quite crying, but it's at least sighing.",
        "Check it out. We'll be eager to see what these young Swedes do next."
        ]
    },{
        "song": null,
        "artist": "Ethel Cain",
        "album" : "Golden Age",
        "spotify_id": "1wvJf32qDHmwku12nfzVGN",
        "post_page": "2021-01-11",
        "description_lines": [
        "Wow. We just discovered this 2019 EP from Ethel Cain, a Florida-born musician who grew up in a small (~1,500-person) town with little access to secular music until she was in high school.",
        "Cain's background is interesting because <i>Golden Age</i> has a spiritual, almost religious feel to it. There are lots of long, held, haunting notes, and layered vocal tracks dripping with reverb. <a href=\"https://undergroundunderdogs.com/2020/03/30/ethel-cain-interview/\">A March 2020 interview from Underground Underdogs</a> described Cain's Golden Age as \"sun-drenched Americana,\"easy rock,\" \"soft agony,\" \"sticky skin,\" and \"fire flies,\" which we like. But we also sense that there's something darker here. Tracks like opener \"Sunday Morning\" moan at times in a nearly funereal catharsis, and lyrics like those on \"Head in the Wall\" suggest unimaginable pain. The latter is even more arresting for the mumbled, indifferent tone with which its increasingly disturbing lines are delivered. Eventually, though, that resignation breaks, and the vocals swell as the situation continues to deteriorate, until our narrator concludes that \"fuck the cops, and fuck God, and fuck this town for ruining us.\" The lazy ooze of this track, sticky and sweet as it is, is enough to distract you from all of that on the first listen, but it becomes impossible to avoid as soon as you realize what's going on.",
        "The real showstopper on <i>Golden Age</i>, however, is its eponymous closer. The sixth song on this short but powerful EP, \"Golden Age\" starts off with little to distinguish it: some vocal wanderings which lead into an a capella anticipation of the song's climax, before the first verse begins in earnest about 30 seconds in. The lyrics are pure poetry. They aren't as shocking as \"Head in the Wall,\" but they are arresting in their stripped-bare beauty and honesty. The song is a six-minute-long crescendo of both vocal and instrumental layers which breaks harder with each chorus, like a stormy tide which threatens further and further with each successive wave. The fact that the syllables of Cain's lyrics don't fit nicely into the song's beats means that she has to hurry through them at times, which contributes to the track's growing desperation, until its final frantic pre-chorus collapses into a climactic, tragic rhapsody. Finally, in the outro, Cain returns to that phrase she warmed up in the opening of the track: \"I'll be coming along, I'll be coming along, I'll be coming along,\" she repeats. That repetition gives the line an insistent feeling of importance, like a promise. With more music on the way (Cain has been teasing a new track release in early February), we can only hope.",
        "Cain bristles at comparisons to Phoebe Bridgers, and we tend to agree. \"stop comparing me to phoebe bridgers,\" she tweeted yesterday. \"i make music for girls who lean their head on the bus window and act like they're in a movie and she makes music for girls who walk to school.\" There is a deeper pain in Cain's music, something more lasting, inescapable, and fundamental. If we had to make a comparison in that sense, we'd say early, <i>The Grey Ship</i>-era EMA (think \"Marked,\" or \"Breakfast\"), but the problem that all of these comparisons share--to Bridgers, to EMA--is that those artists' sad songs feel tied to a very specific person in a very specific place. <i>Golden Age</i>, to us, almost takes on the mythic proportions of, say, Springsteen's \"Jungleland.\" Obviously they sound nothing alike, but both works are larger than life in the same way.",
        "By the way, we've made several references this week to the separation of artists from their online presence, but Cain stands as a stark counter example to that trend. Her social media game is refreshingly compelling, perhaps as much so as her music itself."
        ]
    },{
        "song": null,
        "artist": "Baths",
        "album" : "Pop Music / False B Sides II",
        "spotify_id": "7CNADHu4cWUHE2b6ESIHCx",
        "post_page": "2020-12-28",
        "description_lines": [
        "Back in college--a hundred, in other words, years ago--we got really into some of Baths' early stuff (<i>Cerulean</i>, for instance, and, later, <i>Obsidian</i>). These works were a little glitchier, a little crunchier, with more skittish and gravelly electronic percussion sounds underneath everything. (To quote another WMT favorite, Katie Dey, \"the drums do that thing. you know the thing where it's like. crkrhrkhr.\")",
        "These are, apparently, older tracks from around the era of the <i>Cerulean</i> sessions, but you wouldn't necessarily know it. They feel softer, like those rough edges have been sanded down (and maybe, over the course of the last ten years, they have been.) The opener, \"Immerse,\" is as smooth and easygoing as anything that we've heard from Baths before. \"Tropic Laurel\" starts off crunchy crkrhrkhr-wave, but don't let that fool you--it mellows out pretty quickly.",
        "This is a really easy record to listen to from front to back. We've played it through on a couple of distance drives, and plan to do so for a couple more before the year's end here. All of the tracks go down smooth, but \"Wistful (Fata Morgana\" is one of our favorites. We wish we had more to say overall, but, for the time being, we need to give it a few more listens."
        ]
    },{
        "song": "Goldbrick Champion",
        "artist": ["Broke Royals", "Bartees Strange"],
        "spotify_id": "0QxlJ2GXHjwio8BXwEC5XT",
        "post_page": "2020-12-21",
        "description_lines": [
            "Barty Bizarre has been all over the WMT this year, and for good reason. Singles like \"Mustang\" and \"Boomer\"--and really all of 2020's Live Forever--caught our attention from first listen. And now, Barty Boi is back with a collab with Broke Royals.",
            "This track hasn't got the rough hewn feel of Strange's other work. Crafted as it was in collaboration with the pop-rock Broke Royals, this one bounces along on a basic pop synth melodies, a chewy bass line, and tachycardic organic/electronic drum beat that sounds like the sort of song that the children of the members of The Cure might may make. It's reminiscent of Antarctigo Vespucci, not necessarily in sound, but in the pleasure one takes as a listener in a succinct, self-contained, well-crafted song about a normal person who is just slightly down on their luck. And the two refrains (\"I'm a goldbrick champiooooon\" and \"One thing at a time/I can only handle one thing at a time\") are positively infectious, from a sing-along perspective.",
            "H/t Tolstoy on that opening line."
        ]
    },{
        "song": "This Time It's Different",
        "artist": "Heart Bones",
        "spotify_id": "0cb5dTDqODwX5meHDXRKby",
        "post_page": "2020-12-21",
        "description_lines": [
            "Heart Bones have appeared here before with \"Open Relationship,\" a fun, catchy, male/female duet about a guy whose girlfriend wants to see other girls. \"This Time It's Different\" has very much the same vibe. Although it's not a pure duet in the way that \"Open Relationship\" is, there are largely two distinct vocal parts here, which weave in and out of one another. Those parts unfold above a space-agey synth track with plenty of corny-sounding special effects.",
            "As far as how the song sounds, think Heart Bones (duh) meet Culture Club. Specifically, think <a href=\"https://www.youtube.com/watch?v=rGigefpcOG4\">\"Karma Chameleon,\"</a> because the melody of this song is almost exactly the same as that one."
        ]
    },{
        "song": "Fyll upp mitt glas nu",
        "artist": "Tove Styrke",
        "spotify_id": "3hS7w6gBYzVdpaZnN7Mpfl",
        "post_page": "2020-12-14",
        "description_lines": [
            "Last week, we reminded you of Tove Styrke's Sway (2018) en route to a review of new release \"Bara du och jag.\" Now, Styrke is back a week later with another new release, only where \"Bara du och jag\" was a punchdrunk pop banger, \"Fyll upp mitt glas nu\" is a slower, moodier rumination on something in...presumably Swedish? This one hasn't even got the lone line in English to point us in the right direction, and we're increasingly suspicious that both tracks are actually covers.",
            "One of the interesting things about \"Fyll upp mitt glas nu\" is the way that the icy, glassy, crystal-clear guitar parts from the intro eventually gain distortion later on in the song and through what we can only assume is some e-bow magic eventually wind up sounding less like guitars and more like tortured Nordic violins. (Do the Nords play violin?) Styrke's voice takes on the same distance and distortion, and there are flickers of electronica in the final verse/chorus/outro sequence. This is a cool one when you're in your feelings."
        ]
    },{
        "song": "Daddy Don't Take My Phone Away",
        "artist": "Kitten",
        "spotify_id": "5PGKSxKgtx73izIPJhqMzQ",
        "post_page": "2020-12-14",
        "description_lines": [
            "Speaking of hints of electronica (among other things), Kitten have been one of the most interesting acts of 2020. From the bouncy indie banger \"Memphis\" (technically 2019) to the excellent acoustic follow-up take on that same track to the slightly demented \"My House\" to \"What Year Are We In,\" this group's sound is evolving faster than a water-soaked mogwai with the post-midnight munchies. And it's not just that their sound is changing quickly; the rate of change itself is increasing.",
            "This trend intensifies with \"Daddy Don't Take My Phone Away.\" At first, you'll hear that difference. Even the vocal effects on the intro announce it, and the first verse has a cynicism to it which is miles ahead of \"Memphis.\" The repetition of a seemingly ridiculous and adolescent phrase in \"Daddy don't take my phone away\" is a reminder of the more recent efforts (\"My House\" and \"What Year Are We In\"), but then the entire thing collapses into a 100 gecs-wave inorganic musical pandemonium. After that we back to the original verse arrangement, followed by finger picked acoustic guitars and, of course, a key change. If 100 gecs were once described as an \"anarchic assault on the ears,\" then Kitten are very much experimenting in that vein.",
            "All this makes us wonder if the AOL dial tone buried under the chorus of \"Memphis\" was Kitten's equivalent of the guitar scratches in the prelude to Radiohead's \"Creep\": a seemingly subtle detail which, in retrospect, heralded an entirely new and unsuspected direction for a group that was ultimately destined to make some really interesting music."
        ]
    },{
        "song": "I Feel Alive",
        "artist": "TOPS",
        "spotify_id": "5BL5JIhruwOhrRZd3Djoqs",
        "post_page": "2020-12-14",
        "description_lines": [
            "TOPS are one of those groups who are always recommended to us, but we've never really listened to them. This song has an old school <i>charm</i> to it, though. It captures the same faux nostalgia for things that may never have existed as elements of, say, Wild Nothing (with less synth), Ariel Pink, and especially <i>Moon Tides</i> (2013)-era Pure Bathing Culture. There's maybe a pinch of Love You Later in here as well.",
            "It's the lazy, breezy strumming of the guitar over the insistent eighth-note patterns on a mixed-down drum set, combined with those long, held on \"youuuuuuuus\" from the chorus. It's a track that feels almost like it'd be at home in a modern take on <i>Grease</i> or <i>Fast Times at Ridgemont High</i>. If the rest of TOPS' discography is anything like this one, you can bet we'll be taking a closer look."
        ]
    },{
        "song": null,
        "artist": "Bob Dylan",
        "album": "Rough and Rowdy Ways",
        "spotify_id": "1Qht64MPvWTWa0aMsqxegB",
        "post_page": "2020-12-14",
        "description_lines": [
            "Rough and Rowdy Ways is Dylan's first original output in years, and man, is it worth the wait. Early Dylan is, of course, canon, as is much of his middle output, but it's no secret that his later years have been a little bit more hit-or-miss. Not so here, however. Rough and Rowdy Ways is a simply outstanding record from the first to the last and we can't stop listening to it.",
            "The record opens with \"I Contain Multitudes.\" This track grabbed us from the get-go on first listen, but the more we listen to the record, the more that this one comes off as the sleeper. That's not really to put down the song, it's just to say it almost feels like a Tom Waits ballad (again, not an insult--nothing short, really, of a high compliment). It exhibits a Dylan staple in its religious repetition of a single, somewhat clunky formula ([descriptions of Dylan], \"I contain multitudes\"), but it opens the album nicely.",
            "After \"ICM,\" things really start to pick up. What follows next is the six-minute long \"False Prophet,\" which trundles along upon a sneering, ramshackle blues shuffle that feels about as broken in as Dylan's voice at this point. If pick-up truck commercials were Quentin Tarantino films, this song would be the soundtrack. The third track, \"My Own Version of You,\" is more of the same, and the fourth \"I've Made Up My Mind to Give Myself to You,\" combines the full band arrangement with the ballad format of the album's opener. We get another bangin' shuffle in \"Goodbye Jimmy Reed,\" another ballad in \"Mother of Muses,\" and a few more solid tracks to round out what is, really, an all-around excellent piece of Americana.",
            "Even if none of that were true, however, the album would be an instant artistic classic on the basis of its sole B-side alone, a nearly 17-minute long track called \"Murder Most Foul.\" Not since the Misfits' \"Bullet\" has someone made such profound art out of the Kennedy assassination. (As an aside, while writing this, we pulled up \"Bullet\" on YouTube for a little easy listening, and got a kick out of the following comment: 'Is this song meant to disrespect jfk?') There really is no reason that this song should work. It should come off as corny, or hagiography, or just forced--only, it doesn't. Maybe it's the absolutely lovely instrumentation that runs underneath it--the long, held notes on the strings and horns are appropriately funereal--maybe it's Dylan's beat poetry, or maybe it's the fact that it's an overlong closer, but this track is absolutely transfixing. It's the kind of closing statement many artists try to make at the end of an album. Few succeed. This is \"Last Call.\" It's \"Jungleland.\" It's \"Kids on the Run.\" It's \"Motion Picture Soundtrack.\" It's the kind of closer that you listen through an entire album to hear, because it's more powerful that way than it is on its own. It's the kind of track you listen to up late at night, by yourself, when you're not doing anything else at all. It feels like a statement about everything Dylan has been about, and it really, really lands.",
            "Spoiler alert: this record made our Top 10 of 2020 on first listen. It's that obviously outstanding."
        ]
    },{
        "song": "Remember",
        "artist": "Jodi",
        "spotify_id": "5oDRMJMrMhEuFq37stGFkW",
        "post_page": "2020-12-07",
        "description_lines": [
            "Sometimes we impress even ourselves.",
            "When we first came across \"Remember,\" it stood out to us as something we'd heard before. (Not the song itself, of course--we knew that was new. But like a feeling of deja vu you feel in a place you're sure you've never been, it felt <i>familiar</i>.) There was something about the nonchalant vocals, the endearingly overwritten lyrics (such as \"metacarpal karaoke\"), the old attic creakiness of the acoustic guitars and drum sets, the way that the same melody evolves and changes over bars and bars (like those syncopated 16th notes we get on the guitar) but never gets very far from where it began, that felt like something we'd been listening to for a long time.",
            "Was it DeYarmond Edison? That was part of it, but not quite. This was a little too raw, alive, and youthful for that. And then it hit us: Pinegrove. It never explodes the way certain Pinegrove tracks--c.f. \"Aphasia\"--do, but all of the pieces were there. And a quick Google search revealed that, indeed, \"Remember\" is an entry from a 2017 stand alone solo EP by former Pinegrove founding member Nick Levine. (Nick is the brother of Pinegrove drummer Zack Levine, who is responsible for, among other things, the incredibly on-point and tasteful drumming in <a href=\"https://www.youtube.com/watch?v=YnsiyiC0Nc0\">\"this live studio version of \"Aphasia\"\"</a>--check out 2:30 and 4:15-4:25 (that fucking cymbal choke, though...))",
            "So, yeah. Sometimes we can hear when music sounds like each other."
        ]
    }, {
        "song": "Bara du och jag",
        "artist": "Tove Styrke",
        "spotify_id": "0xfpnnU2xGRDfaAXLqe6Je",
        "post_page": "2020-12-07",
        "description_lines": [
            "As soccer fans the US over know, the road to alternative relevance runs through the leisures and pastimes of Europe. We're not much for soccer ourselves--lotta unnecessary plays--but we get our kicks too.",
            "One such kick in recent years has been Tove Styrke. Styrke, who got her break in 2009 when she finished as the third place contestant on Swedish Idol (this is real), went on to establish a solo career that eventually lead to 2018's absolutely fire <i>Sway</i>. Seriously, we know every beat and moment of this record. It may have been the only thing we listened to over the course of that entire year. This is another one to just do the whole way through, but if you must streamline, start with opener \"Sway\" and then move on to \"Mistakes,\" which is probably the best song ever written. (Then, check out <a href=\"https://www.youtube.com/watch?v=8AAD9CX0e-E\">\"another live studio version\"</a>, this time with Karl Almost Knausgaard on drums.)",
            "At any rate, we've been on the lookout for some new Tove Styrke for awhile now, but all we ever get is Tove Lo. Well, no longer. Because now we've got \"Bara du och jag\" (which, Reddit tells us, translates to \"Just You and Me.\" And even though the majority of the lyrics--aside from \"come dance with me darling\"--are in Swedish, it's definitely got that vibe.) This isn't as bare and cool as Sway. It's louder, broader, more of a mouthful, more earnest. The opening notes almost remind us of Love You Later's \"How Many Nights Do You Dance with Tears in Your Eyes?\" Pretty quickly, though, that plucky, ebby bass in the background is accompanied by a four-on-the-floor bass drum pattern that tells us things are going to get a little more upbeat than that. And indeed they do. Next comes a first pass at a chorus, and then a second, with more and more instrumental voices layering on. Pretty soon, the whole thing is plugging along behind a series synthy backbeat.",
            "Like we said, it's less cool and guarded than <i>Sway</i>. There's actually--dare we say it?--a hint of ABBA to the whole thing. And all of your friends down on the pitch will think it's bloody brilliant that you're listening to music in another language"
        ]
    }, {
        "song": "Good Girls (Don't Get Used)",
        "artist": "Beach Bunny",
        "spotify_id": "2yKNCN7jsi5XtwJL5jBG1z",
        "post_page": "2020-12-07",
        "description_lines": [
            "Longtime readers of the WMT just soiled themselves.",
            "That's right--we've got ourselves a new Coastal Rabbits track. The Oceanside Hares require no introduction here, especially after 2020's Honeymoon--which we fully expect to grace a lot of the aforementioned Top 10 lists around here. If you're somehow still unfamiliar, can we recommend \"Ms. California\" off of that record, as well as earlier tracks like \"Prom Queen\" and \"Sports\"?",
            "At any rate, for those who've been around the block, let's talk about \"Good Girls (Don't Get Used).\" There's a lot of classic Beach Bunny here: youthful female vocals, shimmering arpeggiated chick pop guitar parts, punchy driving drums with a tom-tom-forward interlude, and lyrics lifted straight from a high school diary. Here's where we actually find the biggest change. Because unlike the earlier tracks we mentioned above, lead singer Lili Trifilio is no longer singing about her shortcomings or the girls that got the guy she wanted--now she's taking aim at Chad himself.",
            "By the way, not this is at all relevant to anyone we know, but Beach Bunny are scheduled to perform in Paris, France on April 19th, 2021. Just sayin'."
        ]
    },{
        "song": "What Are Friends For?",
        "artist": "The Sonder Bombs",
        "spotify_id": "64F2l136oePmUwOG9zB1vU",
        "post_page": "2020-11-30",
        "description_lines": [
            "Speaking of pop punk, check out this track by The Sonder Bombs. (Fun fact from the band's website: \"sonder\" itself is a noun which apparently stands for the feeling that comes with the realization that all of the strangers around you are living lives as rich and meaningful--not necessarily in a good way--as yours.) This is fun, energetic, sad chick pop punk that sounds like a threesome between Beach Bunny (aka Coastal Rabbits), Sincere Engineer (aka Heartfelt Architect), and Snarls (good luck on that one), all of whom have graced places atop the WMT in weeks past.",
            "Our one minor complaint with this one is that we think it might've been better served by a more lo-fi approach. It feels a little produced at times, but is nevertheless highly listenable and seems to possess a strange power over the \"repeat\" button."
        ]
    }, {
        "song": "What Year Are We In",
        "artist": "Kitten",
        "spotify_id": "1jkCLNfGQJgymKExs4MGZs",
        "post_page": "2020-11-30",
        "description_lines": [
            "Kitten are stars of the WMT. \"Memphis\" (not to mention its acoustic follow-up) remains one of the best and most infectious songs we've ever had the privilege to cover, and the group took a turn towards <i>la resistance</i> with the COVID-era herd immunity anthem \"My House.\" (The cover art to that single depicted a nude demented looking version of the group's lead singer stuffed into a miniature-sized house and the lyrics explained  that \"I'm watchin the world freakin out from my couch/Don't know what they're talkin about in my house/I wanna have fun again, I wanna go out/But they told me to stay in my house.\") Now, Kitten continue their turn toward far-right extremism with another banger entitled \"What Year Are We In,\" which talks about the hopeless nature of protests, Zoom parties, and getting pissed off over conspiracy theories.",
            "As far as the sound, it's got a bounce to it. There are some synthy keys and horns, not to mention a drum machine, that make the whole thing sound like an updated '80s throwback, which fits in well with the name and theme. There are other parts of the track that remind one of Madness (and, of course, \"[Their] House\"). In the end, one of the things that really interests us about Kitten is that, of the four tracks of theirs which have made it onto the WMT, they're all bangers, but they all sound totally different"
        ]
    }, {
        "song": "Hurt Me Now",
        "artist": "ASL",
        "spotify_id": "6tDrZQQhEWrHsYafpziiwg",
        "post_page": "2020-11-30",
        "description_lines": [
            "a/s/l? (only kids from the '90s will get it!!!)",
            "Anyway, we stumbled across this track, from a group that seems only to have been making music since about 2018, over the course of this past week. It should be kind of a mess of a track, with lots of heavy synth, drum machines, tons of reverb, misplaced horns, and a borderline hip hop/spoken word chorus, but all of it comes together in a surprisingly pleasant way. This isn't a banger--it's not one that's going to carry you away immediately. It's got the vibes of Robbi Robb's \"In Time\" but without the power and meaningfulness. But if Blood Orange's \"Time Will Tell\" is the perfect track for a postgame a deux, then \"Hurt Me Now\" might work best for its melancholy solo equivalent."
        ]
    }, {
        "song": "Empty (Dirt Road)",
        "artist": "Metric",
        "spotify_id": "7z7PeijP5wMkEWHvTrWKer",
        "post_page": "2020-11-23",
        "description_lines": [
            "Metric are, as an act, nearly as old as us, and yet they are also relatively unfamiliar to us. We've heard of them, of course, and they seem to be favorites of a lot of our fellow travelers, but we've never really listened to them at all.",
            "Well, in 2005, they released in album called <i>Live it Out</i>, which opened with a track called \"Empty,\" which we've never heard before. We bring this up because, recently, they released an acoustic version of this song which came across our desk. \"Empty (Dirt Road),\" as this version is called, is pretty nice. It opens with a creaky, antique-y finger-picked acoustic guitar, a pretty resonant-sounding piano, and a whole lot of reverb. The track stretches and pops its' knuckles in ways that remind us of Marlon Williams' \"Strange Things\"--which you may recognize from the soundtrack of <i>Wild, Wild Country</i>--but without any of the creeping, old-timey eerieness of that track. Instead, what we've got here is melancholy, almost like Williams meets Jewel meets, at times, The Weakerthans.",
            "One of the things we like about this song is how long it lasts. It feels almost oppressive--it just goes on and on, and eventually resigns itself to its final, unbelieving refrain: \"I'm so glad I'm an island now\" [via Paul Simon and Garth Brooks]."
        ]
    }, {
        "song": "Walking on a String (Alt. Version)",
        "artist": ["Matt Berninger", "Phoebe Bridgers"],
        "spotify_id": "4k4VlcZtwPBDj6wx5ewzog",
        "post_page": "2020-11-23",
        "description_lines": [
            "Because Phoebe Bridgers is one of our favorite young artists, anything to which her name is attached is of immediate interest to us. In 2019, Bridgers collab'd with The National's Matt Berninger to record a track called \"Walking on a String.\" They released two versions of the track--the original and the \"alt version.\" The first one is a little more Berninger-forward, while the alt version is more Bridgers-forward, and, since we like Phoebe Bridgers more than we like The National, the alt version is our version of choice. It really sounds like it could have been a hidden track on 2018's <i>Stranger in the Alps</i>. (If, by some unfortunate turn of events you haven't yet experienced <i>SITA</i>, you've got something great coming. It's a solid listen-through, but \"Motion Sickness\" and \"Scott Street\" are early Stan Doubts.)"
        ]
    }, {
        "song": "Special Berry",
        "artist": "standards",
        "spotify_id": "6wQxjMRiJ9uqCiJSV5yAU7",
        "post_page": "2020-11-23",
        "description_lines": [
            "Call it what you will: math rock, post-rock, whatever you want, standards is apparently an Ezra Koenig-lookin' motherfucker with a guitar, but he does a lot with it. This track reminds us a lot of Fang Island, or the happy-go-lucky younger brother to Joan of Arc, or even, at times, STS9. It's basically a single guitar riff extended to about 3 or 4 minutes and length and constantly recycled and reinterpreted according to different genres, techniques, and tempos. Think of it as an organic \"Grape Soda.\"",
            "This dude also has a vibe. If you check out the music video for standards, you'll note his, again, Ezra Koenig face, his cutesay fingerboard inlays, and his array of stuffed animals. It extends to the cover art for his (their?) recent record, <i>Fruit Island</i>, as well."
        ]
    }, {
        "song": "Prior Things",
        "artist": "Hop Along",
        "spotify_id": "3X2899UzmQjl7gz0JsH42k",
        "post_page": "2020-11-16",
        "description_lines": [
            "This one came to us via shuffle, and although we'd never heard of Hop Along before--and had, admittedly, to clarify which phrase was the band name and which was the song title--it felt really familiar. It has a nice, comfortable, strumming-on-an-acoustic-guitar momentum to it (though with a little buried bit of the sort of string-forward frenzy that's showcased on tracks like, say, \"Burn the Witch\" by Radiodome), and the unusual particulars of the lead female vocals reminded us of Francis Quinlan, who appeared on the WMT earlier this year with \"Piltdown Man.\"",
            "Indeed, a quick Google search reveals that \"Piltdown Man\" is one of Quinlan's solo efforts, and that, as a day job, she fronts Hop Along. So, look at us. This track doesn't grab us as much as \"Piltdown Man\" did--that one felt like it was written after spending some time with Joanna Newsom's Divers (which, speaking of spending time with, is worth about 8 months of your time)--but it's not nothing, neither. "
        ]
    }, {
        "song": "Runaway Dog",
        "artist": "Retirement Party",
        "spotify_id": "75ZI6agJsfrauG2Az6myJK",
        "post_page": "2020-11-16",
        "description_lines": [
            "We'll start by saying that you've got to give this one a minute. When it first opens, it does so over about a minute of a coughy, polluted guitar and bass riff, but this is like one of those indie tracks from the early-to-mid aughties that builds and builds and builds. In that respect, it almost feels like Funeral-era Arcade Fire, but like, if they had just discovered distortion and were, like, mildly about it. All in all the best part of this track is the outro, when the same forward momentum that's been building throughout the entire track barrels down on you underneath a desperate, arpeggiated...is it synth? is it guitar?...riff.",
            "Once that first minute is over and the song starts to bloom, you'll get the idea pretty quickly. From there, you can make up your mind for yourself or not as to whether to keep things going."
        ]
    }, {
        "song": "Over You",
        "artist": "HOLYCHILD",
        "spotify_id": "0O9AJJwRYvtiVGMceCC7lF",
        "post_page": "2020-11-16",
        "description_lines": [
            "We deliberated over this one for a while. But, in the end, what's to deliberate over? It's a big, synthy, bombastic, chick-driven pop song, and isn't that what we're mostly about here at the WMT? The verses here plod along atop a four-on-the-floor drum beat. That pattern continues into the choruses, of course, but it's joined by an explosion of shimmery synth parts that really take everything over the top. Just over halfway through, we also get a nice interlude that tamps things down in a way that feels middle school meaningful.",
            "Who do they sound like? There's so much going on here that it's a little hard for us to tease it out. It's like a big sloppy mess of bubblegum Robyn and indie Ting Tings and Spiceworld-era Spice Girls. (The Weekly Music Thread--it's like wine tasting, but for random songs from Spotify.)",
            "And, for what it's worth, Wikipedia tells us that, back when they were together, HOLYCHILD were \"known for their use of pubic hair in music videos.\" But, then again, who isn't?"
        ]
    }, {
        "song": "two reverse",
        "artist": "Adrianne Lenker",
        "spotify_id": "630Ts93UYV4ULSjsBDQdvn",
        "post_page": "2020-11-09",
        "description_lines": [
            "Adrianne Lenker, best known for fronting Big Thief, has recently started releasing solo music, and this track (the opener to 2020's songs) is one which really grabbed us. A ballad driven by intricate, vaguely dissonant, and at-times-finger-picked strings, it feels like Big Thief (duh) meets Joanna Newsom meets recent Tallest Man on Earth. It's beautiful but melancholic, peaceful but with a touch of quiet frenzy to it, too. You best believe that this track is going to kick off on our part an exploration of more of Lenker's solo work."
        ]
    }, {
        "song": "faith healer",
        "artist": "Julien Baker",
        "spotify_id": "2hNXb6IDn3CvvHjjwauEM3",
        "post_page": "2020-11-09",
        "description_lines": [
            "We've been big fans of Julien Baker ever since she burst onto the scene with 2015's <i>Sprained Ankle</i>. (If you haven't already, listen to that whole record straight through, but if you must pick favorites, we recommend the eponymous \"Sprained Ankle,\" \"Everybody Does,\" \"Something,\" and the elegiac \"Go Home.\" Like Justin Vernon and Kristian Matsson, Baker's got a thing for ending guitar records with piano tracks.)",
            "Like Phoebe Bridgers (with whom she collabs in the form of Boygenius), Baker is following up soft-spoken success with louder, more electric efforts. And although \"faith healer\" definitely retains a lot of the beauty of Baker's earlier work, \"louder\" is definitely the right word--the track is, at times, downright cacophonous (relative, of course, to Baker's other work). This song feels more confident than anything else she's released before. We look forward to seeing where that goes."
        ]
    }, {
        "song": "Killing Floor",
        "artist": "Emma Ruth Rundle, Thou",
        "spotify_id": "7CdVWqLUcMrFQH2fakdhRi",
        "post_page": "2020-11-09",
        "description_lines": [
            "The first track on this week's list to receive proper capitalization, \"Killing Floor\" is a little different from the usual fare on the WMT. It opens with nearly a minute of spectral, synthy tones which sort of evoke Disintegration-era The Cure or William Basinki's Disintegration Loops. At nearly the one minute mark, however, we break into a synthy, sludgy, metallic lurching sort of drone which creeps its way along for the next five or so minutes. We're not sure if this one will stick or not, but it's a really cool track (and the cover art for the record is really cool)."
        ]
    }, {
        "song": "Television Romance",
        "artist": "Pale Waves",
        "spotify_id": "2diAlJqrMMX7Sv9FlzcUMc",
        "post_page": "2020-11-09",
        "description_lines": [
            "The title and band name alone were almost enough to land this track on the WMT. Come on, look at 'em--you just knew this was going to be up our alley.",
            "\"Television Romance\" is an instant banger. Even before you've heard the chorus, you know it's going to be an infectious synth pop dance anthem. It's got that organic, unsophisticated synth sexiness of, for example, a \"Kim and Jessie\" or a \"Graveyard Girl\" or a \"Hearts Like Ours.\" In all of these cases, what makes the refrain captivating is less its lyrical content and much more some sort of guitar and/or keys hook, and the same is true here. (That being said, repeating the phrase \"television romance\" over and over again has its own intoxicating adolescent import.)",
            "This song is like the soundtrack to some imagined, less affecting prequel to <i>Bright Lights, Big City</i>"
        ]
    }, {
        "song": "Wheels Roll Home",
        "artist": "The Antlers",
        "spotify_id": "1KtWevswskSNR37e8hi9iC",
        "post_page": "2020-11-09",
        "description_lines": [
            "What? Yes. New music from The Antlers--this is exciting stuff.",
            "As you may or may not recall, The Antlers released the single greatest album of all time in 2009's <i>Hospice</i>. Seriously. If this hasn't affected you, take the next 18-24 months and listen to it almost exclusively, just like we did. Not impressed on first listen? Okay. Join the club. Listen to it a second time. \"Oh, yeah, I guess 'Bear' and 'Two' are pretty good.\" Oh, do you? Listen to it a third time. \"Oh Sylvia is kind of cool, too, I guess.\" That so? Do it again and again and again until you begin to realize that every single moment of that record is more important than the most important moment of your life. But that's okay, because by that time, every single moment of that record will be a moment of your life, too.",
            "At any rate, after Hospice, The Antlers went on to release <i>Burst Apart</i> (2011), <i>Undersea</i> (2012), and <i>Familiars</i> (2014). Then, tragically, they stopped making music. In March of last year, however, rumors surfaced that they were recording again, and last week frontman Pete Silberbro and drummer Michael Lerner released the single \"Wheels Roll Home.\" Per Silberdude, \"'Wheels Roll Home' is a simple song about the hopeful promise of reunion after a long time gone. It's that feeling of finding home in someone, eager and impatient to build a life together. It's the experience of waiting out tumultuous times, longing for stability someday.\" As Timothee Chalamet might say, \"ca fait longtemps.\"",
            "As far as the track itself goes, it's very <i>Undersea/Familiars</i>-wave, but we're not complaining. We're looking forward to the full-length. In the meantime, as the temperature continues to go down, we plan on spending yet another winter--our twelfth straight--with <i>Hospice</i>."
        ]
    }, {
        "song": "Trust Me",
        "artist": "Sincere Engineer",
        "spotify_id": "72rJBBioVhxm4A3XajM3Yn",
        "post_page": "2020-11-09",
        "description_lines": [
            "For more on Sincere Engineer, check out this week's <i>Up the Punx</i> installment below.",
            "As for this track in particular, \"Trust Me\" is a 2020 single which we hope heralds the appearance of a full-length (or at least a few more singles) on the horizon. This is a little darker and more emo-informed than Sincere Engineer's earlier works, and the production is certainly more polished as well. To be frank, we'd actually recommend starting with 2017's <i>Rhombithian</i> (just see below already!) and then coming back to this emo banger. But you really can't go wrong--these guys make very solid garage punk music."           
        ]
    }, {
        "song": "SGL",
        "artist": "Now, Now",
        "spotify_id": "3speBfGPCck1oe47EBPnhh",
        "post_page": "2020-11-02",
        "description_lines": [
            "Although we're not familiar with this group, they seem to have something of a discography (along with something of a following). At any rate, this track, \"SGL\"--which presumably, based on the lyrics, stands for \"shotgun lover\"--is worth at least a few listens. There's a warmth to the recording effects on the eighth note acoustic guitar strumming that backs the whole thing, and it feels almost like the War on Drugs meets Phoebe Bridgers meets Washed Out? But that doesn't quite put a finger on it, does it?",
            "Also, the music video, which is almost nothing, is also somehow strangely affecting..."
        ]
    }, {
        "song": "Nobody Loves You",
        "artist": "Similar Kind",
        "spotify_id": "4hlQeZJV29wKrTPLmqXkab",
        "post_page": "2020-11-02",
        "description_lines": [
            "In contrast to this week's other offering, Similar Kind are a group with a small discography and a small following (less than one-tenth of the monthly listeners of Now, Now). That being said, this track is an infectious one. It carries forward with what feels like a hi-fi version of Flake Music energy, and there's a touch of The Cure in some of the guitar runs you'll hear in the background. Interestingly, the drums are a little bit busier than you typically get on this sort of track, and the mix is surprisingly bass-forward, but all of those contribute to a frenetic energy which kind of meshes with the lyrical content."
        ]
    }, {
        "song": "Easier to Love",
        "artist": "Kississippi",
        "spotify_id": "3GqVIRlygsC48rklRcAHTb",
        "post_page": "2020-10-26",
        "description_lines": [
            "We're newcomers to Kississippi. We've seen the name around but have never really gotten into them. We decided to give them a spin this week, and came across these two tracks.",
            "\"Easier to Love\" has a little bit of a Beach House vibe to it, what with the washed-out tremulousness, crisp and clean hi hat notes, and glassy, staircase-climbing guitar parts. But there's something else to it, too, almost like early Pure Bathing Culture.",
            "\"Around Your Room\" is a harder track. Right off the bat, it's got a fat, serious bass line, and it pairs it with big ass percussion. About the bass line--it's like something off of the Drive soundtrack. That being said, nothing else here really is. If \"Easier to Love\" was like Beach House + Pure Bathing Culture, \"Around Your Room\" is like Heartthrob-era Tegan and Sara + Lover-era Taylor Swift. (In fact, listening to \"Around Your Room\" and \"Cruel Summer\" back-to-back, there's a definite harmony there.) So, you do the math."
        ]
    }, {
        "song": "Around Your Room",
        "artist": "Kississippi",
        "spotify_id": "37C77C5KP3MZINt2P3HZUv",
        "post_page": "2020-10-26",
        "description_lines": [
            "We're newcomers to Kississippi. We've seen the name around but have never really gotten into them. We decided to give them a spin this week, and came across these two tracks.",
            "\"Easier to Love\" has a little bit of a Beach House vibe to it, what with the washed-out tremulousness, crisp and clean hi hat notes, and glassy, staircase-climbing guitar parts. But there's something else to it, too, almost like early Pure Bathing Culture.",
            "\"Around Your Room\" is a harder track. Right off the bat, it's got a fat, serious bass line, and it pairs it with big ass percussion. About the bass line--it's like something off of the Drive soundtrack. That being said, nothing else here really is. If \"Easier to Love\" was like Beach House + Pure Bathing Culture, \"Around Your Room\" is like Heartthrob-era Tegan and Sara + Lover-era Taylor Swift. (In fact, listening to \"Around Your Room\" and \"Cruel Summer\" back-to-back, there's a definite harmony there.) So, you do the math."
        
        ]
    }, {
        "song": "Die Waiting",
        "artist": "Beck",
        "spotify_id": "4qAGr8V6mMg9itQpzcIB38",
        "post_page": "2020-10-26",
        "description_lines": [
            "Beck is one of those artists we've always wanted to explore more. We spent a lot of time with Midnite Vultures (1999) for about two weeks in Boston, but past that, we've never really given the man his career's due. Perhaps one day.",
            "At any rate, we stumbled across this track, from 2019's <i>Hyperspace</i>, and quite liked it. (By the way, check out that album artwork.) It's a pretty mellow track and you get the hang of it quite quickly, but it's nice for driving around with the windows down when it's about 65 degrees outside and you vibin'."
        ]
    }, {
        "song": "The Whole of the Moon",
        "artist": "Kirin J Callinan",
        "spotify_id": "1601brj4nGFEWeOxe7KJuk",
        "post_page": "2020-10-26",
        "description_lines": [
            "This track comes to you courtesy of the dialysis queen of Durham. A musician who says that his primary motivation is to \"excite and confuse,\" Callinan makes these big, bombastic '80s informed anthems. This is a track which bounces along on its spritely synth and arena drums, but what we really like about it is the way Callinan strains when he reaches for certain notes. That, along with the soaring feeling of some of the guitar parts, really reminds us of John Parr's \"St. Elmo's Fire.\" (Interestingly, \"St. Elmo's Fire,\" which is the best song ever made, was written for the original soundtrack to <i>St. Elmo's Fire</i>, which is the worst movie ever made.) There's also a little bit of Robbie Robb's \"In Time\" here. (Interestingly, \"In Time,\" which is also the best song ever made, is part of the original soundtrack for <i>Bill and Ted's Excellent Adventure</i>, which is a pretty good movie.)"
        ]
    }, {
        "song": "Hate Mail (feat. J Mascis)",
        "artist": "Weakened Friends",
        "spotify_id": "6h5BX0HE5FoqrCP3xW8Txl",
        "post_page": "2020-10-26",
        "description_lines": [
            "We've had this track on repeat all week. It's a grungy, chick-fronted alternative track that features former Dinosaur, Jr. J. Mascis on a pretty squealy/shreddy guitar part. The verses have this sort of round, redundant, trundling feel to them, but transition into these sublime sing-along choruses heralded by some buried but reliable guitar scratches.",
            "Elements of this remind us of a much more laid-back and approachable White Lung. More on that below."
        ]
    }, {
        "song": "Wingspan",
        "artist": "Prinze George",
        "spotify_id": "5OftW7uxP2Z2rtbfkAbVjq",
        "post_page": "2020-10-19",
        "description_lines": [
            "This is a group we hadn't heard of before, with a few singles and a 2016 full-length by the excellent name of <i>Illiterate Synth Pop</i>. We'll investigate that one more fully in the week to come. As for this track, it's a pretty mellow, bassy ballad. It reminds us a little bit of Miel with a touch of that M83-style synth in the interlude. The track kicks up a little bit in the latter third with an octave jump in the vocals. There's nothing super stand-out here but it'd be fitting on a vibe playlist."
        ]
    }, {
        "song": "Only Acting",
        "artist": "Kero Kero Bonito",
        "spotify_id": "4aIoxZWHySrA3BpnmeREXJ",
        "post_page": "2020-10-19",
        "description_lines": [
            "Sometimes it seems like we've always been floating in the same orbit as Kero Kero Bonito. That being said, we've never really listened to them--until now.",
            "\"Only Acting\" is a track off of their 2018 <i>Time 'n' Place</i>. It opens up with a sing-song vocal melody over a drum machine and follows up by layering a bass line on top of that. This repeats for a while in a way that doesn't particularly grab you as a listener--until the entire track switches to a lofi take on organic instrumentation. At this point, the exact same arrangement feels utterly irresistible ,and we imagine it's hard to listen to on anything other than high volume (we haven't tried).",
            "It takes balls to break away from something so catchy, and KKB do exactly that. The song oscillates back and forth between this sort of pissed off daughter of Weezer vibe and a progressively cacophonous and electronic disintegration. Yes, there's a key change, but KKB undermine it almost immediately with aggressive glitching which heralds the end of the track. Although it's annoying to be taken away from the super infectious, driving side of this song, the whole thing kind of works, and we've listened to it in its entirety more than a few times at this point."
        ]
    }, {
        "song": "Hit Me Where It Hurts",
        "artist": "Caroline Polachek",
        "spotify_id": "2wcrQZ7ZJolYEfIaPP9yL4",
        "post_page": "2020-10-19",
        "description_lines": [
            "Back in 2019, Caroline Polachek's <i>Pang</i> appeared on a list of \"Best of\" lists, but we were never really able to access it. We're not sure whether or not that's still the case, but we came across <i>Pang's</i> \"Hit Me Where It Hurts\" last week and really liked it. It's got a dreamy, synthy, barred out borderline spoken word chorus melody that's vaguely reminiscent of Das Racist's \"Fashion Party,\" but this song isn't as light and tongue-in-cheek as that one is. The pre-chorus and chorus make that clear.",
            "This is a track that's at home on the same playlist as \"Wingspan,\" above."
        ]
    }, {
        "song": null,
        "artist": "Chumped",
        "album": "Chumped",
        "spotify_id": "7pVKWe8jRWOYxsnfhRoCci",
        "post_page": "2020-10-19",
        "description_lines": [
            "Chumped is a 2013 EP from the defunct, Brooklyn-based pop punk outfit of the same name. We encountered it this week for the first time and it really grabbed us. It's evocative of early Alkaline Trio meets The Ergs! meets maybe a little bit of Charly Bliss?--or at least that's the best we can do here. It's got a charming level of underproduction to it, and there's real energy and feeling behind these tracks."
        ]
    }, {
        "song": "Cancer in the Water",
        "artist": "Clarence Clarity",
        "spotify_id": "2aHWWqD3ceKgFff07klSUg",
        "post_page": "2020-10-12",
        "description_lines": [
            "If you have trouble finding this track, it's because the \"TM\" in the title is actually superscripted, not parenthetical. We just couldn't figure out how to do that in Gmail.",
            "At any rate, we stumbled across this track this week, and it exists somewhere at the intersection of crunchy and fun. The whole thing is basically one big loop, right down to the vocals: \"Before I get out/I'll put cancer in the water/before you got out/you left cancer in me.\" Whatever that means precisely is beyond us, but it's clear that it means <i>something</i>. (There are those on the internet who think the song is about the fluoridation of the water supply [via How I Learned to Stop Worrying and Love the Cancer in My Water].)",
            "As that Radioguts-wave lyrical loop burrows its way into your thoughts, the rest of the track expands to occupy your earballs. It's carried along by a jaunty little melody that whirrs and clicks, beeps, shudders, and groans, but never strays too far away from its catchy base. It feels a little bit like Baths meets Katie Dey (but we repeat ourselves) meets Passion Pit. (And if you don't know Katie Dey, who appeared on this thread a month or two back, may we please recommend \"Darkness\"?)",
            "Guys, this one is an obvious choice. It's not going to change lives but it'll certainly enhance any carefree day."
        ]
    }, {
        "song": "Finally Found",
        "artist": "Graveyard Club",
        "spotify_id": "2UyQA6lJdRSJXprPtvJrds",
        "post_page": "2020-10-05",
        "description_lines": [
            "A familiar favorite, Graveyard Club have appeared on the WMT before for the excellent \"Witchcraft,\" \"Cellar Door,\" and \"Valens.\" Well, we were revisiting them this week, and we stumbled upon another keeper: \"Finally Found.\" This track, from 2019, eschews the M83 synth fuzz of some of those others in favor of a serious, almost '50s doo wop sensibility, replete with those \"2and...4\" snare notes. It'd be at home in a David Lynch re-make of <i>Grease</i>."
        ]
    }, {
        "song": null,
        "album": "Live Forever",
        "artist": "Bartees Strange",
        "spotify_id": "4Lu520UvMf7lJccCnKw3hJ",
        "post_page": "2020-10-05",
        "description_lines": [
            "This isn't the first time Strange has appeared on the WMT. A budding solo artist, Strange has been releasing singles over the past month or so--most notably, \"Mustang\" and \"Boomer\"--in anticipation of his first full-length original solo album, Live Forever. (We've been really, really hot on those two tracks, by the way.) Well, <i>Live Forever</i> has dropped in the past week, and we've had time to give it a listen or two since it did.",
            "This is an interesting, if loose, record. It sounds almost like one you discover after getting into an artist's later work, then going back and revisiting their early stuff and telling your friends, \"Yeah, but have you listened to his early stuff? Some of that's pretty cool, too.\" The record kicks off with a creaky and ethereal track, \"Jealousy,\" which as a stand-alone doesn't seem to stand for all that much (which, according to our co-workers who are really into mainstream politics, means it will fall for anything.) Where \"Jealousy\" mostly makes its money is as a lead-in to second and third tracks \"Mustang\" and \"Boomer,\" which retain some of the creakiness but up both the amplitude and the tempo. These were the two singles we were most excited about in past weeks, and they're the by far the standouts on our early listens. They've both got that National desperation that marks the best of Strange's solo tracks. After that, the record travels into Strange's third single, \"Kelly Rowland,\" which, aside from its interesting sample, never captured us as much as the other two did.",
            "The next two tracks, \"In a Cab\" and \"Stone Meadows,\" mostly sound like less fully realized versions of Strange's other signals. Things take a turn, however, with \"Flagey God,\" which, atop a vaguely subterranean house music backbeat, manages to sound something like a cross between a haunting and an R&B single. From there, the rest of the back half of the record is much, much looser than everything that came before it. Several of the tracks are essentially just strings and vocals with synth landscapes slothing around behind them.",
            "On the whole, we don't exactly know what to do with this as a record. There's a lot we really like here--the whole thing has a roomy sort of unsettling noisiness to it, like a beautiful jalopy bumping and trundling through an eerie and unfamiliar fog. You can't quite make out where different sounds are coming from, whether they'll repeat or not, whether they have anything to do with the melody at all or whether they're just window dressing. But this is as much a strength as it is a weakness, and we if Strange will find a more effective way to consistently harness it moving forward."
        ]
    }, {
        "song": "My Trust is Low",
        "artist": "M4ts00n",
        "spotify_id": "6ZPzJi1KcV2M1KY3EkNa2K",
        "post_page": "2020-09-28",
        "description_lines": [
            "This is a really neat track. It's a creative, repetitive, stripped down loop that evokes The Books and, with its mixture of twangy strings and synth chords, almost an Uncle Kracker pop country vibe, if you will. Like a Kerouac novel, you'll get the idea about 30 seconds in, and decide that you either love it or hate it. (Unlike a Kerouac novel, on the other hand, we like this.)"
        ]
    }, {
        "song": "S.W.I.M.",
        "artist": "Midwife",
        "spotify_id": "41qO4ILS1Gm4A1Szf25pz3",
        "post_page": "2020-09-28",
        "description_lines": [
            "The first thing we noticed about this track is the title. \"S.W.I.M.,\" for those not in the know, is an extremely clever acronym--Someone who isn't me--that people use on Reddit when they want to inquire about drugs. Law enforcement haven't figured it out yet, and defunding of the police is likely to put that understanding even further out of reach, but stay tuned. They may surprise us yet.",
            "At any rate, the second thing we noticed about this track is this track. The whole thing is heavy, a big fuzzy blanket of synth, but like under that blanket you're on an Ambien as well. The track feels like warm water washing over you, the rhythmic eighth notes ebbing and pooling around your outline as you lay on your back in the lazy surf. This one is for feeling meaningful. It's fitting that the vocals are so obscured that you can barely understand them-- you don't need to. You can't make out the words from where you are, underwater, but it doesn't matter--you already know what they mean. And we have this feeling like the water motif here is about rebirth. Like an addict who has freed himself from the cycle, one you read about once, in a long novel that you really liked, laying in the water on the beach as the tide rolls in and out, in and out, in and then out again. And he just lays there.",
            "(If you can't tell, we're listening to it as we write this.)"
        ]
    }, {
        "song": "Keep It Up",
        "artist": "Niko Noki",
        "spotify_id": "0hluOHimkaXBe4s8yO990Z",
        "post_page": "2020-09-22",
        "description_lines": [
            "The only really lasting thing to come out of Cuties. Early on in the film, the protagonist discovers a group of 11-year-old dancers, and films them as they offer signature dances to this track. It's fun and benign--we actually remarked out loud \"this film seems totally benign!\" (Like Lars von Trier's <i>Antichrist</i>, though, things eventually take a very dark turn--the controversy, if a little over blown, is still somewhat warranted.) At any rate, this track is an original which was made for the film.",
            "It's a fun, bouncy, dance pop track. It sounds sort of like if the Spice Girls were around today as a Tik Tok group, and their music was a captcha. The strong back beats and crowded rhythms offer a lot of texture to dance against, which is probably why it was selected for the scene it was used in. That being said, it's not clear to us whether the track can stand on its own apart from the film. It feels a little dinky on its own, a little flimsy--sort of like Less than Jake's \"We're All Dudes.\" Infectious when you hear it along with the movie's characters, but lacking when you don't."
        ]
    }, {
        "song": "Bye Bye Bye",
        "artist": "Brian Robert Jones",
        "spotify_id": "6qZyIToSdYKFhf58IFK9GW",
        "post_page": "2020-09-22",
        "description_lines": [
            "Brian Robert Jones (of Vampire Weekend fame) is celebrating the 20th anniversary of NSYNC's <i>No Strings Attached</i> with a synth- and vocoder-heavy re-release of <i>the entire album</i>. The entire thing just dropped, but we haven't had time to make our way through all of it. (And, frankly, we're not as familiar with some of the non-hits on it.) \"Bye Bye Bye,\" however, works surprisingly well in this format. It's actually a lot more interesting than the original arrangement.",
            "This is better than as good as covers get. Most covers are just carbon copies of the original track you loved, but because they're not exactly the same as the song you loved in the first place, they feel degraded. Then there are covers that aren't particularly <i>good</i> but at least deserve credit for doing something wildly different. This is the rare cover that, as recognizable as the original is, doesn't feel like a cover. It feels like its own track. It's honestly hard to believe it isn't. It just works so damn well."
        ]
    }, {
        "song": null,
        "album": "Love in the Time of Email",
        "artist": "Antarctigo Vespucci",
        "spotify_id": "0fB20lk7IujnEMO26kFGHa",
        "post_page": "2020-09-22",
        "description_lines": [
            "Sometimes, you uncover a hidden gem. This is one of those times.",
            "First of all and right off of the bat--here's another inductee into our Names Hall of Fames. Could've gotten in on the band name alone, but that record name is just...exquisite.",
            "Now for the music. This is a fun, laid-back, non-threatening indie pop collection that captures elements of Matt and Kim, and Brandon Flowers' solo work. Maybe a touch of the whimsy of Weezer as well? At any rate, it's great. It shines. It glistens. It tastes a little like bubble gum in our mouth. Big league chew.",
            "The opener, \"Voicemail,\" is a surreptitious introduction, but the record really wakes up on \"Kimmy.\" On the third track, \"White Noise,\" the pre-chorus and chorus hand claps give the whole thing an almost throwback, sing-a-long '50s feel, but the trembling guitar interlude sends us forward to <i>Contra</i>-era Vampire Weekend. \"Breathless on DVD\" shimmers as well, and pokes fun at pseudocinephiles and their Jean-Paul Belmondo affectations.",
            "About halfway through the record, \"So Vivid!\" and \"Freakin' U Out\" turn up the fuzz and add a pop-punk edge to the album, as though these guys listened to the Larry Arms on the way to the studio that day or something. The rest of the record is, for the most part, a little quieter after that, until the outro, \"E-Mail,\" takes us back to where \"Voicemail\" kicked things off in the beginning.",
            "Solid cover art, too, by the way."
        ]
    }, {
        "song": "Ambrosia",
        "artist": "Rosie Tucker",
        "spotify_id": "17PBeLUldWC941sX8Ffmkd",
        "post_page": "2020-09-14",
        "description_lines": [
            "This is a neat little track by a pretty recent artist. It's got gloomy, underwater guitar chords which bubble beneath a crystal clear and front-foot-forward female vocal track. Its slow pace and occasional half-step movements are really nicely punctuated by little vocal licks that run back to the one (\"cover dish and chilllll for awhile\"). Those few moments really make the track, and you find yourself listening for them specifically on repeat takes.",
            "This one reminds us of another recent WMT entry, Frances Quinlan's \"Piltdown Man.\" (\"Six AM so loud your mom/HAD to kick us out.\") This week's WMT is short, so go ahead and re-visit that one while you're at it."
        ]
    }, {
        "song": "Pleasure Line",
        "artist": "Video Age",
        "spotify_id": "2XlQCGzPPXX7e8KA3pIBBT",
        "post_page": "2020-09-14",
        "description_lines": [
            "Video Age, indeed. From its opening moments, this track is squarely rooted in the kind of faux '80s nostalgia that started emerging ten years ago and hasn't quit since. It's got dreamy synth melodies, shifting sixteenth note hi-hat shimmies, and rubber band guitar chords that kick in with each chorus. It sounds like Hall and Oates meet Miguel Jackson with just the slightest sprinkle of vaporwave influence.",
            "For what it's worth, their guitarist looks like a cross between Danny Pudi and Adam Driver"
        ]
    }, {
        "song": "Lavender Boombox",
        "artist": "Miniature Tigers",
        "spotify_id": "04TOyd9HCUL8do2srcIyXY",
        "post_page": "2020-09-07",
        "description_lines": [
            "Between the dreamy saxophone and the cool, breathy, effortless vocals, there's a distinct Destroyer vibe to parts of this track. They collide really interestingly with the rest of the instrumentation, which has a sort of organic take on vaporwave, if we may. It's sort of like if Dan Bejar was making music in high school in like 2018. The consistent clap/snare sounds on the back half of each bar give the whole thing a real sense of momentum. The track rides on like that until just past the halfway mark when things go quiet and slow and fingerpicked, before coming back in with some vaguely Caribbean upstroked chords and a spicy sax solo."
        ]
    }, {
        "song": "Ruin (My Ride)",
        "artist": "Hovvdy",
        "spotify_id": "6JduePL4y2un1UAuTNSBHE",
        "post_page": "2020-09-07",
        "description_lines": [
            "This one is a little tricky to place. There are parts of it that remind us of <i>Blink-182</i>-era Blink-182 (think \"I Miss You\")--the distant vocals, the vaguely Tom DeLonge tinge to the vocals, the inorganic drum tracking--but there are also parts of it which feel very '90s rock. (Not that Blink-182 aren't themselves some form of '90s rock, but don't play dumb--you get what we mean.)",
            "Separately, we think that Hovvdy should open for Alvvays before a screening of <i>The Vvitch</i>."
        ]
    }, {
        "song": null,
        "album": "All or Nothing",
        "artist": "Mel*n",
        "spotify_id": "7nTPIgjFsBEUjkK1LGNTDE",
        "post_page": "2020-09-07",
        "description_lines": [
            "Want to feel authentic? Check out Mel*n. Here's an artist with 226 monthly listeners on Spotify. It doesn't get much more artisanal than that.",
            "The name comes from the artist's actual name, Mel Lynn, from Philadelphia. (Derek--do you know her? Did you guys torch cop cars together at Penn Charter?) Anyway, this is a monotone, shoegaze-y electronic record with some vague dance tones to it. The real standout is the eponymous \"All or Nothing.\" The song starts out with a nice enough vibe but not much to write home about--just a drowsy sad kinda chick who is, in the parlance of our times, \"all of us.\" It's not until the second verse passes and the chorus begins that things really turn up. We get a brief hiccup, and then a vaguely \"Strobe\"-like layer settles over the chorus and provides a nice bounce to the track. The other songs on this EP are all worth a listen as well. It doesn't jump out at you, necessarily, but we've found ourselves coming back to it all week.",
            "Separately, 2019's single \"Little More\" isn't half-bad, either."
        ]
    }, {
        "song": "new song d",
        "artist": "The Front Bottoms",
        "spotify_id": "5OrWjKjmlOehKTiSH9caKQ",
        "post_page": "2020-09-07",
        "description_lines": [
            "What more do we have to say? You already know what this is. The Front Bottoms have appeared here multiple times before (most notably, with \"Camouflage\"), and all of the things that landed them here before are landing them here again. The casual/frantic spoken-word verses, the driving drum tracks, and the lyrics. The real value in this track comes in its progressive bombast. It starts off solidly enough, but builds noticeably as it moves along. It doesn't reach the same heights as the aforementioned \"Camouflage,\" and there's an unnecessary pseudo-profound outro, but it's a worthy entry nonetheless."
        ]
    }, {
        "song": null,
        "album": "Set My Heart On Fire Immediately",
        "artist": "Perfume Genius",
        "spotify_id": "5qWrp5RcqjxB8ak7dtK6Iv",
        "post_page": "2020-09-07",
        "description_lines": [
            "Sam had tried to turn us on to Perfume Genius years ago but at the time it didn't stick. Now we're here to eat crow, because this latest release feels like it could be really special. (The record was released back in May but we're just now discovering it for ourselves.) We've only spent a couple of days with it and therefore only given it a few full listens, but we're really excited by how both familiar and new it feels at the same time. This is evident from the opening track, \"Whole Life.\" There's a classic, timeless element to the production--it reminds you of the shaky, quivery kind of pretty songs you hear in old movies--but it also manages to sound like nothing we've heard before.",
            "If we had to make comparisons, Grizzly Bear's <i>Veckatimest</i> (2009) would probably be up there for the same, shared polished ricketiness, but <i>Set My Heart On Fire Immediately</i> is a much more accessible album than <i>Veckatimest</i> (and much better for it). Also, other tracks feel much more modern and forward, like \"Describe,\" which feels almost like Beck meets The Flaming Lips? We're not quite sure about that, but this track is a hipster's slow-motion entrance dream. And things just keep evolving from there. \"Without You\" is a breezy evening ditty--you can almost (we said <i>almost</i>, okay?) hear a bossa nova underneath it--and \"On the Floor\" is actually, of all things, <i>shuffle</i>. Although we probably need a lot more time with this record before we can say more, that's a chunk of time we're really looking forward to putting in.",
            "This new/old conflagration is captured even in the album art. (First of all, how nice it is to see some aesthetically pleasant cover art? We feel like most cover art nowadays vaguely resembles a rainbow highlighter vomitus...) Hadreas, the eponymous genius himself, stares shirtlessly, knowingly, defiantly at the camera in a black/white contrast that somehow seems to simultaneously evoke Humphrey Bogart, our final look at Norman Bates in <i>Psycho</i> (1960), and Joaquin Phoenix's Arthur Fleck (<i>Joker</i>, 2019). The question on everyone's mind--does anyone make <i>albums</i> anymore--finally has an answer: yes."
        ]
    }, {
        "song": "detonate",
        "artist": "Charli XCX",
        "spotify_id": "1M6VHCglQ2PLWeAsyhgEUH",
        "post_page": "2020-08-31",
        "description_lines": [
            "Charli XCX is (are? is this a person? is this a band? is this a m--man? FLOCKA) like TikTok, in that she is super popular and we just generally aren't that familiar. We feel like we should become more familiar, though, because this isn't the first time one of her tracks has caught our attention and made its way onto this thread.",
            "This track is like a fun, light, super bubbly champagne. Part of that quality comes from the sound of the song itself--all of its rapid, moving, bubbling tones actually seem themselves to effervesce. Or maybe, given the adolescent feel of the whole thing, Pop Rocks would be a better comparison? Of course, like so many great tracks, form and content are exactly opposed: as light as the sounds are, the lyrics offer a different story.",
            "We are open to recommendations as to where to begin with this artist. We'd like to hear more."
        ]
    }, {
        "song": "Crimson and Clover",
        "artist": "A.G. Cook",
        "spotify_id": "3MBMKV1sWbwssL3MY5IqnA",
        "post_page": "2020-08-31",
        "description_lines": [
            "We've come across A.G. Cook before, but always in collaboration, either with Hannah Diamond (see below) or 100 gecs. This is a solo effort off of a recent LP, and we really like it. It almost sounds like another collaboration, only this time, with Lou Reed and the Velvet Underground (and maybe a touch of Contra-era Vampire Weekend thrown in for good measure). At least, that's how the verses sound. As you'll see if you take a listen, the bridges move off into a different direction before returning to the sweet, lazy verse that makes this whole thing work. And about halfway through, we get an interesting slowdown in which things seem to flip: the drums become organic, while the vocals are filtered through a very present vocoder.",
            "There's probably a version of this song that works as a bigger banger in some alternative multiverse reality, but we're pretty into this version nonetheless."
        ]
    }, {
        "song": "Hologram",
        "artist": "Tacocat",
        "spotify_id": "29J86Fn14T8BB93kNW43eU",
        "post_page": "2020-08-24",
        "description_lines": [
            "Kicking off a relatively short list this week is \"Hologram\" by Tacocat. We've never really listened to Tacocat before, but apparently they're a well-established Subpop outlet from Seattle (RIP). This track is a catchy pop-punk sing-along that sounds like a cross between Courtney Barnett and The Thermals. It's summery--we recommend listening to it while standing up shotgun-side in a slow-motion convertible."
        ]
    }, {
        "song": "It's Gonna Be Okay, Baby",
        "artist": "MUNA",
        "spotify_id": "5lH5KTgUiP5CSjGctZusTQ",
        "post_page": "2020-08-24",
        "description_lines": [
            "It's hard to ignore a song that opens with lines like \"You're gonna move to New York/and experiment with communism/Go down on a girl/after reading her some Frantz Fanon.\" (It's a little hard to imagine <i>Fanon</i> getting anyone--except for maybe sadomasochists?--in the mood, but the point is well taken nonetheless.) This one, which sounds like pronoun meets Miel, is not nearly so summery as the above entry. It's more of a rainy day, in your feelings, meaningful cafe vibe.",
            "A quick glimpse at the group's Spotify page reveals that it's not one of their bigger songs. Those honors would go to \"Bodies,\" \"Number One Fan,\" and \"I Know a Place.\" A single listen of each reveals that they're all worth your time as well, although we don't have time to discuss them fully here."
        ]
    }, {
        "song": "Valentine",
        "artist": ["Lala Lala", "Grapetooth"],
        "spotify_id": "6DzjAbFIAvE8kXoo64JzBK",
        "post_page": "2020-08-24",
        "description_lines": [
            "This track comes as a collaboration. It's got a little bit of a New Wave, shoegaze feel to it, but with an almost reverent synth background that kind of evokes the backing to the chorus of \"Love My Way\" by the Psychedelic Furs (which is, of course, included on the <i>Call Me By Your Name</i> soundtrack). Two of the members of Grapetooth actually belong to the band Twin Peaks, who we've featured here before as well."
        ]
    }, {
        "song": null,
        "album": "Welcome to Conceptual Beach",
        "artist": "Young Jesus",
        "spotify_id": "76nK69DufkCMk1v8kkmSA5",
        "post_page": "2020-08-17",
        "description_lines": [
            "Young Jesus have appeared on the WMT before, but never before like this. This past Friday saw the release of the band's fourth studio and fifth overall record, Welcome to Conceptual Beach, and you can go ahead and both induct that into the Names Hall of Fames *and* call it truth in advertising. It's an artsy record, for sure, but one which ends up being more accessible than it seems. We've heard it described as a mix of Sigur Ros, Neutral Milk Hotel, and Dave Matthews Band, which is accurate but incomplete. For good measure, we'd also throw in Wild Beasts, Destroyer, and a host of other acts as well.",
            "The record does meander at times, and it will take a few more listens to tell whether or not it sticks as a total overall effort. That being said, there are a couple of serious stand-outs. The closer, \"Magicians,\" for instance, shows off a stuttering, schizophrenic alternation between a pleasant, structured sort of verse and long, unstructured, understated solo efforts in a way that kind of recalls The Velvet Underground's \"Heroin\" (a great, great track on its own, in case you're not familiar). It feels a little bit gratuitous at first until everything comes together in the third act.",
            "By far the best track off of the record, however, is \"(un)knowing.\" This is the stand-out, the \"put it on repeat and sing along\" anthem. The song is essentially split into two mirror-image halves. The first half, with its alternative guitar tuning and clean acoustic sounds, is almost reminiscent at times of mid '90s radio rock, but the second half is where things really come alive. Everything becomes distorted, muddled, electrified, and the lyrics reach a max meaningfulness level. By the time John Rossiter is wailing \"Oh God and Mary, Jesus Christ/won't bless me for my every vice,\" so are we, and even if we don't know exactly what he means, we know exactly what he means. This is Young Jesus at their most NMH, and it's really, really good.",
            "We recommend starting off with \"(un)knowing,\" and then trying out the record as a whole from there."
        ]
    }, {
        "song": "Boomer",
        "artist": "Bartees Strange",
        "spotify_id": "2WahhszjFFN9qLK3G2ihZL",
        "post_page": "2020-08-17",
        "description_lines": [
            "Last week, we brought you an introduction to Bartees Strange, with his excellent \"Mustang.\" This week, Strange has another new track out, called \"Boomer.\" It's equally interesting if a somewhat different vibe--sort of like if Kid Cudi made garage rock with the children of The National and The Killers? We're not sure how much that description is going to hold up, but if you liked the first effort from Strange, you'll like this one, too."
        ]
    }, {
        "song": "Turnstile Effect",
        "artist": "PHONY",
        "spotify_id": "0ua3mFtpYZfVMmmbC53aYr",
        "post_page": "2020-08-10",
        "description_lines": [
            "Fittingly, this track sounds kind of like a mix between The aforementioned Shins (but, like, early Shins, like Flake Music-era Shins), Elliot Smith, and Sufjan Stevens. At least, for the first two-thirds of the track. After that, things go electric and heavier."
        ]
    }, {
        "song": "In a Van",
        "artist": "Saintseneca",
        "spotify_id": "1YhMsfBi41meCDqLHUTzHk",
        "post_page": "2020-08-10",
        "description_lines": [
            "In what we can only assume is a Chris Farley reference, Saintseneca gives us another Shins-worthy effort with \"In a Van.\" There's a touch of more recent Vampire Weekend to it as well. This one ambles along nicely--it's a spring/summer track."
        ]
    }, {
        "song": "Idaho",
        "artist": "Slow Pulp",
        "spotify_id": "4Vz0Wt4ySnCJi7WJycnoNj",
        "post_page": "2020-08-03",
        "description_lines": [
            "We feel like Slow Pulp is one of those artists who are constantly recommended to us, and with whom we have a vague familiarity, but no real knowledge to speak of. At any rate, this track is one of the headies. It's got a whiff of '90s nostalgia to it--slowly strummed acoustic guitars forward in the mix and all that, doubled female vocals crooning slowly over a spacey refrain, et cetera et cetera. Almost like if the daughter or younger sister of the lead singer of Sixpence grew up to be kinda alternative and record tracks in 2020, you know? (Speaking of, who knew that Sixpence was a Christian rock band? You really do learn something new every day.)"
        ]
    }, {
        "song": "Garden",
        "artist": "Meet Me @ The Altar",
        "spotify_id": "00JfiKSB2Ne3dWu6EGcec9",
        "post_page": "2020-08-03",
        "description_lines": [
            "These are just high-quality, chick-driven pop punk tracks. If you listen beneath those really heavy drums and bass guitars, you might even pick up on some vaguely metal lead guitar licks, which give the whole thing a kind of Coheed and Cambria flavor. This is a relatively new group--only a few singles and an EP here or there on Spotify--but for those of us who like polished, melodic, sing-along pop punk, they're fun for sure. (For those of us who are more into annoying, irritating gatekeeping and exclusionary etymologies of \"punk,\" well, this probably isn't the weekly music thread for you.) We're old for the Earth now, but if we weren't, this is the kind of stuff we imagine the lil goth chicks with jelly wristbands we'd pine after at school dances would be into."
        ]
    }, {
        "song": "May the Odds Be in Your Favor",
        "artist": "Meet Me @ The Altar",
        "spotify_id": "3TvGAPUOAEcyXKVnRFHavM",
        "post_page": "2020-08-03",
        "description_lines": [
            "These are just high-quality, chick-driven pop punk tracks. If you listen beneath those really heavy drums and bass guitars, you might even pick up on some vaguely metal lead guitar licks, which give the whole thing a kind of Coheed and Cambria flavor. This is a relatively new group--only a few singles and an EP here or there on Spotify--but for those of us who like polished, melodic, sing-along pop punk, they're fun for sure. (For those of us who are more into annoying, irritating gatekeeping and exclusionary etymologies of \"punk,\" well, this probably isn't the weekly music thread for you.) We're old for the Earth now, but if we weren't, this is the kind of stuff we imagine the lil goth chicks with jelly wristbands we'd pine after at school dances would be into."
        ]
    }, {
        "song": null,
        "artist": "Katie Dey",
        "album" : "Mydata",
        "spotify_id": "5DejDGv9n1FTq0fAULcLpL",
        "post_page": "2020-08-03",
        "description_lines": [
            "Although we'd never heard of Katie Dey, it seems like she's been around for a few years. (In 2019, for instance, she released an album with the dope ass, Names Hall of Fames-quality title <i>Solipsisters</i>.) This release is what we look for in records: something original. Something that we've never heard before. <i>Something that we didn't even realize that we wanted, that we needed, that we'd been missing until the moment we heard it.</i>",
            "There is a fragility to this record. Dey's wavering, CocoRosie voice is vulnerable enough, but when she buries it under reverb and the rest of the mix, it positively shrinks. The instrumentals here are thin somehow, too--on the opening track \"Darkness,\" for instance, all of the instruments seem to rest on the same notes, leaving a sense of space and weakness to a track which otherwise bounces along nicely. In fact, that's a pretty good description of the album in general.",
            "We think this jumped out at us because it seems like it uses a lot of familiar elements to make something new. It's like if Mum, Kid A/Amnesiac-era Radiohead, James Blake, and Cerulean-era Baths cut a concept album about online relationships together during a quarantine."
        ]
    }, {
        "song": null,
        "artist": "Stay Inside",
        "album" : "Viewing",
        "spotify_id": "5IQv4Dr6KeSSFC8akkYpic",
        "post_page": "2020-08-03",
        "description_lines": [
            "Last week, we were all introduced to Bartees Strange. Through Strange, we've now encountered Stay Inside. (He used to be a part of their line-up.) If you're expecting something similar to \"Mustang,\" however, adjust your expectations.",
            "Continuing an ongoing theme now, this is another fall/winter-feeling record. Stay Inside are an emo/post-hardcore hybrid. This works best on tracks like \"Revisionist,\" in which heavy drums and droning guitars get muted and suppressed in the mix, and blanketed beneath a lackluster, muttering lead vocal. Tracks like the follow-up, \"Void,\" seem to lose a little bit of that flavor and wander into more generic emo/screamo territory at times, but not necessarily to particularly distracting effect. And on certain other tracks (\"Ivy\" and \"Divide\"), undistorted, quickly arpeggiated guitar patterns over sterile quality drum recordings even evoke early era Joan of Arc.",
            "This group feels like a more mature version of the hardcore emo bands we liked in eighth grade--Thursday, for instance, or Thrice. (For a little bit of a different vibe, check out their 2018 record The Sea Engulfs Us and the Light Goes Out to hear what the group sounds like with Bartees on vocals.)"
        ]
    }, {
        "song": null,
        "artist": "Gulch",
        "album" : "Impenetrable Cerebral Fortress" ,
        "spotify_id": "4bfyHcprcCpzLWqgOsAu4r",
        "post_page": "2020-07-27",
        "description_lines": [
            "Wow, this lo-fi hardcore debut from Gulch is decidely different from anything we've discussed here in a long time. We seriously wonder whether anyone other than us will go in for this, but here goes...",
            "This is a rip-roaring hardcore debut. The guitars absolutely growl...at times, they sound more like monster truck engines than musical instruments. The unintelligible lyrics are screamed to such an extent that virtually every syllable clips. The drums, for the most part, stay in the 120 bpm-plus polka beat zone of punk hardcore, but at times dip into a more metalhead double-bass pattern. The bass is such a low, dull throb that you can barely hear it--like, dogs probably hear it or something.",
            "A brief look at the track listings--there are only eight of them, and the whole record lasts just over 16 minutes--may give you even more of an idea of what you're in for. Tracks include \"Self-Inflicted Mental Terror,\" \"Fucking Towards Salvation,\" and \"Shallow Reflective Pools of Guilt,\" among other similarly named offerings.",
            "We dare any of you WMTers to like this as much as we do. Or, even, like, at all."
        ]
    }, {
        "song": null,
        "artist": "Backxwash",
        "album" : "God Has Nothing To Do With This Leave Him Out of It",
        "spotify_id": null,
        "post_page": "2020-07-27",
        "description_lines": [
            "We had never heard of Backxwash before this, but apparently she is releasing a new EP soon. News of that led us back to her recent full-length debut, God Has Nothing To Do With This Leave Him Out of It, which is just, so great.",
            "It's like, unsettling lo-fi horror hip hop. It's like the best parts of what we get out of Danny Brown's <i>Atrocity Exhibition</i>, Tyler the Creator's <i>Igor</i>, and Kanye West's \"Monster,\" but as its own thing. This is another relatively short record--10 tracks, only two of which clock in at over 3:00 long. We're not really into this scene--is it even a scene? We've googled and spotified \"horror rap\" before to no real avail--so we don't have much more to say here, but this is a really cool record that we're interested to dig into more as the seasons change, the days get shorter, and the temperature drops. A fall/winter record for sure."
        ]
    }, {
        "song": "Mustang",
        "artist": "Bartees Strange",
        "spotify_id": "6tCuo98GRDGE2IJF6nmP8m",
        "post_page": "2020-07-27",
        "description_lines": [
            "We have no idea who this guy is, but apparently he's been making some pretty rad covers of the National songs (via the Francis Scott Keys). This track sounds like the National meets early the Killers with a sprinkle of Kings of Leon vox with lyrics straight out of an Antlers song. \"You're screaming and cursing, I'm smiling, you're killing me,\" anyone? ",
            "This is music to go on a run to. But, like, a <i>meaningful</i> run. Like you're running away from, like, your past. Or your problems. Or, like, responsibility, or something. And like you might find like a like MPDG along the way or something. You know, that kind of run. Not, like, an exercise run, or whatever. Exercise is no way to cultivate the wan, tubercular physique of a tortured but meaningful aesthete."
        ]
    }, {
        "song": null,
        "artist": "Miel",
        "album" : "Tourist Season",
        "spotify_id": "0KZIZ7GtnsJ91Wu7xTXgzw",
        "post_page": "2020-07-27",
        "description_lines": [
            "We've written here about a couple of tracks that Miel, a new artist, has released over the course of the last few weeks. (One of those, \"Must Be Fine,\" is really something.) Well, Miel's debut is finally here, and it's a pretty solid affair. Nothing for us rises to the heights of that debut track, and this is a largely mellow effort--really more of a winter release, if you ask us--but it's a pleasantly threadbare, emotional solo effort with light but effective synth/electronica notes to it. New highlights include the eponymous \"Tourist Season\" and closer \"Early Hours.\"",
            "This record probably isn't going to blow you away on first listen, but we think it's a grower (especially, as we said above, as the seasons turn). This is a really promising debut and we are eager to see what else comes out of this woman. This is music to, like, have your first kiss with a like pseudo-goth girl (or <i>boooy</i>) to or something. Possibly it's raining. At a wedding? And you're Timothee Chalamet and she's, like, Kristen Stewart's artsier sister? Just listen to it."
        ]
    }, {
        "song": null,
        "artist": "Taylor Swift",
        "album" : "folklore",
        "spotify_id": "2fenSS68JI1h4Fo296JfGr",
        "post_page": "2020-07-27",
        "description_lines": [
            "Let's be clear about something: we like Taylor Swift. Like, a lot. She's already had a long career of success for someone so young, and she's reinvented herself several times already. In fact, this record itself marks something of a reinvention",
            "Throughout her career, though, Swift has functioned as the ultimate pop artist. She observes what's happening on the fringes of music, imbibes it, and reproduces it in exactly the fashion that the average passive listener can connect to. She's like a Rosetta Stone or Babel Fish for musical movements. She's a <i>translator</i>.",
            "Probably the best example of this is <i>1989</i>. We listened to that 9-10/10 over and over and over for months. Maybe years. It's in many ways a perfect record, and for those of us who, like Swift, were born in 1989, there's something about its sound that seems to sum up our lives in a really accessible and yet unique way. Like if on your 30th birthday, you got to see a slideshow of all of the pictures people had ever taken with you in the background. A bunch of the experiences that made up the timeline of your life, seen from the perspective of someone else who was there too, but standing just a few feet off. At any rate, enough gushing. Because in addition to these things, <i>1989</i> was also a translation. It was a translation of artists like Robyn, artists like Tegan and Sara, like Carly Rae Jepsen, who for years had been making chick-driven, 80's era pseudo-nostalgic synth pop, but who had committed so hard to that sound that they could not have possible broken through to arena-level mainstream fame. It is Swift's unique talent to take that sound, to soften its edges, and to turn it into, again, one of the greatest pop records of our lives.",
            "And <i>folklore</i> feels like another translation. This time, it's not Robyn, but Lana del Rey who provides the source material. Opening tracks \"the 1\" and \"cardigan\" are nice, solid stand-alone efforts, but both of them also kinda make you just wanna listen to Lana. It's the blase tone, the breathy delivery, the swung bounciness, the vocal runs and held notes fading into a reverby background, the references to youth, to women, to men, to America. This vibe breaks for a little bit around tracks 4 and 5, but shows back up in time for \"mirrorball\" and the creatively named \"seven.\" The eighth track, \"august\" (do you get it?) sems to break out of that ambien daze for a bit. Indeed, the back half of the album seems to earn the title of \"folklore\" a little more, and feels maybe like a bit of a return to some of Swift's roots. (track 14, \"betty,\" pulls in, for instance, some quiet harmonica and some lyrics about gyms and dances and him and homerooms and a subtle take on a \"Love Story\" wave key change.)",
            "The truth is, like all of Swift's efforts, this is a long record, and we'll need to spend a little more time with it. Vexingly, this is yet another late July release that feels to us like a winter record, but we wonder whether all of that has to do more with lockdowns than anything else. Cold weather and coronavirus both force musicians indoors for extended periods of time, and we as fans wind up with these beautiful elegiac efforts as a result. If it were up to us, it'd always be autumn or winter."
        ]
    }, {
        "song": "Carrie",
        "artist": "Ruby Haunt",
        "spotify_id": "3Ik9HLSy6kuI3ANwwt5BIo",
        "post_page": "2020-07-20",
        "description_lines": [
            "That this track appears on this particular WMT is a minor coincidence. We've discussed Ruby Haunt here before, most notably for \"Curtain Call\" and most recently for \"Avalon.\" \"Carrie\" comes off of the same release as \"Avalon\" and, though still with the characteristic RH lo-fi sound, is clearer and more present than a lot of their recent work. This one is driven by a finger-picked guitar and vocals are placed front and center. Like pretty much any RH track, the song drags on in a way that gives a sense of both progress and stagnation.",
            "We mentioned last week that RH really capture the spirit of melancholy in all of their songs. Check out the artwork associated with this single on Spotify. That's melancholy if we've ever seen it."
        ]
    }, {
        "song": "Born Confused",
        "artist": "Porridge Radio",
        "spotify_id": "67WYyxMKmuFd7E4pELpwcm",
        "post_page": "2020-07-20",
        "description_lines": [
            "We'd never heard of Porridge Radio before but this track grabbed us quickly. Instrumentally, it's almost got a very early (as in, Flake Music-era) Shins vibe, but the vocals and lyrics give us vague flashes of we wanna say Courtney Barnett. About half way through the song, everything breaks down into a vamp on the phrase \"thank you for making me happy\" which builds and builds and builds and crests and crests and crests and then sort of falls apart.",
            "There's a whole record to explore here (2020's Every Bad) but we haven't had time to do it yet. It's part of our plan for the upcoming week."
        ]
    }, {
        "song": null,
        "artist": "The Lawrence Arms",
        "album" : "Skeleton Cost",
        "spotify_id": "1KoFC7rBDqWZrDbLFAPXAu",
        "post_page": "2020-07-20",
        "description_lines": [
            "We've written here before about the Larry Arms (most notably, their near flawless-from-front-to-back record Oh! Calcutta!), and they're out this week with a new record. Importantly, that record's got an older school sound to it--to us, it's actually reminiscent of that classic aforementioned effort. Early winners include \"PTA\" and \"Belly of the Whale.\"",
            "If you need to ease into the Larry Appendages, we'd recommend the following favorites: \"Are You There, Margaret? It's Me, God,\" \"Like a Record Player,\" \"Warped Summer Extravaganza (Major Excellent),\" and \"The Slowest Drink at the Saddest Bar on the Snowiest Day in the Greatest City.\""
        ]
    }, {
        "song": "What's the Matter",
        "artist": "Twin Peaks",
        "spotify_id": "2m2ckP35IsKmIxWmzYq4LA",
        "post_page": "2020-07-13",
        "description_lines": [
            "We've heard tell of this group but had never encountered their stuff before. \"What's the Matter\" is a really nice, pleasant, infectious track. It's laid back but dancey. The multiple, overlaid vocal tracks throughout give it a real sing-along feel, and the riding on the cymbal bells really contribute to accenting certain beats over others. And, on that front, the drum fills here really follow the melody, which is an interesting touch you don't see often. (It's common for the vocal melody to mimic the lead guitar/keys melody, which can be either infectious or totally annoying and dead-sounding, but it's tougher to pull off with drum fills for obvious reasons. It's used to great success all over this track, however.)"
        ]
    }, {
        "song": "I'll Be Holding",
        "artist": "Miel",
        "spotify_id": "21M6s9DMnK6HtXZ0Xb1dB5",
        "post_page": "2020-07-13",
        "description_lines": [
            "Last week, we wrote about Miel's then-only single, \"Must Be Fine.\" That track has stuck with us on repeat all week. Since then, however, Miel has released a second track, \"I'll Be Holding.\" As is often the case, this one isn't quite as powerful as the debut, but it's still a really solid track. It comes complete with an 80s retro synth gloom to it and still feels very pronoun-adjacent (if pronoun, like, took a bunch of Xanax or something). We're going to be on the lookout for more tracks from this artist in the days to come."
        ]
    }, {
        "song": "montgomery forever",
        "artist": "The Front Bottoms",
        "spotify_id": "4BkfM7H1lPM1gzi05FXmIP",
        "post_page": "2020-07-13",
        "description_lines": [
            "The Front Bottoms have appeared on the WMT multiple times for their unique blend of frantic, skittish tracks under non-chalant, nearly spoken word lyrics. \"montgomery forever\" delivers more of that sweet, sweet same. This is a really energetic track with messy verses and messier choruses, and the singer still has that weird, hard-to-pinpoint kind of quasi-accent to his singing.",
            "These guys are hard to place, but this track almost borders at times on edgy pop punk. We guess that the music video for this one would consist of sped-up footage from some '90s-looking home videos."
        ]
    }, {
        "song": "Avalon",
        "artist": "Ruby Haunt",
        "spotify_id": "5rwKSB1WtNDWOBmwxZMWrg",
        "post_page": "2020-07-13",
        "description_lines": [
            "We've written about Ruby Haunt here before--most notably, their incredible track \"Curtain Call\" off of 2019's <i>The Middle of Nowhere</i>--but they're back with a new release. \"Avalon\" doesn't have the same peculiar combination of constancy and momentum as that track does, but it's still worth a listen or two. This is a stripped down Ruby Haunt. The track proceeds over a couple of chords strummed over and over again on an acoustic guitar and a simple melody that constantly repeats in response. \"spinnin' out, runnin' away/felt way different yesterday,\" the lead sings lazily, the unadorned delivery starkly set against what those words actually mean. The track yawns on like that for five and a half minutes, before the simplest, softest drum part comes in and seems somehow to still just push it over the edge.",
            "These guys really capture the spirit of melancholy in all of their songs."
        ]
    }, {
        "song": "The Day the Politicans Died",
        "artist": "Magnetic Fields",
        "spotify_id": "7uvmVIVSoFXfxbc3nUYnvC",
        "post_page": "2020-07-13",
        "description_lines": [
            "This song is particularly remarkable or enjoyable from a musical perspective, but the lyrics are worth printing here in full just for how laugh-out-loud funny they are. Politics in art is usually anathema to us, but we'll make an exception for something as naked and bald-faced as this.",
            "<p style = \"padding-left: 33em;font-size: 80%\"><i>Billions laughed and no one cried<br>The day the politicians died<br>Celebrations spread worldwide<br>The day the politicians died<br>Even their own mothers<br>Their own husbands and wives<br>Said, \"Now all men are brothers\"<br>Let's get on with our lives<br>Billions laughed and no one cried<br>The day the politicians died<br>Celebrations spread worldwide<br>The day the politicians died<br>We've risen from the mud<br>We're different from the beasts<br>We've got the taste for blood<br>So let's eat all the priests<br>Billions laughed and no one cried<br>The day the politicians died<br>Celebrations spread worldwide<br>The day the politicians died<br>It's all one big party now<br>'Cause all the politicians died</i></p>"
        ]
    }, {
        "song": "Get Me Back in the Game",
        "artist": "LL Burns",
        "spotify_id": "4K9n5qyCUGYBtfuJAgh23X",
        "post_page": "2020-07-06",
        "description_lines": [
            "This is an interesting one. A very organic sounding track, it feels like Thievery Corporation (think \"Lebanese Blonde\") did a take on some sort of whiskey-soaked country-infused hip hop. It incorporates elements of all of these things in a way that makes it feel decidedly like it's from another decade. Maybe as though it would have been one of the most intriguing songs of the '90s.",
            "Equally interestingly, the artist--LL Burns--has only two tracks out on Spotify. He (?) has a pretty limited bandcamp page, and it doesn't seem like a ton of other information (aside from a London location) is available. It'll be interesting to see if he follows the track up with anything else worthwhile."
        ]
    }, {
        "song": "Vegetable",
        "artist": "Happyness",
        "spotify_id": "3Fhoc2UFQs1n9GNVOnApZ3",
        "post_page": "2020-07-06",
        "description_lines": [
            "This one is a warped, melodic, lo-fi banger. It sounds almost like if Kurt Cobain fronted Weezer. The pre-chorus really reminds us of...something but we can't quite put our finger on it. At any rate, there are a lot of shimmering hi hats here, fuzzy chords, squealing held notes, and age-old contrasts between palm-muted verses and out-loud choruses.",
            "\"Vegetable\" is a track off of 2020's Floatr. We haven't had time to give it a listen, but we'll try to do so this week and will report back if anything noteworthy comes of it."
        ]
    }, {
        "song": "Must Be Fine",
        "artist": "Miel",
        "spotify_id": "19jfMrCGfO2uPDMTyhsOPD",
        "post_page": "2020-07-06",
        "description_lines": [
            "Want to feel cooler than your friends? Read the WMT every week. Here's another artist with four-digit monthly listeners on Spotify. In fact, \"Must Be Fine\" is Miel's only track posted so far. (Fun fact: \"miel\" is the French word for honey.)",
            "The remarkable thing about all of this is that \"Must Be Fine\" shows incredible restraint as a track. It may or may not be your thing as a piece of music--its thick aural melancholia most certainly makes it ours--but the form of the song mimics the content exactly. The lyrics hint at exchanges which never take place, sentences which are never said, and loves which, requited or not, are never realized. There are no climaxes. No consummations. And all of this is brilliantly reflected by the track itself. The drums and strings plug along in non-stop, repetitive eighth-notes, and the vocals never rise above the place where they begin. We plug along like the narrator herself: \"I keep going...I must be fine.\"This is such an obvious move but so few artists make it successfully.",
            "It's like pronoun and \"Lilies\"-wave Bat for Lashes got together, watched Lars von Trier's Melancholia, and then cut a track they know we'd appreciate.",
            "If that's not enough for you, get a load of the \"About\" section on Spotify:",
            "<blockquote class=\"blockquote\">After a half-decade in the grisly world of internet comedy, Miel emerges with the humiliatingly honest synth pop break-up album, Tourist Season. Set to release July 22nd, the album blends dreamy planetarium synths with breathy vocals that have no business being as sultry as they are, coming from a former Vine star. In the summer of 2019, she fled to her parent's barn and enlisted the help of producer/multi-instrumentalist/brother Henri Bardot to weep-sing her way through the velvety collection that would become Tourist Season.</blockquote>",
            "We'll definitely be interested to see if this is a one-off, or if that July 22nd release really delivers."
        ]
    }, {
        "song": "Oh No",
        "artist": "Softee",
        "spotify_id": "3FLazwxIsNIWPmND1t1RIx",
        "post_page": "2020-07-06",
        "description_lines": [
            "Softee, for us, are like the kids who were seniors in your fraternity/sorority/selective living group/school newspaper/theater troupe/intramural sports team when you were a freshman. You traveled in the same circles, you've seen them around, you recognize their names. We'd never really given them a listen before though.",
            "This track opens with a stripped down, bass-y bouncey verse that evokes Deniece's Williams' \"Let's Hear it for the Boy.\" From there, it progresses to a pretty great dance-pop song in general. (It's got a little of the best elements of Haim to it as well, in places.) Like the Miel track above (but in a very different direction), the lyrics to this one just fit perfectly: <i>What if I did it? What if I kissed you right here? And what if you felt it? What if you felt the way I do about you?</i>",
            "Who <i>hasn't</i> felt this way? Set against the schizophrenic, mercurial ups and downs of the track, these lines perfectly capture the uneasy excitement (or is it the exciting uneasiness?) surrounding a new crush, a hot date, a first kiss."
        ]
    }, {
        "song": "Headgear",
        "artist": "Elizabeth Moen",
        "spotify_id": "7Gb1uSZjs0fsAoqPrfLArL",
        "post_page": "2020-06-29",
        "description_lines": [
            "We're not familiar with Moen, but a quick look at her Spotify artist page shows she's got a couple of releases under her belt. This track grabbed us right away--it is splattered with loud, unabashed personality, vocal yips, and a pretty driving drum part. It's also got some pretty warm and chirpy guitars front and center in the mix. It's the kind of track that goes along with an exuberant vacation morning bike ride under cloudless skies on a breezy beach. The vocal stylings remind us a little of a track we saw on the WMT a couple of months ago, \"How I Get Myself Killed\" by Indigo de Souza."
        ]
    }, {
        "song": "Now That's What I Jack Off About",
        "artist": "Hot Dad",
        "spotify_id": "5LkaN9i1mI7sPdqiYN9eJi",
        "post_page": "2020-06-29",
        "description_lines": [
            "What even is this? First of all, a candidate for the Names Hall of Fames. The track kinda slaps, too--it's got a synthy, moody '80s vibe, with almost Peter Gabriel-wave vocals. But check out the cover art for this single--it's a take on Now! That's What I Call Music! We honestly have no idea how seriously to take this. It comes from a guy who makes a lot of comedy music? As evidenced by tracks like \"Big Money Salvia,\" which seems largely to center on \"cock-slapping\" Martin Shkreli, or another similarly named track, \"Big Money Salvia City.\" There's also \"Elon Musk (Cars in Space.\" Let's be clear--these are obviously joke tracks, but we would be lying if we didn't confess that there is something...aesthetically kinda pleasant about them."
        ]
    }, {
        "song": "The Times They Are a-Changin'",
        "artist": "Goth Babe",
        "spotify_id": "4fYeRpiNyejUfkgskbhqmz",
        "post_page": "2020-06-29",
        "description_lines": [
            "This one came out of nowhere. We've reviewed Goth Babe here before, and they're obvious members of the Names Hall of Fames, but they've just recently released this cover of Dylan's TTTAaC and it is--something. We're not quite sure how we feel about it, but it at least does what any truly successful cover needs to do--it remakes BD's song in GB's image. Listen to this one and see for yourself. We think we like this but offer no guidance here, at least not yet."
        ]
    }, {
        "song": "Walk In The Woods - (Acoustic)",
        "artist": "Snarls",
        "spotify_id": "0VwdoYFbubpHqoAa8vDVTf",
        "post_page": "2020-06-29",
        "description_lines": [
            "We recently reviewed Snarls' full-length release <i>Burst</i>, and one of the tracks we highlighted was \"Walk in the Woods.\" Snarls are back already with an acoustic release of this track. It's nice, but it loses the particular quality of the original. The plugged-in version offsets the drowsy, bland vox against bouncy and head-bobbing instrumentation but that's lost in the acoustic track. A nice addition, but not a must-listen by any stretch of the imagination."
        ]
    }, {
        "song": null,
        "artist": "RMR",
        "album" : "Drug Dealing is a Lost Art",
        "spotify_id": "2wFBXSq8EyQNEtqXg8Xej2",
        "post_page": "2020-06-22",
        "description_lines": [
            "RMR, by now, needs no introduction here. We've covered several of the tracks off of this EP already--most notably, \"Rascal,\" which remains the most arresting--but the full EP dropped last week. P4k gave it a generous, considered 3.3 and called RMR himself <a href=\"https://pitchfork.com/reviews/albums/rmr-drug-dealing-is-a-lost-art-ep/\">\"a wiped smartphone--sleek, modern, empty.\"</a> (How wiping a smartphone is akin to emptying it is beyond us. It sounds like P4k is about as knowledgeable about the wiping process as HRC.) This leads us to our new method for interpreting P4k scores:",
            "1) Avoid them.<br>2) If they can't be avoided, then record the given score (in this case 3.3)<br>3) Subtract the given score (3.3) from 10 to reverse the 10-point scale (in this case, the new score is a 6.7)<br>4) Round to the nearest whole number, because no one needs decimal places on a 10-point music review scale (in this case, 7)<br>5) Take the new score itself with a grain of salt, because the first one was bogus to begin with",
            "The new P4k scoring system isn't perfect (it would leave several Kanye and Radioguts records with near 0's), but we're willing to bet that it works more often than not. It certainly does here. None of the new tracks on RMR's EP match \"Rascal\" in our opinion, but the entire effort feels new and aesthetically interesting. (P4k mistakes a lack of apparent depth in the lyrics--none of Justin Vernon's <i>\"melic in the naked/drew a lake/and drew the lofts for page\"</i> pseudo-profound gobbledygook here--for lack of depth in the <i>concept</i>, but RMR's veneer is in many ways the entire point. One wonders whether they even watched the video for Rascal. But we suppose it's hard to see a video itself when all you ever see in a piece of music is a mirror reflecting back at your own uninteresting face.)",
            "So, to summarize:",
            "Review of RMR: 7 <br>Review of P4k review of RMR: 3.3<br>Review of P4k: [vomit emoji]<br>Review of smartphone/server wiping: ",
            "<img src=\"img/mrclean.png\">"
        ]
    }, {
        "song": null,
        "artist": "Phoebe Bridgers",
        "album" : "Punisher",
        "spotify_id": "2xECuqnvvmVktV7UO8Dd3s",
        "post_page": "2020-06-22",
        "description_lines": [
            "We're <i>still</i> taking down large portions of Bridgers' <i>Stranger in the Alps</i> (2017),  so the surprising release of this year's Punisher is almost too much for us to handle. We haven't had time to fully get into it, and have only gotten through a listen or two, so take everything here with a grain of salt.",
            "(First, however, a brief aside...we were out Friday night and into the early morning hours of Saturday--<i>day? night? what's day? what's night? to whom? and if so how?</i>--with an old friend who told us a story. Here is a friend who has long harbored a hatred for Eric Clapton, and for his birthday last year, a writer friend of <i>his</i> surprised him by publishing <a href=\"https://thebaffler.com/latest/the-fairest-soul-brother-in-england-marzoni\">an article</a> on Clapton's racist history. Well, it turned out that Phoebe Bridgers read that article, and has stated in an interview that it served as the inspiration for the track \"Moon Song,\" which appears on <i>Punisher</i>. So we basically wrote this song.)",
            "Anyway, as for the record itself--like we said, we're still on early listens. Impressions so far? This is still Bridgers, but a little bigger, a little more expansive. Gone, or at least a little further buried, is the pure ambient warmth of her trundling rhythm guitars. It's like she found out about computers, and effects. They're not overdone by any stretch--in fact, they're used quite tastefully--but the greater emphasis on production definitely gives the impression of an older, more mature musical artist. String work shows up as early as the opener, and we even get some horns a few tracks in.",
            "In sum, we like it so far, but a big part of Bridgers' appeal is her nuance, subtlety, and understatement, and that kind of thing normally takes at least several listens to fully sink in."
        ]
    }, {
        "song": "get off",
        "artist": "groan room",
        "spotify_id": "4bRa6E85kNoVREhlu0OCtx",
        "post_page": "2020-06-22",
        "description_lines": [
            "Here's a first--a review by request! It turns out someone on this listserv knows someone who knows someone. We won't say who. They're like racists and communists. They walk among us, they could be anyone. Look to your left. Look to your right. ALL of you are bodysnatchers! Are you now or have you ever been, et cetera, et cetera. We'll never tell.",
            "At any rate, groan room is a new group with 67 total listens on Spotify as of this moment. \"get off\" feels modern, but like a well wet sommelier with a Burgundy white, we're picking up a lot of subtle notes here. Nirvana? BoJo? We've also gotten tips on Pavement, Yuck, and Built to Spill. We'll see how this one ages--and what the new vintages show us when they arrive--but for now, we're sipping pleasantly on it. Get in on the ground floor so you can go out to some bar tonight and tell some tasty treat about your new favorite band that neither they nor anyone they've ever heard of has ever heard of."
        ]
    }, {
        "song": "Piltdown Man",
        "artist": "Frances Quinlan",
        "spotify_id": "5fXCsxVsE4q4Yz92QtrUKv",
        "post_page": "2020-06-08",
        "description_lines": [
            "Here's a new artist whose sole contribution on Spotify is this year's debut LP Likewise. Her unusual voice, playfully free-associative lyrics, and arpeggiated melodies evoke Joanna Newsom, only rougher, with a little more of a folk-punk sensibility. The record opener, \"Piltdown Man,\" is our personal favorite, but there are lots of worthy tracks in play--check out \"Went to LA\" for the kind of eyebrow-raising rough and raw emotion you might find in a surprisingly good local line-up. Like Newsom, this isn't exactly easy listening. You've got to pay attention. But, for the most part, it's worth it."
        ]
    }, {
        "song": "Fair Shot",
        "artist": "Slaughter Beach, Dog",
        "spotify_id": "6LdrUBLETkQTYDFsEuK1rw",
        "post_page": "2020-06-08",
        "description_lines": [
            "Slaughter Beach, Dog have appeared in this thread before, and they're back here with this nice, soft track which just kind of peacefully walks along toward its harmonica conclusion. We haven't got much to say about this one--in the vein of Tobias Jesso, it's just a really well-made, pleasant song."
        ]
    }, {
        "song": "The Poet Acts",
        "artist": ["Philip Glass", "Bruce Brubaker", "Max Cooper"],
        "spotify_id": "0XiMoe7Dh3CcF5sYNWIwYR",
        "post_page": "2020-06-08",
        "description_lines": [
            "This new track is a 4-minute piano ballad over some synthy bass tones and scritchy-scratches and weepy-woops that is sure to make you feel all haunted and meaningful. It could almost be the instrumental portion of a Radiohead track (imagine Thom Yorke whining about the electronic horrors of the post-climate change Earthscape over this one) or the soundtrack to some movie in which Jake Gyllenhaal plays a lone spaceman at an abandoned intergalactic outpost who slowly loses his mind as he confronts the unending horrors of the infinite cosmos. It almost evokes an updated Kronos Quartet take on some of the pieces from <i>The Fountain</i>, if that helps at all."
        ]
    }, {
        "song": "Undead God of War",
        "artist": "Tre Burt",
        "spotify_id": "17pQuFJDgCkqSCVgxRailx",
        "post_page": "2020-06-08",
        "description_lines": [
            "He looks like a cross between Chaz Bundick and Donald Glover, and sounds like a cross between Bob Dylan and The Tallest Man on Earth. What? Yes. I am right. This is a great neo-folk track with some classic harmonica accompaniment on top. If you listen closely, the lyrics are vaguely political, but in a Dylanesque or Chapmanesque way that doesn't undermine the artistry. Though this be ideology, in other words, yet there are aesthetics in it."
        ]
    }, {
        "song": null,
        "artist": "Snarls",
        "album" : "Burst",
        "spotify_id": "5JoS6MbEFOKErbW1g96uqn",
        "post_page": "2020-06-08",
        "description_lines": [
            "We almost hesitate to list this one this week, as we just discovered it yesterday and have only had the time to listen to it once or twice through. However, the tracks seem to be sticky enough that we wanted to bring it to the people as soon as possible. After all, the WMT is a democracy. <i>Everything</i> is a democracy. You are, <i>literally</i>, a democracy.",
            "So, in lieu of saying anything more, we're simply going to put this one out there and ask, like a lonely mid-Western voting booth warding off malevolent Russian interference, what do y'all think?"
        ]
    }, {
        "song": "I'M NOT OVER YOU",
        "artist": "RMR",
        "spotify_id": "7azKwxRJQYTjshRkbLQVQS",
        "post_page": "2020-06-01",
        "description_lines": [
            "It feels like we check RMR's Spotify page every day, waiting week after week to bring you news of his ever-impending EP. Unfortunately, we still haven't got that, but last week brought us a new single: \"I'M NOT OVER YOU.\" \"I'M NOT OVER YOU\" continues the same trap-country trend as RMR's debut single, \"RASCAL,\" although without quite the same level of spectacle. It leans harder into the country sound, true--the song opens with and then flows over a finger-picked banjo melody--but it's the weakest of RMR's offerings thus far. Admittedly, part of this might be due to the fact that it's the only of RMR's three singles to be released without a video, and that the his imagery is intimately tied up with what makes his music so refreshing. The fact that \"I'M NOT OVER YOU\" is essentially a break-up song, however, robs it of the startling contrast that marked his first two efforts. We'll reserve judgment until we see the video. Until then, \"I'M NOT OVER YOU\" establishes that RMR's trap country sound was not some one-off parlor trick, but pales in comparison to the debut that announced that genre."
        ]
    }, {
        "song": "Automatically in Love",
        "artist": "Carly Rae Jepsen",
        "spotify_id": "69XN0XjxcMtUCrvOEd0KYd",
        "post_page": "2020-06-01",
        "description_lines": [
            "Last week, we brought you the album opener to Carly Rae's new <i>Dedicated Side B</i>. At the time, we mentioned that we never spent much time with 2019's <i>Dedicated</i>, and we're trying to rectify that. One of the tracks that's helping is \"Automatically in Love.\" It opens with some really fat, synthy sounds--they're so plush you can sit on them and they start to feel pretty fuzzy by the time you reach the bridge. The mix is also very drum-heavy, which, when combined with the slow tempo and sixteenth-note hi hat part, really accentuates every single beat across every single bar. In other words, it's hard not to bob your head.",
            "At some point, this shtick is going to get old. Or it's not. After all, it hasn't yet..."
        ]
    }, {
        "song": "Dreaming of",
        "artist": "Phoebe Green",
        "spotify_id": "48WIvbuYEhz3xeXif08Dh0",
        "post_page": "2020-06-01",
        "description_lines": [
            "We'd never heard of Phoebe Green before, and a cursory search reveals that she hasn't released much music to date: a short record in 2016, and then a couple of singles since. This track opens with a funky shuffling drum beat over ominous, held bass notes which together are evocative of <i>In Rainbows/The King of Limbs</i> era Radioface. The similarities don't end there--Green also has a penchant for repeating seemingly innocuous phrases that take on larger meaning in the context of the song. It also has some Interpol-wave synth to it. This is a cool one--we recommend it for sure."
        ]
    }, {
        "song": "Stay",
        "artist": "Future Generations",
        "spotify_id": "6BUC7ZGVswWxJNnK2XDQ12",
        "post_page": "2020-06-01",
        "description_lines": [
            "This track has a happy-go-lucky vibe that feels like \"California Sun\"-wave Ramones meets The Strokes. That's about all we got."
        ]
    }, {
        "song": "PTA",
        "artist": "The Lawrence Arms",
        "spotify_id": "3reyYApWAn5lkEckK5mgoL",
        "post_page": "2020-06-01",
        "description_lines": [
            "We've written here before about the Larry Arms, including an Up the Punx segment on 2006's <i>Oh! Calcutta!</i>, which is pretty close to a perfect punk record if ever we've heard one. We'll also refresh your memories as to \"The Slowest Drink at the Saddest Bar on the Snowiest Day in the Greatest City,\" which is just...sublime.",
            "Well, last weeks, the Lawry Second Amendments released a new track, \"PTA.\" It's pretty much their usual brand of dual vocalist-driven power-chord punk. Not as catchy as a lot of the tracks mentioned above, but it's still a really solid effort (and hopefully indicative of further upcoming releases)."
        ]
    }, {
        "song": "My House",
        "artist": "Kitten",
        "spotify_id": "3dcBeyPtKfTeV4sn789ptS",
        "post_page": "2020-05-26",
        "description_lines": [
            "We previously brought you both the original and acoustic versions of another Kitten track, \"Memphis.\" That one was notable for its supreme crafting as a pop song--flawlessly conceived and executed, an example in which the whole was greater than the sum of its parts. Today, though, we bring you \"My House,\" which is sort of the opposite. The song revolves around a simple melody and just one or two lines--all of which get continually reinterpreted through various instruments and musical styles. Electronic instruments, organic acoustic instruments, vocal effects, and more, until the track starts breaking down into bleepy bloops. The key here is the infectious loop it all happens over--it's so catchy that it ties the entire schizophrenic song together."
        ]
    }, {
        "song": "This Love Isn't Crazy",
        "artist": "Carly Rae Jepsen",
        "spotify_id": "03o4HPzUwftpgAPNQSuaBS",
        "post_page": "2020-05-26",
        "description_lines": [
            "C-Rayz Jepsen has been a favorite for us since 2015's <i>EMOTION</i>--followed up impressively with 2016's short but near perfect <i>EMOTION Side B</i>. As we've noted here before, we never really invested the time we needed into 2019's <i>Dedicated</i>, but it looks like we'll need to. This past week, Carly Ray J dropped <i>Dedicated Side B</i>. As you might expect, we haven't spent enough time with it yet to really make comment here, but the opening track, \"This Love Ain't Crazy\" is iCarly at her best. Another synth pop masterpiece, this track has an effervescent forward energy that distinguishes it from the largely more sexual, cynical tracks from those previous records. It feels optimistic. And it is very, very catchy."
        ]
    }, {
        "song": "I See You",
        "artist": "Phoebe Bridgers",
        "spotify_id": "6Xa2Y4EP6wossxPv1kUy2c",
        "post_page": "2020-05-26",
        "description_lines": [
            "After our recent introduction to Bridgers in the form of her 2017 <i>Stranger in the Alps</i>--a very organic album at least partially influenced by her break-up with Ryan Adams--we are still a little surprised at the degree of production and effects included on her newer tracks. Still, this one really grabbed us, and it feels very much like an appropriate evolution after that first record."
        ]
    }, {
        "song": "stupid horse (Remix) [feat. GFOTY & Count Baldor]",
        "artist": ["100 gecs", "GFOTY", "Count Baldor"],
        "spotify_id": "0aV4YQ18bZ9qt0PDUZIDSz",
        "post_page": "2020-05-26",
        "description_lines": [
            "This track combines three of the worst things in music: (1) errant capitalization (or lack thereof); (2) \"feat.\"; and (3) remixes. The song identifier on Spotify, reproduced here, looks like an incoherent line of code, and we have never met a single remix we ever liked. Until now, that is. If any artist's music lends itself to remixes, it's 100 gecs, and this one is a fun new take on one of the catchiest tracks off of 2019's <i>1000 gecs</i>."
        ]
    }, {
        "song": "No Rain",
        "artist": "Drab Majesty",
        "spotify_id": "5DFd4zB38aguAiHVwQ2op6",
        "post_page": "2020-05-18",
        "description_lines": [
            "The sole entry on our list this week (and not for lack of looking), this is an '80s, Depeche Mode-like take on Blind Melon's \"No Rain.\" Although we've never been particular fans of the original, it is an undeniable classic, and yet this take on it is somehow fresh and retro, new and nostalgic, at the same time. <i>We</i> happen to think that it actually works better than the original, but we're not sure anyone will agree with us on that..."
        ]
    }, {
        "song": "Tegel",
        "artist": "Lambert",
        "spotify_id": "5Vh9sUjTiivWtvKmif40wy",
        "post_page": "2020-05-11",
        "description_lines": [
            "We plugged Lamby on here a few weeks ago for his mysterious mask and gloomy piano tunes. The mask is still there, but this new release is a little more upbeat. There's not much to say about these, but they're really nice for cooking, chilling, or having meaningful candlelight conversations with once and former lovers."
        ]
    }, {
        "song": "The Night in Question",
        "artist": "TV Girl",
        "spotify_id": "2UXhV8EMkfNX1MZfBKPjNI",
        "post_page": "2020-05-11",
        "description_lines": [
            "These bad motherfuckas have been on our radar since a friend first fished them out of a bag of wallets for us back with 2018's fabulously titled <i>Death of a Party Girl</i>. Well, on the first of this month, TV Girl released outtakes from the 2014 record <i>French Exit</i>. This one, \"The Night in Question,\" has got all of the classic TV Girl vibes: the <i>ennuyeux</i> vocals, the shimmery constantly moving undercurrents, the dozens of tracks that show up for the chorus and drop out for the verses."
        ]
    }, {
        "song": "My Bike\"and \"Dennis Hopper in Easy Rider",
        "artist": "2nd Grade",
        "spotify_id": "60oaw9CeevDAdmFM8d4HGi",
        "post_page": "2020-05-11",
        "description_lines": [
            "We've never heard of these guys before, but these tracks jumped out at us this past week. \"My Bike\" is a sad, slowly strummed twanger reminiscent of The Weakerthans, whereas \"Dennis Hopper in Easy Rider\" is a moving, bouncing, teenie bopper anthem that evokes The Ergs! and other sorts of happy-go-lucky, energetic pop punk outfits. It's still got that Weakerthans vibe, but like, they're <i>happy</i>.",
            "With both of these tracks, you get the idea pretty much immediately, but you stick around to see the rest anyway."
        ]
    }, {
        "song": "Man of Weakness (Acoustic)",
        "artist": "Your Smith",
        "spotify_id": "2wNxLMab6QXz0gqFaF3SHM",
        "post_page": "2020-05-11",
        "description_lines": [
            "Variations on a theme--we don't know Your Smith either. This is a nice acoustic chick track. It sounds like something Phoebe Bridgers and Julien Baker might have collab'd on before they matured as songwriters. It's not going to blow you away, but it's not going to turn you away, either."
        ]
    }, {
        "song": "Striking\", \"May I Have This Dance\", and \"Morning",
        "artist": "Francis and The Lights",
        "spotify_id": "4A3sNKJXtH0bG2JvslzN8H",
        "post_page": "2020-05-11",
        "description_lines": [
            "You guessed it--we'd never heard of Francis and the Lights, either. Judging by their listens on Spotify and some of their collaborators (Chance the Rapper and Justin Vernon (of the Justin Vernons)), we are late to the party on this one.",
            "We're not sure exactly what to make of them. They feel to us almost like a cross between Peter Gabriel and The Weeknd? \"Striking\" is one of their oldest tracks on Spotify, and it feels much more organic and experimental. \"May I Have This Dance\" is more corporate, more professionally produced, and the Chance remix feels a little bit cynical and opportunistic, but it is at the same time an undeniable earworm. The same goes for \"Friends (feat. Bon Iver).\" Everything about these tracks makes us want to want to (not a typo) roll our eyes, but the truth is that this is pretty solidly constructed music, even if it's not entirely for us. It's the side of Justin Vernon's music that could have had interesting commercial appeal if he hadn't reached a higher plane of auteur consciousness and left us mere mortals behind in the dust.",
            "\"Morning\" has the same kind of easy-rolling, Sunday morning vibe as other famous morning songs--\"Sunday Morning,\" \"Easy,\" etc. The jaunty, rolling keys give the effect of actually walking down the sidewalk, reflecting on your life and its relationship to Justin Vernon's.",
            "We will be curious to see what kind of rxns these tracks get from the rest of the crew."
        ]
    }, {
        "song": "Presumably Dead Arm (617 Sessions)",
        "artist": "Signey Gish",
        "spotify_id": "7iFmqWr2KDvNJt9ZCm7V21",
        "post_page": "2020-05-04",
        "description_lines": [
            "We had a brief but torrid affair last year with Sidney Gish's 2017 record <i>No Dogs Allowed</i> (and how about <i>that name</i>, by the way?). This is another of her tracks from 2017. It's light and finger-picked--until it's not. The strummed guitar that comes in halfway through gets a lot twangier, and Gish's voice gets more shrill and desperate. It's a nice juxtaposition, and it underlines the frantic feelings behind the lyrics",
            "We find now looking back that you've got to be kind of in the mood to throw on <i>No Dogs Allowed</i>, but \"Presumably Dead Arm\" feels a little much universally approachable."
        ]
    }, {
        "song": null,
        "artist": "Day Wave",
        "album" : "Crush",
        "spotify_id": "3hfl52ng9pom8zbp1RLJzx",
        "post_page": "2020-05-04",
        "description_lines": [
            "A nice little new EP that came our way this past week from a group by the name of Day Wave. We don't know much about them, but the opening track \"Starting Again,\" hits you from the opening notes. It feels like an intersection between Tycho and <i>Minors</i>-era Toro y Moi. It's got the deep, simple bass lines of chill/vaporwave, set against a running tambourine line that gives a nice sense of forward motion to the track. The lyrics are sufficiently distant to enhance the chilled out, day drunk effect of it all. When it comes to the other tracks on the EP, they're not nearly as standout, but they're all solid. Second place goes probably to the closer, \"Crush,\" which is a lo-fi, pretty, rolling piano ballad somewhat in the vein of Tobias Jesso, Jr."
        ]
    }, {
        "song": null,
        "artist": "Alex Cameron",
        "album": "Miami Memory",
        "spotify_id": "33u2PRETjYklC6UqxJBGW2",
        "post_page": "2020-05-04",
        "description_lines": [
            "The opening few tracks on this record are FIRE. Specifically, the first track, \"Stepdad,\" has a real Honey Boy feel to it. It's written as a short-fallen good-bye from a failed stepdad to his stepson as he's being kicked out of the house. It has a glitzy, flashy feel to it, but the whole thing is against a single line in the chorus: \"I'm your step-dad.\" When Cameron hits the word \"dad,\" he hits it flat every single time, and the effect creates the very feeling that we imagine one would have toward just such a routinely imperfect stepparent. To us, this track is really the stand-out on the record.",
            "\"Stepdad\" is followed by the eponymous \"Miami Memory.\" Sufficiently sleazy, this track is tombout \"eatin' your ass like an oyster\" and \"[comin'] like a tsunami.\" The whole thing fits with Alex Cameron's general persona as a failed entertainer. The next track, \"Far From Born Again,\" came across our radar a few weeks ago, and we were torn enough on it at the time that we didn't include it on that week's WMT. Now, with the context of the entire record around it, we understand this track a lot better.",
            "We haven't had as much experience with some of the lattermost songs, so those remain to be truly explored."
        ]
    }, {
        "song": "Powder Blue / Cascine Park",
        "artist": "Yumi Zouma",
        "spotify_id": "1WnB6Oe5PHoV83UIYmq0sz",
        "post_page": "2020-04-27",
        "description_lines": [
            "You all know the Yummy Zoomsters by now--in fact, you all probably <i>are</i> yummy Zoomsters by now--but this is an older track that we just stumbled upon. It's not included on any of Yumi Zouma's LPs, and instead appears on 2018's <i>EP III</i>. It's pretty classic Why Zed, with a shuffling, persistent, hi-hat driven pulse underneath breathy vox and ethereal keys. Best listened to, like all Zumi Youma, day drunk and lazing on a yacht somewhere."
        ]
    }, {
        "song": "Pink Pony Club",
        "artist": "Chappell Roan",
        "spotify_id": "4xeGlEItAGRsWFykY7ixjW",
        "post_page": "2020-04-27",
        "description_lines": [
            "This one starts off as a breathy, piano ballad, but quickly dives into the sort of synthy, pulsing music we've come to expect of indie chicks over the last ten or so years. It's repetitive--I'm gonna keep on dancin', and on and on--but in the same sort of hypnotic way as all of these songs. We don't know much about Chappell Roan--it looks like she's released a handful of other tracks, none of which particularly grabbed us--but we'll keep an eye out for more from her in the future."
        ]
    }, {
        "song": "everyone blooms",
        "artist": "The Front Bottoms",
        "spotify_id": "1ifHinbz0uDy856VRBMPEE",
        "post_page": "2020-04-27",
        "description_lines": [
            "The Fun Bottoms have been one of our more distinct discoveries here. Their sound is instantly recognizable, and this track is no different, right down to the half-sung, half-not-quite-screamed-but-still-quite-forcefully-stated lyrics. It's no \"camouflage\" or \"twin-size mattress,\" but it's still worth a listen.",
            "Weirdly, the FBs are apparently opening for Jimmy Eat World on tour in the late summer/early fall..."
        ]
    }, {
        "song": "Dealer",
        "artist": "RMR",
        "spotify_id": "2DwKP4rWgDwefcFsPWT9pj",
        "post_page": "2020-04-20",
        "description_lines": [
            "Several weeks ago, we brought you [via Chris Koller] the absolutely fire \"Rascal\" from RMR. The mysterious artist is out with a new track and video, \"Dealer.\" It's shorter and less shocking than \"Rascal,\" but still very high quality and worth a listen. The video features a man--presumed to be the artist himself, in his now trademark ski mask and sandals+socks combo--being buried alive at the beach by some white lady.",
            "If you hop over to RMR's YouTube channel, you'll also find that the artist has posted a series of short videos which seem to serve as...trailers? for upcoming tracks. A couple released last week ended with the word DEALER flashed across the screen, and one posted three days ago seems to be advertising an upcoming track called \"Her Flesh Was Forbidden\"? We're staying tuned on this front for sure.",
            "We've also discovered, through this <a href = \"https://www.youtube.com/watch?v=RqOEobuVfkM\">Digital Fader Fort 2020 performance of \"Rascal\"</a>, that the artist's name is not pronounced \"Arr-emm-arr\" as we initially thought, but actually \"rumor.\" Who knew? At any rate, this video's worth a watch too--the St. Laurent bulletproof vest is swapped out for a Canada Goose jacket."
        ]
    }, {
        "song": null,
        "artist": "Lambert",
        "album" : "True",
        "spotify_id": "6U2xxftHI11KUGHckT6LE5",
        "post_page": "2020-04-20",
        "description_lines": [
            "This little-known German artist produces nice, short instrumental tracks--mostly synth and keyboard. There's not much to say here, except that this album is a really nice, gloomy listen--it's almost got a \"True Love Waits\" vibe to a lot of it--and that the artist apparently only performs with a Sardinian mask on. So, there's that.",
            "Check out the track \"Awake\" for a nice nugget."
        ]
    }, {
        "song": "China Gates",
        "artist": "John Adams",
        "spotify_id": "1yzoe7r21sTWPcPc57OrPc",
        "post_page": "2020-04-20",
        "description_lines": [
            "John Adams did the score for Luca Guadawannaneedahavea Bojangles' <i>I Am Love</i>, and just dropped this nice new piano track this week. It's very much in the skittery, shimmery style of that score, so if that appealed to you, then this will to."
        ]
    }, {
        "song": "Valens",
        "artist": "Graveyard Club",
        "spotify_id": "0zDnleArIoIwZ04qwhSZI3",
        "post_page": "2020-04-20",
        "description_lines": [
            "Graveyard Club have appeared here before, and by now, you know what to expect. This is an upbeat, synthy, shiny, slap-happy track, like M83 meets Chairlift."
        ]
    }, {
        "song": "forever",
        "artist": "Charlie XCX",
        "spotify_id": "5GsJIVCBFjhCcUwJaTW2sB",
        "post_page": "2020-04-20",
        "description_lines": [
            "We feel like we missed the boat on Charli XCX and, to be frank, still aren't really all that familiar. But this track popped up on our radar this past week and it really appealed to us. It's catchy, but the catchiness is masked by noise and constant shifts that keep us on our toes, like a more approachable Sleigh Bells or 100 gecs. Eventually the entire track deteriorates, decomposes, falls apart. It's a cool effect. We're open to other Charli XCX recos, if y'all got 'em."
        ]
    }, {
        "song": null,
        "artist": "The Bardic Depths",
        "album" : "The Bardic Depths",
        "spotify_id": "0pkbTVogVavulw1uNRC5sE",
        "post_page": "2020-04-20",
        "description_lines": [
            "This one's a little unusual--a prog rock concept album about the friendship between J.R.R. Tolkien and C.S. Lewis, with lyrics written by a history professor at Hillsdale College. It actually...kinda works. We haven't spent that much time with it but it's surprisingly approachable on first listen. It's definitely got an old school prog feel to it, but nothing too intricate. Fans of Pink Floyd will feel at home enough to get a handle on it."
        ]
    }, {
        "song": null,
        "artist": "Empty Country",
        "album" : "Empty Country",
        "spotify_id": "5AQVArKM4CPlbVwb4KG6mK",
        "post_page": "2020-04-20",
        "description_lines": [
            "This one came across our radio due to the fair amount of positive press it's been receiving. We can't say we like it quite as much as the reviews suggested we might, but it's a very solid record with some really nice tracks. The opener, \"Marian,\" is ABSOLUTE FIRE. It will get you moving instantly and keep you moving the entire time. We feel, unfortunately, that it makes a bit of a promise that the rest of the record can't keep, but that being said, we've been spinning this more than anything else this week."
        ]
    }, {
        "song": "End Summer",
        "artist": "Goth Babe",
        "spotify_id": "1OQEF0LsL7KMQmBZSiUcdE",
        "post_page": "2020-04-06",
        "description_lines": [
            "A new Goth Babe track off of an apparently new Goth Babe EP, <i>Mt. Bachelor</i>. This one is upbeat and has the sort of bendiness of a Neon Indian track, with a lighter, happier undercurrent of Toro y Moi."
        ]
    }, {
        "song": "Sunbelt",
        "artist": "Ruby Haunt",
        "spotify_id": "28gNiH0DVmJHILFsxkTJZk",
        "post_page": "2020-04-06",
        "description_lines": [
            "We really fell in love with Ruby Haunt's \"Curtain Call\" last year, and this track's got the same vibe. It's got an almost Explosions in the Sky-like intro: minutes of slow, interlocking guitar melodies which seem to meander into each other's places and fill one another in. At a certain point, you wonder whether you even need anything else, or whether these parts will simply become the soundtrack to your life [via Kid Cudi]. Just before minute three, though, you get some soft, whispered vox. The track continues like that, trace-like, for minutes and minutes, until all of a sudden you notice that the tempo has at some point started gradually increasing. The melancholy of the slow first six minutes turns into desperation and the song becomes just a bit overwhelming, before slowing back down. Listen to this one meaningfully, under some sort of colored moon, perhaps."
        ]
    }, {
        "song": "Be Your Boy",
        "artist": "Medium Build",
        "spotify_id": "0mvbSAjTbLc6ExAaDh5vlM",
        "post_page": "2020-04-06",
        "description_lines": [
            "We've never heard of this group before, but this track has a decidedly Wild Beasts kind of bounce to it. A slightly peculiar voice, odd instrumentation, and heavy sexual overtones. It's not quite as dark or weird as Wild Beasts (and thus not quite as good)--almost more like a cross between WB and, we don't know, Ra Ra Riot?--but it's worth a listen."
        ]
    }, {
        "song": "The Steps",
        "artist": "Haim",
        "spotify_id": "0aogemGEeklb2Hj9akWhxr",
        "post_page": "2020-04-06",
        "description_lines": [
            "Haim were critical darlings a few years ago, and although we liked some of their tracks, we never really felt that they rose the level of that critical reception. They felt a little overproduced and cutesy for us. This track, however, strips a lot of that away. The track has a slightly lower fi, garage-y feel to everything, which actually works quite nicely against their more traditional sing-songiness. It feels like it would go nicely over a sepia-toned montage of some parents in some movie back when they were just a couple of teenagers having fun together."
        ]
    }, {
        "song": "Get to Know You",
        "artist": "Tomo Nakayama",
        "spotify_id": "6LpfuMXJuFc1WQbv9xqizX",
        "post_page": "2020-04-06",
        "description_lines": [
            "We believe this is our introduction to this artist, but it's a good one. It feels like a blend of Passion Pit and Phoenix, but with a little more of that darker synth underneath--like it'd be at home on a recent Nicolas Winding Refn soundtrack. Seems like a track that's made for innocent pre-games, sounds after the sun sets, the possibilities of the evening and even the weekend stretching before you. Like things we were optimistic about back when we were still in college."
        ]
    }, {
        "song": "Open Relations",
        "artist": "Heart Bones",
        "spotify_id": "7rLcSgHPOoyezzxUWaS5uA",
        "post_page": "2020-04-06",
        "description_lines": [
            "We believe this is our introduction to this artist, but it's a good one. It feels like a blend of Passion Pit and Phoenix, but with a little more of that darker synth underneath--like it'd be at home on a recent Nicolas Winding Refn soundtrack. Seems like a track that's made for innocent pre-games, sounds after the sun sets, the possibilities of the evening and even the weekend stretching before you. Like things we were optimistic about back when we were still in college."
        ]
    }, {
        "song": "Closer",
        "artist": "Sedona",
        "spotify_id": "7gxggGz6P9d5Ivw5jpDvo5",
        "post_page": "2020-04-06",
        "description_lines": [
            "Like most of the entries this week, this is an artist unfamiliar to us. The track's got a growling, throaty bass line that zig-zags the entire track along on the millipede feet of a sixteenth-note patter on the hi hats. Like any pseudo-R&B synth chick track, it makes its money in the chorus, where it repeats one key line over and over again: \"you bring me closer.\" As you listen, you'll agree, like, \"yeah, this DOES bring me closer!\" There's really not all that much more to say about this one. It does one thing and it does it pretty well."
        ]
    }, {
        "song": null,
        "artist": "Forth Wanderers",
        "album" : "Forth Wanderers",
        "spotify_id": "6CcHec833q5gHVMU7He9U6",
        "post_page": "2020-03-30",
        "description_lines": [
            "This one came out of nowhere. We would pick out tracks, but it's a pretty wholly conceived piece of work and we'd recommend a straight-through listen. It's got this forlorn, peculiar, slightly demented atmosphere about the entire thing. Melodies weave in and out of dissonance on many of the tracks. The best we can describe it: Beach Bunny meets <i>Doolittle</i>-era The Pixies. ",
            "(This is the only non-folk-informed entry on this list.)"
        ]
    }, {
        "song": null,
        "artist": "Phoebe Bridgers",
        "album" : "Strangers in the Alps",
        "spotify_id": "0AkAmg94XyiHODJaiGHh9O",
        "post_page": "2020-03-30",
        "description_lines": [
            "Wow. Bridgers had popped up on our radar once or twice before but we'd never really taken notice. Well, we have now. This 2017 record is absolute FIRE. It's got a very similar vibe to Julien Baker (with whom Bridgers collaborates on the project boygenius), but the music seems slightly more nuanced and restrained, and the lyrics are a lot closer to true poetry than are Baker's. There's also a touch of DeYarmond Edison-era Justin Vernon (read: <i>pre</i>-Bon Iver).",
            "These are sad songs, and good ones. There are lots of little whispers of guitars and ghost notes, soft hums and plugs of basses. We highly recommend a listen-through on this one as well, and on headphones only, and when you have the time to focus. This is the kind of record to pump directly into your ears as you lay back in the warm grass with your eyes closed. If you put it on while doing other things, you'll miss almost all of it. (Maybe that's why we never really noticed Bridgers before?)",
            "This is a serious work of art. Sample \"Motion Sickness\" and \"Scott Street\" if you need any more convincing."
        ]
    }, {
        "song": null,
        "artist": "Brian Fallon",
        "album" : "Local Honey",
        "spotify_id": "6WvuOTh1OKRSajaaoGMv1N",
        "post_page": "2020-03-30",
        "description_lines": [
            "We've plugged Fallon here numerous times. The frontman of This Charming Man, The Gaslight Anthem, The Horrible Crowes, and more, Fallon has embarked on a solo career which has yielded two earlier records (2016's Painkillers and 2018's Sleepwalkers) and now this one. Those two earlier records are probably best categorized as, loosely, \"americana.\" This new on is much more folk-infused and recalls a lot of that softer Springsteen we mentioned.",
            "We think this record is deceptive. On first listen, it doesn't sound like much, but it's warm, homey, and comforting. We expect it to be more of a grower than it at first appears.",
            "In promoting the record, Fallon also recently released a playlist of \"calm down\" songs that he likes. We know y'all can't be bothered to be listenin' to each and every list everyone puts out, so we did it for you, and here are the greatest entries:",
            "<p style = \"padding-left: 5em;font-size: 80%\">\"Down to the River to Pray\" by Alison Krauss - You'll remember this lovely hymn from O Brother, Where Art Thou?</p>",
            "<p style = \"padding-left: 5em;font-size: 80%\">\"Big Black Car\" by Gregory Alan Isakov - The melancholy, finger-pickin swing of this one packs a subtle, understated wallop.</p>",
            "<p style = \"padding-left: 5em;font-size: 80%\">\"Wolf Like Me\" by Lera Lynn, Shovels & Rope - This one comes through in the vein of Marlon Williams' \"Strange Things\" (which was used to great effect in <i>Wild, Wild Country</i>). If you have trouble finding this one, look for her 2018 album <i>Plays Well With Others</i>. It's not a grabber at first, but wait for those dusty, western guitar chords to kick in. Once you make it there, start looking out for those low, rumbling drums and you'll be well on your way.</p>",
            "<p style = \"padding-left: 5em;font-size: 80%\">\"First Defeat\" and \"Family\" by Noah Gundersen - We're not quite sure how we hadn't heard about Noah Gundersen until now. He seems to be a major artist, both in terms of acclaim and the quality of his output. He cites Ryan Adams and Neil Young--among others--as his inspirations, and it comes through in his sound. These songs are pretty and haunting, just like the most meaningful kinds of celluloid love interests. And speaking of pretty and haunting celluloid love interests, go on and throw this guy a Google image search, why don't ya? The guy's had as many hairstyles as Brad Pitt and looks just as at home in every single one of them.</p>"
        ]
    }, {
        "song": "Who Wants to be a Millionaire",
        "artist": "Chinatown Slalom",
        "spotify_id": "2mKK7JTK3HZkvEvEKNe9Fp",
        "post_page": "2020-03-23",
        "description_lines": [
            "We've never heard of these guys. It looks like they've got a single album out from 2019, but it sounds like it should've come out in 2012/2013 on the heels of the chillwave wave. It's not itself chillwave, but it seems to blend that feeling with some of the bleepy bloops from, say, neon indian. The song is catchy and yet, at the same time, unstable. All of the bleepy bloops sound like they're on their last legs and about to give out any moment. There's so much going on, and yet, it all sounds so...<i>chill</i>.",
            "The above track led us as well to \"Where U At?\", which has by far more listens on Spotify than any of their other tracks. It's solid, too, but \"Who Wants to be a Millionaire\" is where our money's at."
        ]
    }, {
        "song": "Something Has to Change",
        "artist": "The Japanese House",
        "spotify_id": "2KWI43agrQEFVLM3soOmKW",
        "post_page": "2020-03-23",
        "description_lines": [
            "Apparently these cats have been around for awhile, but we're just now hearing about them. This track reminds us of pronoun--not so much in the sound itself, but more in that it makes us think of an updated, monotone but more indie take on like '90s chick rock or something of that nature. Plus, it's got that repetitive lyrical magic--one phrase, over and over again, until it takes on almost biblical significance.",
            "We'll have to delve more into their catalogue later, but for now, test this little tasty teaser."
        ]
    }, {
        "song": "Bloom",
        "artist": "Great Grandpa",
        "spotify_id": "2AktemCmRjkEOU2ReNuP0r",
        "post_page": "2020-03-23",
        "description_lines": [
            "Another entry in the '20s songs for '90s kids, this one sounds like Matchbox Twenty/Gin Blossoms/Sixpence None the Richer/Tal Bachmann meets your garage and some indie core importance. At first, those latter licks are just a lil flavor, but as the song goes on, they become more and more apparent. Very subtle pitch-bending on an a cappella section, for instance, until the entire song slows and breaks into something else entirely."
        ]
    }, {
        "song": "Steel Birds",
        "artist": "Slow Pulp",
        "spotify_id": "2En9hPrl1Z2raU3CeYleUI",
        "post_page": "2020-03-16",
        "description_lines": [
            "Barrie meets Beach House. It's got the indie chick momentum of the former along with the lazy, hypnotic hi-hat rhythms and hollow recording quality of the latter."
        ]
    }, {
        "song": "Moth to the Flame",
        "artist": "Chairlift",
        "spotify_id": "1x7mSgmTRbbRu3lRX6gm8o",
        "post_page": "2020-03-16",
        "description_lines": [
            "About a decade ago, we used to spin \"Bruises\" by this group. (We're not the only ones--it's got nearly 40 million listens on ol' Spotify.) That one's a tasty treat, and it's like it's pretty and you're meaningful. This one...isn't. This is more of a pre-game track."
        ]
    }, {
        "song": "Get Lost",
        "artist": "Queen of Jeans",
        "spotify_id": "53pQDXXH5Y2EE4KB59p1x7",
        "post_page": "2020-03-16",
        "description_lines": [
            "Not exactly unanimous for the Names Hall of Fames, but a pretty good moniker nonetheless. This one builds up slowly with a couple of palm-muted verses. With each iteration, another instrument layers on top, creating a real promise of pay-off later on. And boy, when that pay-off finally comes, does it ever. It arrives like the punchline of a long, clever, winding joke--you knew exactly how hard it was gonna hit the whole time it was coming.",
            "(This, by the way, is the critical flaw in Lizzo's \"Good as Hell.\" Yes, that track builds from verse to chorus, but the verse-chorus couplings are identical. You could swap any verse-chorus combination for any other throughout the track and it would sound the same. A track like that, with an ostensibly feel-good, redemptive, sing-along chorus, should have built until it absolutely exploded. If it were a Michael Jackson song, for instance, it would have gotten bigger and bigger until a key change after the third chorus, and then vamped for another solid 2-3 minutes with a choir on top of it before finally ending. As it stands, that track is like have a meal consisting of the same exact dish meted out in the same exact portions for the appetizer, the entree, and the dessert. The result is a 2:40-long loop which somehow feels so much longer than a 5-6 minute MJ track of the type described above, because it never grows. How it made it through industry-leading engineering with such a striking and obvious fatal flaw is beyond us.)"
        ]
    }, {
        "song": null,
        "artist": "Yumi Zouma",
        "album" : "Truth or Consequences",
        "spotify_id": "0yss5R3uULkCI7Dc9jKRoV",
        "post_page": "2020-03-16",
        "description_lines": [
            "We should've known from the steady stream of new singles coming out, but we were thrown off by the fact that the three tracks in question seemed to have been bundled into a recent EP. At any rate, there's a new record out from fan favorites Yumi Zouma, and it's the most polished, present-sounding record of the three. Whereas the group's first two records felt and sounded muted, distant (in an absolutely fuego sort of way), this one sounds close enough that you can reach out and touch it. In our opinion, \"Southwark\" and \"Cool for a Second\"--previously reviewed here--are still two of the best new tracks, but add opener \"Lonely After\" to that list as well. The penultimate track, \"Magazine Bay,\" almost has that old funk/R&B BJs/Blood Orange/Carly Rae ft. Dev Hynes feel to it, too."
        ]
    }, {
        "song": "Won't Let You",
        "artist": "MorMor",
        "spotify_id": "1DvbkyyN4jCcffDbD7mJEC",
        "post_page": "2020-03-09",
        "description_lines": [
            "Does anyone else remember James Vincent McMorrow's moving \"Cavalier\" off of <i>Post-Tropical</i> from a few years ago? If not, get over to your favorite video streaming platform right now and check out that music video, because it's one of the rare music videos that's worth the watch and actually enhances the song.",
            "At any rate, this track is very reminiscent of that one, with a little bit of James Blake sprinkled in as well. It's the modulated, reverby falsetto chorale, the repetition, the synthy strings--all of it together."
        ]
    }, {
        "song": null,
        "artist": "Barrie",
        "album" : "Happy to be Here",
        "spotify_id": "74hkehs2cahKJ7jFLOrxYh",
        "post_page": "2020-03-09",
        "description_lines": [
            "This group first came to us on the strength of Sam's recommendation with the single \"Canyons.\" If you haven't heard that one yet, then drop what you're doing and give it a listen, because it slaps hard.",
            "<i>Happy to be Here</i> is the eponymous Barrie Lindsay's first full-length record. (\"Canyons\" appeared on her only previous release, a three-song EP entitled <i>Singles</i> from 2018.) The record's vibe doesn't exactly match that of Canyons--it's a little less synth forward and hazy. It's closest relative is probably Yumi Zouma, but the production quality has an atmospheric distance to it that's almost reminiscent of...wait for it...the Brothers Johnson (a funk and R&B outfit from the '70s). That may sound preposterous, but spin the BJ's \"I'll Be Good to You\" and \"Strawberry Letter 23\" (the latter of which almost has a Panos Cosmatos <i>Beyond the Black Rainbow</i> vibe to it at times) and tell us there isn't some sort of fellow travelership on the acoustics.",
            "Honestly, the record is \"quite okay\" from the opening track, \"Darjeeling.\" We were hooked then, but the follow-up \"Dark Tropical\" is equally listenable. The third track, \"Clovers,\" is what really reeled us in and let us know that this one was going to be a keeper. It's got a lead plinky piano part that almost has the flavor of \"Two Weeks\" off of Grizzly Bear's <i>Veckatimest</i>, only if that song and record were light/airy instead of incredibly and overbearingly pretentious. The whole record flows quite nicely, and one can easily pass an entire evening of cooking and eating steaks with a significant other and a close friend with the record on repeat like three or four times. "
        ]
    }, {
        "song": "The River",
        "artist": "Goth Babe",
        "spotify_id": "0ZSNmNgMmYT7o9cn57MESt",
        "post_page": "2020-03-02",
        "description_lines": [
            "Fresh new Goth Babe--this might be the best track yet. It's got that cool, breezy chill wave vibe we learned to love on temperate days out on the fratio behind Wannamaker."
        ]
    }, {
        "song": "Tommy in the 80s",
        "artist": "Beach Slang",
        "spotify_id": "5NUKRLQhkVOdKSeGGBViGU",
        "post_page": "2020-03-02",
        "description_lines": [
            "We've mentioned Beach Slang here before, and they're back with another pretty solid track. This one is an ode to '80s music from a contemporary punk take. It promises big in the beginning, and even though it doesn't quite build enough to bring the whole thing home, it's a nice enough listen."
        ]
    }, {
        "song": "RASCAL",
        "artist": "RMR",
        "spotify_id": "3wDkZTvrR6uhTvQqcE9vdx",
        "post_page": "2020-03-02",
        "description_lines": [
            "This one has rocked us to our very souls. It comes to us courtesy of a close friend, and we really recommend that the uninitiated watch the <a href=\"https://www.youtube.com/watch?v=WCdAtvwW1E8\">video</a> before reading on.",
            "This one is...everything. RMR, whoever he is, is an anonymous, apparently 22-year-old artist and this is his first contribution. It's a country R&B ballad that samples Rascal Flatts and meshes it with passionately sung, trap-style lyrics. (What?) The whole thing is auto-tuned up, too, which really sets it off. The true genius comes with the video, though. A performer (RMR? Someone else? Who knows? We never see his face from out behind his signature RMR and cross-emblazoned ski mask) and his crew wield very real-looking weapons while lip syncing over the track. That is about it, to be honest, but it's so much more than that. There's a Saint Laurent bulletproof vest, for starters.",
            "What really sets this whole thing off is the layered dualities. The over-the-top feeling of the R&B vibe, set against the crudity of the grotesque trap lyrics. The menacing nature of the clothing, set against the Christian imagery and Saint Laurent branding. The extremely forward-thinking blend of country pop and trap, set against the dinky, cheap, and frankly laughable transition effects used in the music video.",
            "All of this combines to cement a single question in our minds: who <i>is</i> this man??? Is he the singer in the video? Is he someone else? Is he black? Is he...white? Is he a technical genius who brilliantly balanced all of these things against each other, or is he a savant who simply struck the right mood at the right time in music?",
            "We don't know, but we look forward to finding out more."
        ]
    }, {
        "song": "Southwark",
        "artist": "Yumi Zouma",
        "spotify_id": "0YuFYmdojZmBYD9V5giqTR",
        "post_page": "2020-02-24",
        "description_lines": [
            "With three singles released in the last several weeks, the yummy zoomies seem to be on the verge of releasing a new LP. Of the three--all of which are wonderful--this one dug itself into our earballs the deepest. If this track were around back when we were in middle school, it would have combined itself with that unique brand of middle school meaningfulness to make us into Claire Danes + Leonardo DiCaprio."
        ]
    }, {
        "song": null,
        "artist": "nothing,nowhere",
        "album" : "Ruiner",
        "spotify_id": "6YyFPAahBvVV74rRNdVmff",
        "post_page": "2020-02-24",
        "description_lines": [
            "Y'all already know we short on case insensitivity. That being said, this artist is worth a listen. The only way we can describe his sound is \"dejected emo slow jams\"--which admittedly does not inspire confidence. Spin his 2018 record, <i>Ruiner</i>, though, and tell us it doesn't slap at least a little. Good stuff for when you're sad sometimes.",
            "Also check out his newest release, \"nightmare.\" This one came to us through the \"New Releases\" playlist in the Punk section of Spotify. We don't know that we'd really classify it as \"punk,\" but it sounds more like hip hop meets \"Somebody Told Me\" era The Killers."
        ]
    }, {
        "song": "Rnrn",
        "artist": "shinigami",
        "spotify_id": "38s4RfGPicRZRxAxS1D4rt",
        "post_page": "2020-02-24",
        "description_lines": [
            "We discovered shinigami alongside nothing,nowhere. It rides the same wave--sad, self-deprecating, suicide emo rap with a bit of an electric influence. This track is especially interesting, however, as it kind of sounds like Tom DeLonge and/or 100 gecs expanded into that genre."
        ]
    }, {
        "song": null,
        "artist": "Ricky Montgomery",
        "album" : "Montgomery Ricky",
        "spotify_id": "3EENSiRh7KUBYPSufAU84x",
        "post_page": "2020-02-24",
        "description_lines": [
            "And now for--to quote Monty Python--something completely different. Ricky Montgomery sounds like a super earnest, super corny modern take on '50s doo wop ballads. Either that, or what musicals would sound like if they were kinda similar to how they are now, only good. In other words, <i>these streets are made of music!</i> There's also a very faint Andrew Bird sort of element to it all.",
            "The opening track, \"This December,\" will tell you if you want to listen on or not. I don't think you'll hear anything else that sounds like this any time soon, though."
        ]
    }, {
        "song": "Memphis (Acoustic)",
        "artist": "Kitten",
        "spotify_id": "3ER29UJSyBlDp9uCYdkQxi",
        "post_page": "2020-02-24",
        "description_lines": [
            "If you haven't heard the original studio take, get thee to a nunnery and check that out pronto. After vibing to that for like four months the way we did, go ahead and move on to this really charming acoustic take. We don't want to ruin any surprises here so we'll just say this: there are some really fun sounds used to excellent effect in the original, and they get supplanted here in a way that somehow makes those parts resonate even harder. But only if you've heard the plugged-in version first.",
            "And, in both cases, that <i>bass</i> line. It's the kind of subtle vibe that blows your mind and then makes you breakfast to boot."
        ]
    }, {
        "song": "How I Get Myself Killed",
        "artist": "Indigo de Souza",
        "spotify_id": "4kgbbVuAkGzmldwcJxagFT",
        "post_page": "2020-02-24",
        "description_lines": [
            "Long have we known that there is hypnotic power in oft-repeated lyrics. (<i>\"For a minute there, I lost myself...\"</i>). And so it goes with \"How I Get Myself Killed\" by Indigo de Souza. Give it a spin, and in no time you'll be smiling, sighing, and saying to yourself, \"Yeah, this IS probably how I get myself killed!\""
        ]
    }, {
        "song": null,
        "artist": "Beach Bunny",
        "album" : "Honeymoon",
        "spotify_id": "6QZyKchQivUBTSMcoBmlPa",
        "post_page": "2020-02-24",
        "description_lines": [
            "This is it--the moment you've all been waiting for. The new Coastal Rabbits LP is out, and the whole is indeed greater than the sum of its parts. We've already spoken at length about like half of these songs here, and we know y'all are all already ahead of us on this one, so what more needs to be said?"
        ]
    }, {
        "song": null,
        "artist": "Destroyer",
        "album" : "Have We Met",
        "spotify_id": "3quNG7I59IYGauZ9Tn7Iyk",
        "post_page": "2020-02-24",
        "description_lines": [
            "A few weeks ago, we wrote about the first single off of this LP, \"Cue Synthesizer.\" We liked that one for its mix of classical Destroyer vibes with some interesting new directions, and the full-length release is no different."
        ]
    }, {
        "song": null,
        "artist": "tyfaizon",
        "album" : "basketcase",
        "spotify_id": "1dT6PTyfLNLcida4zA49Q4",
        "post_page": "2020-02-24",
        "description_lines": [
            "We don't really know what to do with this one. (Goddamn lower cases again, for starters...) It's been out for two years and yet has only 2,000 listens. It didn't grab us at first, but it's got this interesting summery, dreamy, beachy, Girls-y guitar vibe with--hip hop vocals? We're surprised to admit we've been coming back to it. It almost feels like something that could've fit on the <i>Mid-90s</i> soundtrack.",
            "Points for originality--this one could be polarizing, though."
        ]
    }, {
        "song": "Promises",
        "artist": "Beach Bunny",
        "spotify_id": "42aMYn1VqnZHIPGhnLhqhh",
        "post_page": "2020-02-10",
        "description_lines": [
            "We're honestly disappointed in any of you who haven't already discovered this one on your own."
        ]
    }, {
        "song": "Kinda Lovely",
        "artist": ["Poolside","Panama"],
        "spotify_id": "3g3lqFthZ9yjNhcCjUDzFW",
        "post_page": "2020-02-10",
        "description_lines": [
            "This one almost brings us back to college with its hazy, chillwavey bounce. Like a less washed out Washed Out. Find a girl you feel is kinda lovely, and listen to this one while you watch her emerge glistening from a swimming pool in a stylish throwback one-piece."
        ]
    }, {
        "song": "girls",
        "artist": "girl in red",
        "spotify_id": "1kqc6U8hVYZhY0gFGQclCz",
        "post_page": "2020-02-10",
        "description_lines": [
            "Never mind that the track and band contribute to the disturbing cultural trend of eschewing nuance in language. (Between acts which exclusively capitalize letters and acts which exclusively don't, you wish someone would make clear that upper and lower casings are tools, both of which have, you know, their uses.) The whole track sounds far away and underwater. It sounds sort of like Coastal Rabbits meets Japanese Breakfast."
        ]
    }, {
        "song": "Let's Be Friends",
        "artist": "Carly Rae Jepsen",
        "spotify_id": "6tcjcJFRSdkIlThUUP39mJ",
        "post_page": "2020-02-10",
        "description_lines": [
            "Carly Rae Jeps(t)e(i)n burst onto the scene back towards the end of our college days with the annoyingly infectious \"Call Me Maybe.\" In one of the great hero turns in history, she followed that up with <i>Emotion</i> and <i>Emotion Side B</i>, two of the greatest 80s chick synth pop revivals ever. We haven't really done our homework on 2019's <i>Dedicated</i>, but Crae Crae is back with her first single of 2020. We stick to our guns that any song with a spoken-word portion would be better off if it got rid of that spoken word portion, but this is another solid entry into Jepsen's '80s throwback canon.",
            "<a href=\"https://www.youtube.com/watch?v=hgwpZvTWLmE\">Obligatory CRJ video clip</a>"
        ]
    }, {
        "song": "Mal de Mer",
        "artist": "Pixies",
        "spotify_id": "6OMfxR47Rg2wnMhcQi0MHQ",
        "post_page": "2020-02-10",
        "description_lines": [
            "<i>Doolittle</i> is one of the greatest records of all time, and one of the first ones which turned us on to how good music could be back when we were cruisin' in the eighth grade. Although it isn't off of that record, \"Where is my Mind?\" might be the best single track of all time. (See if you can guess how many listens it's got on Spotify.) Needless to say, we do think pretty highly of these guys, and we're excited to be seeing new music from them.",
            "The track name translates to \"seasickness,\" and, well, we think that's pretty cool. Guess that's what happens when you spend all that time swimmin' in the Caribbean.",
            "Anywho, \"Mal de Mer\" comes to us from the <i>Beneath the Eyrie Demos, Pt. 2</i>, a six-song set of demos released on Feb. 6. The Demos share their name with the Pixies' 7th studio album, <i>Beneath the Eyrie</i>, in September of this past year. Neither the record proper nor the full set of demos have been on our radar, so a little more listening is in order before commenting further."
        ]
    }, {
        "song": "Every Feeling",
        "artist": "Ezra Furman",
        "spotify_id": "0C2PTGRyAe4WxnMzqE2k1H",
        "post_page": "2020-02-10",
        "description_lines": [
            "An acoustic strumming effort over Furman's reverby vocals and angelic background singers, this is just a nice ballad. The softness of the track is offset nicely by the crudeness of some of the profane language. Usually profanity is lazy, but here it's put to really nice use."
        ]
    }, {
        "song": "Dream Boy",
        "artist": "Beach Bunny",
        "spotify_id": "6Fv3pbuEpVFqVZ6QlKELrP",
        "post_page": "2020-02-03",
        "description_lines": [
            "We think they call them Coastal Rabbits because they produce music at the rate rabbits produce, well, rabbits. This one's got all the <i>trappings</i> (get it?) of your typical BB/CR, but it throws us something new in the form of an offbeat and hiccupped chorus. It's jarring at first. Once you give it a full listen or two, though, it really works.",
            "Beach Bunny can do no wrong."
        ]
    }, {
        "song": "Devotion",
        "artist": "Pure Bathing Culture",
        "spotify_id": "6YJUIhFtN5zT5BcOjHKTzD",
        "post_page": "2020-02-03",
        "description_lines": [
            "As some of you know, we got really into the Unadulterated Bath Salts' 2013 record <i>Moon Tides</i>. That album was hazy and dreamy and made sense in our early 20s. (And, of course, it still slaps.) The group put out <i>Night Pass</i> in 2019. We left that record undetected but we are correcting that mistake now. \"Devotion\" still has that classic PBC/UBS sound, but it's punchier too. It left home, went through some stuff, and came back a changed man. The organic instrumentation and up-tempo electric guitar picking almost evoke Earth, Wind, and Fire or the Isley Brothers. That doesn't feel right. But we think it is."
        ]
    }, {
        "song": "Witchcraft\", \"Cellar Door\", and \"It Hurts",
        "artist": "Graveyard Club",
        "spotify_id": "2wQAEmgV0jsrmCHFpQgIS3",
        "post_page": "2020-02-03",
        "description_lines": [
            "How did we miss this group? First of all, Graveyard Club is an immediate inductee into our running Names Hall of Fames. These are moody, synth-based ballads that evoke parts of M83, Love You Later, Destroyer, and the kind of slow songs that kids swayed to together at the school dance in <i>Grease</i> (1978). They've apparently released several records, but their most popular track on Spotify has only a few hundred thousand listens. We're getting in on the ground floor here.",
            "These are the kinds of songs that make us meaningful. Soon we will spin them on a cool foggy night and go for an aimless drive without our cell phone, lost to the world and feeling ourselves for sure.",
            "Bonus point: The song \"Cellar Door\" is presumably a reference to Drew Barrymore's famous idea that \"cellar door\" is the most beautiful phrase in the English language."
        ]
    }, {
        "song": "Ever",
        "artist": "Tiny Deaths",
        "spotify_id": "63fX29WjwpFcXVtklq3nDr",
        "post_page": "2020-02-03",
        "description_lines": [
            "These guys have got a good bounce to 'em. Looks like they've been around for just a couple of records. Also very Graveyard Club wave, with a hint of that Naked and Famous song that held onto us for so long back in 2013. (For the preterite, \"Hearts Like Ours.\")"
        ]
    }, {
        "song": "Doubt",
        "artist": "Plastic Picnic",
        "spotify_id": "04yb3vE7oiVcm5mr9FUtDR",
        "post_page": "2020-02-03",
        "description_lines": [
            "This is a heady lil track from a group who've been around for a few years. First we've heard of 'em, though. They've got a little bit of a Vampire Weekend vibe to 'em. Not quite as original, but the singer's voice, the lyrical stylings, and the general bounciness kind of take it there. They're differentiated by an airy '80s synthiness, though."
        ]
    }, {
        "song": "America (You're Freaking Me Out)",
        "artist": "The Menzingers",
        "spotify_id": "7b7kOUu2KmSDCy6Ebglidg",
        "post_page": "2020-01-27",
        "description_lines": [
            "The Menzingers are frequently recommended to me. They've got a couple of solid tunes--see also \"Good Things\" and \"Burn After Writing\" off of <i>On the Impossible Past</i>--and this one falls into that category. \"America (You're Freaking Me Out)\" off of their newest LP, <i>Hello Exile</i>, reminds me of so much of my less-than-favorite-but-still-pretty-good punk music: you can rock along and you can even sing along--you just can't think about the lyrics.",
            "The one exception on this track? A line that hits hard: \"Oh, how do I steer my early 30's/before I shipwreck, before I'm 40?\" I imagine these guys would answer the question differently than I would. In fact, they'd probably answer it in a fashion diametrically opposed to mine--but that's okay. We don't need to agree on everything to spin tunes together."
        ]
    }, {
        "song": "21 Days",
        "artist": "Brian Fallon",
        "spotify_id": "2o52VjnXSD5Ce5Vs4ZDQeO",
        "post_page": "2020-01-27",
        "description_lines": [
            "I've been a fan of Brian Fallon ever since he recorded a lo-fi punk-infused Americana EP under the moniker of This Charming Man over a decade ago. That group changed their name to The Gaslight Anthem--one of the best band names I've ever encountered, especially given it contains zero references to the shoreline; think on it for a minute and you'll catch its meaning--and released five excellent, timeless LPs along with one EP of similar quality. They went on hiatus in 2015 and haven't been back since.",
            "In the years that have intervened, Fallon has released two solo records--both very, very solid--and seems to be on the verge of releasing his third. This is the second single off of that upcoming record, entitled <i>Local Honey</i>, and it represents an interesting hybrid for Fallon. The fast finger-picking of the first verse feints toward his usual Springsteen-infused Americana, but in come an almost electronic sounding 16th note drum pattern to break that up fast. I've never heard an effect like that in any of his music before.",
            "In the end, this one isn't going to stop any shows, but it promises to be a solid installment on what's likely to be an even more solid record."
        ]
    }, {
        "song": "Heads Gonna Roll",
        "artist": "Jenny Lewis",
        "spotify_id": "3JEQn0WheNcipQmxNxrxII",
        "post_page": "2020-01-27",
        "description_lines": [
            "I'm late to the party on this one, y'all. A former member of Rilo Kiley and a solo artist for years now, I've just discovered Jenny Lewis. Check out this track, which is just a really solid rock ballad. Another callback to Tobias Jesso, Jr. here--there's really no substitute for a well-written song. Also, the cover art for the album ain't half bad, either."
        ]
    }, {
        "song": "Cool for a Second",
        "artist": "Yumi Zouma",
        "spotify_id": "73nFIVUDo5k5SU67DoO4WX",
        "post_page": "2020-01-27",
        "description_lines": [
            "If there's a band that gets me in these last few years, it's Yumi Zouma. Their first two records--2016's <i>Yoncalla</i> and 2017's <i>Willowbank</i>--are the perfect soundtrack to the kinds of ways we like to leisure. As far as I can tell, \"Cool for a Second\" is a single off of an upcoming album of the same name, and it does not disappoint. It's got that classic YZ sound for sure. It's also got a little more of an organic, acoustic flare to it. As with all of YZ's stuff, this is best appreciated when day-drunk, yacht-dazed, and surrounded on all sides by the bony elegance of moneyed women."
        ]
    }, {
        "song": "Reality TV",
        "artist": "Remember Sports",
        "spotify_id": "1sfoP9lcJcZJS7f6hFNyOB",
        "post_page": "2020-01-27",
        "description_lines": [
            "A track from a group I'd never heard of before, this one's a garage rock/pop punk jingle jangle. It opens with some energetic power chords reminiscent of The Ramones' \"California Sun\" and never looks back. The jumpy jingle jangle of the track itself contrasts nicely with a blase vocal approach by the female singer. We don't have much more to say about this one--just give it a spin!"
        ]
    }, {
        "song": "Guts",
        "artist": "Augustine",
        "spotify_id": "5cVBkcYGi6aiG4cnTMfN6x",
        "post_page": "2020-01-20",
        "description_lines": [
            "Give it a minute. You'll be shocked it's not Passion Pit."
        ]
    }, {
        "song": "Cloud 9",
        "artist": "Beach Bunny",
        "spotify_id": "6vFsBXYczYsP0H3lgunZOm",
        "post_page": "2020-01-20",
        "description_lines": [
            "Fresh new Coastal Rabbits track! Y'all know what it do."
        ]
    }, {
        "song": "camouflage",
        "artist": "The Front Bottoms",
        "spotify_id": "4KgRsdomHDjbVhW8uZMOHj",
        "post_page": "2020-01-20",
        "description_lines": [
            "A real earworm, this one's been on repeat for the last couple of days. The overloud, shouted-not-sung vocal stylings of the verse are strongly reminiscent of The Talking Heads, and the whole thing crackles with a little bit of Violent Femmes, too. Maybe a dash of Pixies-dust in there as well? It's a keeper."
        ]
    }, {
        "song": "Cue Synthesizer",
        "artist": "Destroyer",
        "spotify_id": "2wcQaUeUAEOvGmtTFjw5th",
        "post_page": "2020-01-20",
        "description_lines": [
            "A single off of the upcoming record, this one does what a single's supposed to do: it shows promise. First of all, it's got that classic Destroyer vibe. (<i>Congratulations</i>, Y'all this, in other words, ain't.) It's also got those classic one-third spoken/one-third sung/one-third stuttered Destroyer lines. In terms of the sound, though, this is where it gets interesting. It's almost like Bejar is going in two different directions at once here. True to the track's name, there is a heavy electronic synth influence here. All of that, however, gets balanced against organic, classic rock-sounding guitar licks filtered through a telephone-style effect. It's like watching a play, except instead of watching the play, you've watching a video of it on your iPhone."
        ]
    }, {
        "song": "Sticky Thumbs",
        "artist": "Beach Slang",
        "spotify_id": "03bEjt5TXOi9qWEgCGhUQh",
        "post_page": "2020-01-20",
        "description_lines": [
            "Another beach band. It doesn't reach anywhere close to the pure energy and listening bliss of 2015's \"Throwaways\"--listen to that one on the Lay's Potato Chips model, if you know what I mean--but it's not a bad track by any stretch.",
            "Check out this rockin' new Coastal Dialects track. But, more importantly, check out \"Throwaways.\" These are ones that should be listened to loud, by the way."
        ]
    }, {
        "song": "Never-Ending Summer\" and \"Honey, I",
        "artist": "Wes Reeve",
        "spotify_id": "4dlBUunsUGfX9HJPAEop0f",
        "post_page": "2020-01-20",
        "description_lines": [
            "Based on the fact that she's got four total tracks on Spotify, this artist looks to be something of a newcomer. These two tracks, though, find a confident originality which may be beyond her years in business. Sounds like a four-way collab between Lanny del Rey, Andrew Bird, Joanna Newsom, and Vampire Weekend. Czech it out."
        ]
    }, {
        "song": null,
        "artist": "Pinegrove",
        "album" : "Cardinal",
        "spotify_id": "0FFdUsKsMIREY6IOcO92BB",
        "post_page": "2020-01-20",
        "description_lines": [
            "Apparently, this group has been around for a few years and has already built quite a following. But, to quote an Iraq war vet I once knew (speaking on the subject of a famous lute player), \"he can't be <i>that</i> famous--I never heard of him!\"",
            "The band name isn't exactly going to win any contests here, but the music is good. Like, really good, even though it is deceptively simple. In that sense (and in that sense only), it reminds me of Tobias Jesso, Jr.'s debut, <i>Goon</i>. Really simple, straightforward songs that you keep coming back to because they are so simply good.",
            "What do they sound like? What <i>don't</i> they sound like. They sound like someone showed up at a potluck with a dish made of equal parts Flake Music, <i>Silent Signs</i>-era DeYarmond Edison, and The Weakerthans, garnished with The Flaming Lips, and supplemented with hints of '90s staples like The Counting Crows and Matchbox Twenty. What? Yes. This is right. Then, it's like someone else at that potluck tasted that dish, and then went home and tried to recreate it in their kitchen from memory. Also the guy's voice kind of sounds a little like Daniel Johnston's, if DJ stayed on key. Separately, I've seen them described as \"alt-country,\" which feels close.",
            "If one track stands out, it's \"Aphasia.\" That being said, it's a short record. A rarity in 2020, this is one you probably just listen to from front to back.",
            "(See also: \"Angelina\" from the earlier record <i>Everything So Far</i>)"
        ]
    }, {
        "song": "Into the River Thames - Quartet Version\" and \"The Sea of Tranquility",
        "artist": "The Music Tapes Present: Songs of the Orbiting Human Circus, The Music Tapes, Julian Koster",
        "spotify_id": "4pRv46uLxbXUQ1F630LH4D",
        "post_page": "2020-01-13",
        "description_lines": [
            "As you can probably already appreciate, the Spotify listing for these two tracks is all jacked up. Let me know if you can't find them, and I'll link you.",
            "I stumbled across these tracks on a random Spotify shuffle session. I'd been lulled into apathy by a string of unremarkable tracks when these suddenly came on, causing me to sit up straight. Honestly, the less you know going in, the better. I'll just say that both tracks--the first is jazz and the second is, like, some sort of old-timey ballad--both sound like they were recorded in the industrial wasteland of David Lynch's <i>Eraserhead</i>. I mean, these tracks are <i>somethin' else</i>. Listen to both, and then go to the Wikipedia page for <i>The Orbiting Human Circus (of the Air)</i> to figure out what this is all about.",
            "Guys, I <i>need</i> your thoughts on these authentic vibes."
        ]
    }, {
        "song": "The Hamptons",
        "artist": "Transviolet",
        "spotify_id": "7G6vEhuSJqAht3Q22WUe2u",
        "post_page": "2020-01-13",
        "description_lines": [
            "A quick look at the lyrics for this one suggests that they were a three-way job between Bret Easton Ellis, Ottessa Moshfegh, and Jardine Libaire. In other words, this track is a danceable soundtrack to the kind of books we've loved over the last few years. It also foments the highly achievable fantasy of one day listening to this song in the very locale it names.",
            "Like if CHVRCHES were a bunch of blase, cynical rich kids."
        ]
    }, {
        "song": "How Many Nights Do You Dance with Tears in Your Eyes?",
        "artist": "Love You Later",
        "spotify_id": "0UsjzHtruXEAspoNqDRXEy",
        "post_page": "2020-01-13",
        "description_lines": [
            "It's hard to know what to do with this one. Nothing about it, really, should work. The title is overlong and on-the-nose, the drums sound like they're playing off of a pre-programmed Casio starter keyboard, and the keyboard melody itself has this hollow, wood-whistley tone that makes it sound like it camefromalanddownunda! But, in spite of all of that, I do keep coming back to it.",
            "I think the key is in the cover art to the record. It's an image of someone--presumably the artist/lead singer?--that looks like it came out of a yearbook from Napoleon Dynamite or off of one of those t-shirts that depict wolves howling at the moon in the woods. It suggests extreme earnestness, and I think that's what we're getting from this track? Who knows. Give it a spin and decide for yourself. "
        ]
    }, {
        "song": "Rich Girl",
        "artist": "Hall and Oates",
        "spotify_id": "0qRR9d89hIS0MHRkQ0ejxX",
        "post_page": "2020-01-13",
        "description_lines": [
            "Although this song is over a decade older than I am, I've just discovered it. There really isn't all that much to say. It's just a fun, classic, jaunty Hall and Oates joint. Plus, who doesn't love rich girls?"
        ]
    }, {
        "song": null,
        "artist": "Spielbergs",
        "album" : "This is Not the End",
        "spotify_id": "4HVmrS32pVCvmeipkQBoFV",
        "post_page": "2020-01-13",
        "description_lines": [
            "Because I'm still in the process of discovering this record, my thoughts here will be relatively brief. First of all, great band name. This is lo-fi, guitar-forward punk-inspired garage rock. And I mean guitar <i>forward</i>. These guys push their strings in the mix the way the NYT pushes progressive policies and Democratic candidates for office: front and center and in your face. Plus, they've got the two requisite ingredients for anthemic sing-alongs: catchy melodies and repetitious lyrics. I've been on more of a chick-rock kick lately, but I expect to spin this one a fair amount in the coming months."
        ]
    }, {
        "song": "Building the Ark",
        "artist": "Slaughter Beach, Dog",
        "spotify_id": "3wfyUi1pvAPXIEGQeIbvNB",
        "post_page": "2020-01-13",
        "description_lines": [
            "Now, I'll admit that the band name gave me fits at first. Was this two separate artists teaming up on a sick collab? (In other words, if this were a hip-hop song, would the title include the abbreviation 'feat.'?) Was the band name a list of two apparently unrelated items? It wasn't until I said it aloud that it hit me: 'Dog' is used like \"Dude\" here. As in:",
            "\"Things get pretty crazy around here, don't they?\"<br>\"(That's) Slaughter Beach (for you), Dog.\"",
            "Now that that's out of the way, onto what this sounds like. Wilco comes to mind. It sounds like the kind of thing that would play over Bill Murray smoking a cigarette and making an omelette in a light pink bath robe and slippers in some movie in which he plays a rental car agent who absconds with one of the vehicles and goes on an impromptu cross-country trip where he learns a little about love and a lot about himself."
        ]
    }, {
        "song": "Maid of the Mist",
        "artist": "Diet Cig",
        "spotify_id": "0Ob0FRlho5wKQqLS1Juk4w",
        "post_page": "2020-01-13",
        "description_lines": [
            "This one feels like cheating--I know that a few of you has been on this train for awhile, and he even made the rec to me awhile back. But I just checked it out, and it's true that this one slaps. Trebly, high-pitched, bubble-girl punk, albeit with a by-line packed with real shameless product placement. Minute Maid, Sierra Mist, and Diet products of all stripes offending. (The horror[s], the horror[s,]...of capitalism!)",
            "And another serious contender for the best band name ever.",
            "Between Goth Babe, Diet Cig, Beach Bunny, and so many others, have the last few years been a Renamessance for band names??"
        ]
    }, {
        "song": "Super Sad Always",
        "artist": "Melanie Faye",
        "spotify_id": "1BqSqUUGo1ilm7Pg4ghJvR",
        "post_page": "2020-01-07",
        "description_lines": [
            "An alternative R&B ballad that makes up 50% of this artist's current Spotify oeuvre. Warm, natural guitar tones contrast nicely with distant, muffled, reverb-y electronic drums and trap snare. The best part of this track is the use of an auto-tuned effect to step the lead vocal part up the scale in the chorus. It's like if Miguel covered \"Open\" by Rhye. If that doesn't land, then try this: I never really \"got\" The Weeknd--the music is forgettable but okay, the hair and spelling are unforgettable but not--but I imagine that what people do get from him is what I get from this song."
        ]
    }, {
        "song": null,
        "artist": "Tyler, The Creator",
        "album" : "Igor",
        "spotify_id": "5zi7WsKlIiUXv09tbGLKsE",
        "post_page": "2020-01-07",
        "description_lines": [
            "I kind of wrote off Tyler, The Creator back in college. First of all, the comma in his moniker is distracting and unnecessary. More than that, though, the entire Odd Future crew kind of came off as shock jocks to me.",
            "Not so here, however. I've only given this a couple listens at the time of this writing but already it's growing on me. The tongue-in-cheek, spooky scary vibe just <i>works</i>, especially in conjunction with the love story at the heart of the whole record. It's the same charming combination found in \"Saturday Night' by the Misfits, albeit in entirely different Halloween Zone make-up.",
            "I really like the mix of organic instrumentation (piano and drums on the intro track, \"Igor's Theme\") and more traditional rap synthesizers. And, speaking of synthesizers, there's some nice fuzz on some of them as well. The overall complexion reminds me almost of Panos Cosmatos' <i>Mandy</i> (2018) -- if Mandy had taken place in the hood. On Halloween. And if that doesn't work for you, try this: <i>Igor</i> is a collection of ballads in some universe in which Danny Brown's <i>Atrocity Exhibition</i> had, like The Beatles and Bob Dylan and Elvis in our universe, templated everything else that ever came after it. It translates some of the best sounds--the creaks and groans--from that record into something more approachable, more musical. It's not nearly as good a record as that one, but it is more digestible. "
        ]
    }, {
        "song": null,
        "artist": "Goth Babe",
        "album" : "Smith Rock",
        "spotify_id": "1iFNpfYW6jqir0jXis4vbp",
        "post_page": "2020-01-07",
        "description_lines": [
            "A nice little three-song EP from a group whose name alone is enough to land them on this list. This one feels like a little bit of a throwback. It feels like someone told the dude from Youth Lagoon that he had to switch half of the electronic sounds from every song to acoustic ones. It sounds like you're back in junior year of college."
        ]
    }, {
        "song": null,
        "artist": "pronoun",
        "album" : "i'll show you stronger",
        "spotify_id": "3fZqYNIujM9DnW0tOqeIPe",
        "post_page": "2020-01-07",
        "description_lines": [
            "The way that the refrain of the opening track, \"you're not trying at all,\" is breathlessly mumbled over whole note-held chords recalls Donna Lewis' \"I Love You Always Forever.\"",
            "Somehow equal parts <i>10 Things I Hate About You</i> and the climactic rooftop scene from <i>Vanilla Sky</i>, it's like if the music that moody, meaningful kids listened to in the mid-90s was a) made in 2019 and b) good."
        ]
    }, {
        "song": "Ms. California,\" \"Prom Queen,\" and \"Sports",
        "artist": "Beach Bunny",
        "spotify_id": "0WxZEci23tWn1YzikUljEt",
        "post_page": "2020-01-07",
        "description_lines": [
            "A good rule of thumb: the word \"beach\" in a band name promises at least a few good tracks. Think Beach Boys, Beach House, Beach Slang, Beach Fossils, and now, Beach Bunny.",
            "This is a lo-fi girl garage pop rock outfit that sounds like a cross between The Ergs, Charly Bliss, and Alvvays. I *love* these three tracks. Ms. Cali is the newest, sports the best production quality, and has maybe the best line I heard in a track from 2019: \"when you're gone, she sleeps in your t shirts.\" It seems to perfectly encapsulate the complicated female quasi-sexual jealousy that really drives their songs. The other two tracks are a little fuzzier, but equally infectious. If you made a wordcloud of the lyrics from these three tracks, the two largest terms would be \"calories\" and \"surgery.\" "
        ]
    }
]
