[
	{
        "song": "A Forest",
        "artist": "The Cure",
        "spotify_id": "3O4TPMOgChXOerSdB5WENH",
        "post_page": "2020-11-26",
        "description_lines": [
            "Hey guys come on The Cure is awesome, please tell me I am cool for liking it. Let's talk about our feelings, or let's just listen to The Cure tell us about their feelings in this number 12 hit single.",
            "This is my second paragraph about this stupid ass emo song. I love that shit though so you can suck it if you don't. How's that for a blog?"
        ]
    }, {
        "song": "Take on Me",
        "artist": "a-ha",
        "spotify_id": "2WfaOiMkCvy7F5fcp2zZ8L",
        "post_page": "2020-11-26",
        "description_lines": [
            "Woo hoo my second post now i need more text, I am jus going to repeat myself cuz I am bored. Woo hoo more text, I am jus going to repeat myself cuz I am bored. Woo hoo more text, I am jus going to repeat myself cuz I am bored. ",
            "This is my second paragraph about this stupid ass emo song. Woo hoo more text, I am jus going to repeat myself cuz I am bored. Woo hoo more text, I am jus going to repeat myself cuz I am bored. End of second paragraph for second post",
            "And here is a third line! I can print as many desc lines as you give me! <i>Here is some italic. </i><b>Here is some bold</b> - but really you shouldn't use i/b tags, you should use <a href='https://stackoverflow.com/questions/38205797/how-to-combine-bold-and-italic-in-css/38205861'>CSS classes</a>  instead!"
        ]
    }, {
        "song": "My Unknown Song",
        "artist": "Ale Alejandro",
        "post_page": "2020-11-26",
        "description_lines": [
            "Nothin much to say, this song isn't real.",
            "Notice how I did not print a spotify embed link cuz this one don't got one in the json!",
            "I know its big, but I didn't pull it out for air.."
        ]
    }, {
        "song": "Some other song",
        "artist": "Some other band",
        "spotify_id": "xxxx",
        "post_page": "2020-12-01",
        "description_lines": [
            "Woo hoo my third post but this shouldn't display with the first two posts because this is for a different date! now i need more text, I am jus going to repeat myself cuz I am bored. Woo hoo more text, I am jus going to repeat myself cuz I am bored. Woo hoo more text, I am jus going to repeat myself cuz I am bored. ",
            "This is my second paragraph about nothing. Woo hoo more text, I am jus going to repeat myself cuz I am bored. Woo hoo more text, I am jus going to repeat myself cuz I am bored. End of second paragraph for third post"
        ]
    }, {
        "song": "What Are Friends For?",
        "artist": "The Sonder Bombs",
        "spotify_id": "64F2l136oePmUwOG9zB1vU",
        "post_page": "2020-11-30",
        "description_lines": [
            "Speaking of pop punk, check out this track by The Sonder Bombs. (Fun fact from the band's website: \"sonder\" itself is a noun which apparently stands for the feeling that comes with the realization that all of the strangers around you are living lives as rich and meaningful--not necessarily in a good way--as yours.) This is fun, energetic, sad chick pop punk that sounds like a threesome between Beach Bunny (aka Coastal Rabbits), Sincere Engineer (aka Heartfelt Architect), and Snarls (good luck on that one), all of whom have graced places atop the WMT in weeks past.",
            "Our one minor complaint with this one is that we think it might've been better served by a more lo-fi approach. It feels a little produced at times, but is nevertheless highly listenable and seems to possess a strange power over the \"repeat\" button."
        ]
    }, {
        "song": "What Year Are We In",
        "artist": "Kitten",
        "spotify_id": "1jkCLNfGQJgymKExs4MGZs",
        "post_page": "2020-11-30",
        "description_lines": [
            "Kitten are stars of the WMT. \"Memphis\" (not to mention its acoustic follow-up) remains one of the best and most infectious songs we've ever had the privilege to cover, and the group took a turn towards <i>la resistance</i> with the COVID-era herd immunity anthem \"My House.\" (The cover art to that single depicted a nude demented looking version of the group's lead singer stuffed into a miniature-sized house and the lyrics explained  that \"I'm watchin the world freakin out from my couch/Don't know what they're talkin about in my house/I wanna have fun again, I wanna go out/But they told me to stay in my house.\") Now, Kitten continue their turn toward far-right extremism with another banger entitled \"What Year Are We In,\" which talks about the hopeless nature of protests, Zoom parties, and getting pissed off over conspiracy theories.",
            "As far as the sound, it's got a bounce to it. There are some synthy keys and horns, not to mention a drum machine, that make the whole thing sound like an updated '80s throwback, which fits in well with the name and theme. There are other parts of the track that remind one of Madness (and, of course, \"[Their] House\"). In the end, one of the things that really interests us about Kitten is that, of the four tracks of theirs which have made it onto the WMT, they're all bangers, but they all sound totally different"
        ]
    }, {
        "song": "Hurt Me Now",
        "artist": "ASL",
        "spotify_id": "6tDrZQQhEWrHsYafpziiwg",
        "post_page": "2020-11-30",
        "description_lines": [
            "a/s/l? (only kids from the '90s will get it!!!)",
            "Anyway, we stumbled across this track, from a group that seems only to have been making music since about 2018, over the course of this past week. It should be kind of a mess of a track, with lots of heavy synth, drum machines, tons of reverb, misplaced horns, and a borderline hip hop/spoken word chorus, but all of it comes together in a surprisingly pleasant way. This isn't a banger--it's not one that's going to carry you away immediately. It's got the vibes of Robbi Robb's \"In Time\" but without the power and meaningfulness. But if Blood Orange's \"Time Will Tell\" is the perfect track for a postgame a deux, then \"Hurt Me Now\" might work best for its melancholy solo equivalent."
        ]
    }, {
        "song": "Empty (Dirt Road)",
        "artist": "Metric",
        "spotify_id": "7z7PeijP5wMkEWHvTrWKer",
        "post_page": "2020-11-23",
        "description_lines": [
            "Metric are, as an act, nearly as old as us, and yet they are also relatively unfamiliar to us. We've heard of them, of course, and they seem to be favorites of a lot of our fellow travelers, but we've never really listened to them at all.",
            "Well, in 2005, they released in album called <i>Live it Out</i>, which opened with a track called \"Empty,\" which we've never heard before. We bring this up because, recently, they released an acoustic version of this song which came across our desk. \"Empty (Dirt Road),\" as this version is called, is pretty nice. It opens with a creaky, antique-y finger-picked acoustic guitar, a pretty resonant-sounding piano, and a whole lot of reverb. The track stretches and pops its' knuckles in ways that remind us of Marlon Williams' \"Strange Things\"--which you may recognize from the soundtrack of <i>Wild, Wild Country</i>--but without any of the creeping, old-timey eerieness of that track. Instead, what we've got here is melancholy, almost like Williams meets Jewel meets, at times, The Weakerthans.",
            "One of the things we like about this song is how long it lasts. It feels almost oppressive--it just goes on and on, and eventually resigns itself to its final, unbelieving refrain: \"I'm so glad I'm an island now\" [via Paul Simon and Garth Brooks]."
        ]
    }, {
        "song": "Walking on a String (Alt. Version)",
        "artist": "Matt Berninger, Phoebe Bridgers",
        "spotify_id": "4k4VlcZtwPBDj6wx5ewzog",
        "post_page": "2020-11-23",
        "description_lines": [
            "Because Phoebe Bridgers is one of our favorite young artists, anything to which her name is attached is of immediate interest to us. In 2019, Bridgers collab'd with The National's Matt Berninger to record a track called \"Walking on a String.\" They released two versions of the track--the original and the \"alt version.\" The first one is a little more Berninger-forward, while the alt version is more Bridgers-forward, and, since we like Phoebe Bridgers more than we like The National, the alt version is our version of choice. It really sounds like it could have been a hidden track on 2018's <i>Stranger in the Alps</i>. (If, by some unfortunate turn of events you haven't yet experienced <i>SITA</i>, you've got something great coming. It's a solid listen-through, but \"Motion Sickness\" and \"Scott Street\" are early Stan Doubts.)"
        ]
    }, {
        "song": "Special Berry",
        "artist": "standards",
        "spotify_id": "6wQxjMRiJ9uqCiJSV5yAU7",
        "post_page": "2020-11-23",
        "description_lines": [
            "Call it what you will: math rock, post-rock, whatever you want, standards is apparently an Ezra Koenig-lookin' motherfucker with a guitar, but he does a lot with it. This track reminds us a lot of Fang Island, or the happy-go-lucky younger brother to Joan of Arc, or even, at times, STS9. It's basically a single guitar riff extended to about 3 or 4 minutes and length and constantly recycled and reinterpreted according to different genres, techniques, and tempos. Think of it as an organic \"Grape Soda.\"",
            "This dude also has a vibe. If you check out the music video for standards, you'll note his, again, Ezra Koenig face, his cutesay fingerboard inlays, and his array of stuffed animals. It extends to the cover art for his (their?) recent record, <i>Fruit Island</i>, as well."
        ]
    }, {
        "song": "Prior Things",
        "artist": "Hop Along",
        "spotify_id": "3X2899UzmQjl7gz0JsH42k",
        "post_page": "2020-11-16",
        "description_lines": [
            "This one came to us via shuffle, and although we'd never heard of Hop Along before--and had, admittedly, to clarify which phrase was the band name and which was the song title--it felt really familiar. It has a nice, comfortable, strumming-on-an-acoustic-guitar momentum to it (though with a little buried bit of the sort of string-forward frenzy that's showcased on tracks like, say, \"Burn the Witch\" by Radiodome), and the unusual particulars of the lead female vocals reminded us of Francis Quinlan, who appeared on the WMT earlier this year with \"Piltdown Man.\"",
            "xIndeed, a quick Google search reveals that \"Piltdown Man\" is one of Quinlan's solo efforts, and that, as a day job, she fronts Hop Along. So, look at us. This track doesn't grab us as much as \"Piltdown Man\" did--that one felt like it was written after spending some time with Joanna Newsom's Divers (which, speaking of spending time with, is worth about 8 months of your time)--but it's not nothing, neither. "
        ]
    }, {
        "song": "Runaway Dog",
        "artist": "Retirement Party",
        "spotify_id": "75ZI6agJsfrauG2Az6myJK",
        "post_page": "2020-11-16",
        "description_lines": [
            "We'll start by saying that you've got to give this one a minute. When it first opens, it does so over about a minute of a coughy, polluted guitar and bass riff, but this is like one of those indie tracks from the early-to-mid aughties that builds and builds and builds. In that respect, it almost feels like Funeral-era Arcade Fire, but like, if they had just discovered distortion and were, like, mildly about it. All in all the best part of this track is the outro, when the same forward momentum that's been building throughout the entire track barrels down on you underneath a desperate, arpeggiated...is it synth? is it guitar?...riff.",
            "Once that first minute is over and the song starts to bloom, you'll get the idea pretty quickly. From there, you can make up your mind for yourself or not as to whether to keep things going."
        ]
    }, {
        "song": "Over You",
        "artist": "HOLYCHILD",
        "spotify_id": "0O9AJJwRYvtiVGMceCC7lF",
        "post_page": "2020-11-16",
        "description_lines": [
            "We deliberated over this one for a while. But, in the end, what's to deliberate over? It's a big, synthy, bombastic, chick-driven pop song, and isn't that what we're mostly about here at the WMT? The verses here plod along atop a four-on-the-floor drum beat. That pattern continues into the choruses, of course, but it's joined by an explosion of shimmery synth parts that really take everything over the top. Just over halfway through, we also get a nice interlude that tamps things down in a way that feels middle school meaningful.",
            "Who do they sound like? There's so much going on here that it's a little hard for us to tease it out. It's like a big sloppy mess of bubblegum Robyn and indie Ting Tings and Spiceworld-era Spice Girls. (The Weekly Music Thread--it's like wine tasting, but for random songs from Spotify.)",
            "And, for what it's worth, Wikipedia tells us that, back when they were together, HOLYCHILD were \"known for their use of pubic hair in music videos.\" But, then again, who isn't?"
        ]
    }, {
        "song": "two reverse",
        "artist": "Adrianne Lenker",
        "spotify_id": "630Ts93UYV4ULSjsBDQdvn",
        "post_page": "2020-11-09",
        "description_lines": [
            "Adrianne Lenker, best known for fronting Big Thief, has recently started releasing solo music, and this track (the opener to 2020's songs) is one which really grabbed us. A ballad driven by intricate, vaguely dissonant, and at-times-finger-picked strings, it feels like Big Thief (duh) meets Joanna Newsom meets recent Tallest Man on Earth. It's beautiful but melancholic, peaceful but with a touch of quiet frenzy to it, too. You best believe that this track is going to kick off on our part an exploration of more of Lenker's solo work."
        ]
    }, {
        "song": "faith healer",
        "artist": "Julien Baker",
        "spotify_id": "2hNXb6IDn3CvvHjjwauEM3",
        "post_page": "2020-11-09",
        "description_lines": [
            "We've been big fans of Julien Baker ever since she burst onto the scene with 2015's <i>Sprained Ankle</i>. (If you haven't already, listen to that whole record straight through, but if you must pick favorites, we recommend the eponymous \"Sprained Ankle,\" \"Everybody Does,\" \"Something,\" and the elegiac \"Go Home.\" Like Justin Vernon and Kristian Matsson, Baker's got a thing for ending guitar records with piano tracks.)",
            "Like Phoebe Bridgers (with whom she collabs in the form of Boygenius), Baker is following up soft-spoken success with louder, more electric efforts. And although \"faith healer\" definitely retains a lot of the beauty of Baker's earlier work, \"louder\" is definitely the right word--the track is, at times, downright cacophonous (relative, of course, to Baker's other work). This song feels more confident than anything else she's released before. We look forward to seeing where that goes."
        ]
    }, {
        "song": "Killing Floor",
        "artist": "Emma Ruth Rundle, Thou",
        "spotify_id": "7CdVWqLUcMrFQH2fakdhRi",
        "post_page": "2020-11-09",
        "description_lines": [
            "The first track on this week's list to receive proper capitalization, \"Killing Floor\" is a little different from the usual fare on the WMT. It opens with nearly a minute of spectral, synthy tones which sort of evoke Disintegration-era The Cure or William Basinki's Disintegration Loops. At nearly the one minute mark, however, we break into a synthy, sludgy, metallic lurching sort of drone which creeps its way along for the next five or so minutes. We're not sure if this one will stick or not, but it's a really cool track (and the cover art for the record is really cool)."
        ]
    }, {
        "song": "Television Romance",
        "artist": "Pale Waves",
        "spotify_id": "2diAlJqrMMX7Sv9FlzcUMc",
        "post_page": "2020-11-09",
        "description_lines": [
            "The title and band name alone were almost enough to land this track on the WMT. Come on, look at 'em--you just knew this was going to be up our alley.",
            "\"Television Romance\" is an instant banger. Even before you've heard the chorus, you know it's going to be an infectious synth pop dance anthem. It's got that organic, unsophisticated synth sexiness of, for example, a \"Kim and Jessie\" or a \"Graveyard Girl\" or a \"Hearts Like Ours.\" In all of these cases, what makes the refrain captivating is less its lyrical content and much more some sort of guitar and/or keys hook, and the same is true here. (That being said, repeating the phrase \"television romance\" over and over again has its own intoxicating adolescent import.)",
            "This song is like the soundtrack to some imagined, less affecting prequel to <i>Bright Lights, Big City</i>"
        ]
    }, {
        "song": "Wheels Roll Home",
        "artist": "The Antlers",
        "spotify_id": "1KtWevswskSNR37e8hi9iC",
        "post_page": "2020-11-09",
        "description_lines": [
            "What? Yes. New music from The Antlers--this is exciting stuff.",
            "As you may or may not recall, The Antlers released the single greatest album of all time in 2009's <i>Hospice</i>. Seriously. If this hasn't affected you, take the next 18-24 months and listen to it almost exclusively, just like we did. Not impressed on first listen? Okay. Join the club. Listen to it a second time. \"Oh, yeah, I guess 'Bear' and 'Two' are pretty good.\" Oh, do you? Listen to it a third time. \"Oh Sylvia is kind of cool, too, I guess.\" That so? Do it again and again and again until you begin to realize that every single moment of that record is more important than the most important moment of your life. But that's okay, because by that time, every single moment of that record will be a moment of your life, too.",
            "At any rate, after Hospice, The Antlers went on to release <i>Burst Apart</i> (2011), <i>Undersea</i> (2012), and <i>Familiars</i> (2014). Then, tragically, they stopped making music. In March of last year, however, rumors surfaced that they were recording again, and last week frontman Pete Silberbro and drummer Michael Lerner released the single \"Wheels Roll Home.\" Per Silberdude, \"'Wheels Roll Home' is a simple song about the hopeful promise of reunion after a long time gone. It's that feeling of finding home in someone, eager and impatient to build a life together. It's the experience of waiting out tumultuous times, longing for stability someday.\" As Timothee Chalamet might say, \"ca fait longtemps.\"",
            "As far as the track itself goes, it's very <i>Undersea/Familiars</i>-wave, but we're not complaining. We're looking forward to the full-length. In the meantime, as the temperature continues to go down, we plan on spending yet another winter--our twelfth straight--with <i>Hospice</i>."
        ]
    }, {
        "song": "Trust Me",
        "artist": "Sincere Engineer",
        "spotify_id": "72rJBBioVhxm4A3XajM3Yn",
        "post_page": "2020-11-09",
        "description_lines": [
            "For more on Sincere Engineer, check out this week's <i>Up the Punx</i> installment below.",
            "As for this track in particular, \"Trust Me\" is a 2020 single which we hope heralds the appearance of a full-length (or at least a few more singles) on the horizon. This is a little darker and more emo-informed than Sincere Engineer's earlier works, and the production is certainly more polished as well. To be frank, we'd actually recommend starting with 2017's <i>Rhombithian</i> (just see below already!) and then coming back to this emo banger. But you really can't go wrong--these guys make very solid garage punk music."           
        ]
    }, {
        "song": "SGL",
        "artist": "Now, Now",
        "spotify_id": "3speBfGPCck1oe47EBPnhh",
        "post_page": "2020-11-02",
        "description_lines": [
            "Although we're not familiar with this group, they seem to have something of a discography (along with something of a following). At any rate, this track, \"SGL\"--which presumably, based on the lyrics, stands for \"shotgun lover\"--is worth at least a few listens. There's a warmth to the recording effects on the eighth note acoustic guitar strumming that backs the whole thing, and it feels almost like the War on Drugs meets Phoebe Bridgers meets Washed Out? But that doesn't quite put a finger on it, does it?",
            "Also, the music video, which is almost nothing, is also somehow strangely affecting..."
        ]
    }, {
        "song": "Nobody Loves You",
        "artist": "Similar Kind",
        "spotify_id": "4hlQeZJV29wKrTPLmqXkab",
        "post_page": "2020-11-02",
        "description_lines": [
            "In contrast to this week's other offering, Similar Kind are a group with a small discography and a small following (less than one-tenth of the monthly listeners of Now, Now). That being said, this track is an infectious one. It carries forward with what feels like a hi-fi version of Flake Music energy, and there's a touch of The Cure in some of the guitar runs you'll hear in the background. Interestingly, the drums are a little bit busier than you typically get on this sort of track, and the mix is surprisingly bass-forward, but all of those contribute to a frenetic energy which kind of meshes with the lyrical content."
        ]
    }, {
        "song": "Easier to Love",
        "artist": "Kississippi",
        "spotify_id": "3GqVIRlygsC48rklRcAHTb",
        "post_page": "2020-10-26",
        "description_lines": [
            "We're newcomers to Kississippi. We've seen the name around but have never really gotten into them. We decided to give them a spin this week, and came across these two tracks.",
            "\"Easier to Love\" has a little bit of a Beach House vibe to it, what with the washed-out tremulousness, crisp and clean hi hat notes, and glassy, staircase-climbing guitar parts. But there's something else to it, too, almost like early Pure Bathing Culture.",
            "\"Around Your Room\" is a harder track. Right off the bat, it's got a fat, serious bass line, and it pairs it with big ass percussion. About the bass line--it's like something off of the Drive soundtrack. That being said, nothing else here really is. If \"Easier to Love\" was like Beach House + Pure Bathing Culture, \"Around Your Room\" is like Heartthrob-era Tegan and Sara + Lover-era Taylor Swift. (In fact, listening to \"Around Your Room\" and \"Cruel Summer\" back-to-back, there's a definite harmony there.) So, you do the math."
        ]
    }, {
        "song": "Around Your Room",
        "artist": "Kississippi",
        "spotify_id": "37C77C5KP3MZINt2P3HZUv",
        "post_page": "2020-10-26",
        "description_lines": [
            "We're newcomers to Kississippi. We've seen the name around but have never really gotten into them. We decided to give them a spin this week, and came across these two tracks.",
            "\"Easier to Love\" has a little bit of a Beach House vibe to it, what with the washed-out tremulousness, crisp and clean hi hat notes, and glassy, staircase-climbing guitar parts. But there's something else to it, too, almost like early Pure Bathing Culture.",
            "\"Around Your Room\" is a harder track. Right off the bat, it's got a fat, serious bass line, and it pairs it with big ass percussion. About the bass line--it's like something off of the Drive soundtrack. That being said, nothing else here really is. If \"Easier to Love\" was like Beach House + Pure Bathing Culture, \"Around Your Room\" is like Heartthrob-era Tegan and Sara + Lover-era Taylor Swift. (In fact, listening to \"Around Your Room\" and \"Cruel Summer\" back-to-back, there's a definite harmony there.) So, you do the math."
        
        ]
    }, {
        "song": "Die Waiting",
        "artist": "Beck",
        "spotify_id": "4qAGr8V6mMg9itQpzcIB38",
        "post_page": "2020-10-26",
        "description_lines": [
            "Beck is one of those artists we've always wanted to explore more. We spent a lot of time with Midnite Vultures (1999) for about two weeks in Boston, but past that, we've never really given the man his career's due. Perhaps one day.",
            "At any rate, we stumbled across this track, from 2019's <i>Hyperspace</i>, and quite liked it. (By the way, check out that album artwork.) It's a pretty mellow track and you get the hang of it quite quickly, but it's nice for driving around with the windows down when it's about 65 degrees outside and you vibin'."
        ]
    }, {
        "song": "The Whole of the Moon",
        "artist": "Kirin J Callinan",
        "spotify_id": "1601brj4nGFEWeOxe7KJuk",
        "post_page": "2020-10-26",
        "description_lines": [
            "This track comes to you courtesy of the dialysis queen of Durham. A musician who says that his primary motivation is to \"excite and confuse,\" Callinan makes these big, bombastic '80s informed anthems. This is a track which bounces along on its spritely synth and arena drums, but what we really like about it is the way Callinan strains when he reaches for certain notes. That, along with the soaring feeling of some of the guitar parts, really reminds us of John Parr's \"St. Elmo's Fire.\" (Interestingly, \"St. Elmo's Fire,\" which is the best song ever made, was written for the original soundtrack to <i>St. Elmo's Fire</i>, which is the worst movie ever made.) There's also a little bit of Robbie Robb's \"In Time\" here. (Interestingly, \"In Time,\" which is also the best song ever made, is part of the original soundtrack for <i>Bill and Ted's Excellent Adventure</i>, which is a pretty good movie.)"
        ]
    }, {
        "song": "Hate Mail (feat. J Mascis)",
        "artist": "Weakened Friends",
        "spotify_id": "6h5BX0HE5FoqrCP3xW8Txl",
        "post_page": "2020-10-26",
        "description_lines": [
            "We've had this track on repeat all week. It's a grungy, chick-fronted alternative track that features former Dinosaur, Jr. J. Mascis on a pretty squealy/shreddy guitar part. The verses have this sort of round, redundant, trundling feel to them, but transition into these sublime sing-along choruses heralded by some buried but reliable guitar scratches.",
            "Elements of this remind us of a much more laid-back and approachable White Lung. More on that below."
        ]
    }, {
        "song": "Wingspan",
        "artist": "Prinze George",
        "spotify_id": "5OftW7uxP2Z2rtbfkAbVjq",
        "post_page": "2020-10-19",
        "description_lines": [
            "This is a group we hadn't heard of before, with a few singles and a 2016 full-length by the excellent name of <i>Illiterate Synth Pop</i>. We'll investigate that one more fully in the week to come. As for this track, it's a pretty mellow, bassy ballad. It reminds us a little bit of Miel with a touch of that M83-style synth in the interlude. The track kicks up a little bit in the latter third with an octave jump in the vocals. There's nothing super stand-out here but it'd be fitting on a vibe playlist."
        ]
    }, {
        "song": "Only Acting",
        "artist": "Kero Kero Bonito",
        "spotify_id": "4aIoxZWHySrA3BpnmeREXJ",
        "post_page": "2020-10-19",
        "description_lines": [
            "Sometimes it seems like we've always been floating in the same orbit as Kero Kero Bonito. That being said, we've never really listened to them--until now.",
            "\"Only Acting\" is a track off of their 2018 <i>Time 'n' Place</i>. It opens up with a sing-song vocal melody over a drum machine and follows up by layering a bass line on top of that. This repeats for a while in a way that doesn't particularly grab you as a listener--until the entire track switches to a lofi take on organic instrumentation. At this point, the exact same arrangement feels utterly irresistible ,and we imagine it's hard to listen to on anything other than high volume (we haven't tried).",
            "It takes balls to break away from something so catchy, and KKB do exactly that. The song oscillates back and forth between this sort of pissed off daughter of Weezer vibe and a progressively cacophonous and electronic disintegration. Yes, there's a key change, but KKB undermine it almost immediately with aggressive glitching which heralds the end of the track. Although it's annoying to be taken away from the super infectious, driving side of this song, the whole thing kind of works, and we've listened to it in its entirety more than a few times at this point."
        ]
    }, {
        "song": "Hit Me Where It Hurts",
        "artist": "Caroline Polachek",
        "spotify_id": "2wcrQZ7ZJolYEfIaPP9yL4",
        "post_page": "2020-10-19",
        "description_lines": [
            "Back in 2019, Caroline Polachek's <i>Pang</i> appeared on a list of \"Best of\" lists, but we were never really able to access it. We're not sure whether or not that's still the case, but we came across <i>Pang's</i> \"Hit Me Where It Hurts\" last week and really liked it. It's got a dreamy, synthy, barred out borderline spoken word chorus melody that's vaguely reminiscent of Das Racist's \"Fashion Party,\" but this song isn't as light and tongue-in-cheek as that one is. The pre-chorus and chorus make that clear.",
            "This is a track that's at home on the same playlist as \"Wingspan,\" above."
        ]
    }, {
        "song": "",
        "artist": "Chumped",
        "album": "Chumped",
        "spotify_id": "7pVKWe8jRWOYxsnfhRoCci",
        "post_page": "2020-10-19",
        "description_lines": [
            "Chumped is a 2013 EP from the defunct, Brooklyn-based pop punk outfit of the same name. We encountered it this week for the first time and it really grabbed us. It's evocative of early Alkaline Trio meets The Ergs! meets maybe a little bit of Charly Bliss?--or at least that's the best we can do here. It's got a charming level of underproduction to it, and there's real energy and feeling behind these tracks."
        ]
    }
]
